{
  "quotes": [
    {
      "text": "DON'T WORRY ABOUT WHAT ANYBODY ELSE IS GOING TO DO. THE BEST WAY TO PREDICT THE FUTURE IS TO INVENT IT. -- ALAN KAY",
      "length": 115
    },
    {
      "text": "PREMATURE OPTIMIZATION IS THE ROOT OF ALL EVIL (OR AT LEAST MOST OF IT) IN PROGRAMMING. -- DONALD KNUTH",
      "length": 103
    },
    {
      "text": "LISP HAS JOKINGLY BEEN CALLED \"THE MOST INTELLIGENT WAY TO MISUSE A COMPUTER\". I THINK THAT DESCRIPTION IS A GREAT COMPLIMENT BECAUSE IT TRANSMITS THE FULL FLAVOR OF LIBERATION: IT HAS ASSISTED A NUMBER OF OUR MOST GIFTED FELLOW HUMANS IN THINKING PREVIOUSLY IMPOSSIBLE THOUGHTS. -- EDSGER DIJKSTRA, CACM, 15:10",
      "length": 311
    },
    {
      "text": "KEEP AWAY FROM PEOPLE WHO TRY TO BELITTLE YOUR AMBITIONS. SMALL PEOPLE ALWAYS DO THAT, BUT THE REALLY GREAT MAKE YOU FEEL THAT YOU, TOO, CAN BECOME GREAT. -- MARK TWAIN",
      "length": 168
    },
    {
      "text": "WHAT PAUL DOES, AND DOES VERY WELL, IS TO TAKE IDEAS AND CONCEPTS THAT ARE BEAUTIFUL IN THE ABSTRACT, AND BRINGS THEM DOWN TO A REAL WORLD LEVEL. THAT'S A RARE TALENT TO FIND IN WRITING THESE DAYS. -- JEFF \"HEMOS\" BATES, DIRECTOR, OSDN; CO-EVOLVER, SLASHDOT",
      "length": 257
    },
    {
      "text": "SINCE PROGRAMMERS CREATE PROGRAMS OUT OF NOTHING, IMAGINATION IS OUR ONLY LIMITATION. THUS, IN THE WORLD OF PROGRAMMING, THE HERO IS THE ONE WHO HAS GREAT VISION. PAUL GRAHAM IS ONE OF OUR CONTEMPORARY HEROES. HE HAS THE ABILITY TO EMBRACE THE VISION, AND TO EXPRESS IT PLAINLY. HIS WORKS ARE MY FAVORITES, ESPECIALLY THE ONES DESCRIBING LANGUAGE DESIGN. HE EXPLAINS SECRETS OF PROGRAMMING, LANGUAGES, AND HUMAN NATURE THAT CAN ONLY BE LEARNED FROM THE HACKER EXPERIENCE. THIS BOOK SHOWS YOU HIS GREAT VISION, AND TELLS YOU THE TRUTH ABOUT THE NATURE OF HACKING. -- YUKIHIRO \"MATZ\" MATSUMOTO, CREATOR OF RUBY",
      "length": 608
    },
    {
      "text": "TO FOLLOW THE PATH:     LOOK TO THE MASTER,     FOLLOW THE MASTER,     WALK WITH THE MASTER,     SEE THROUGH THE MASTER,     BECOME THE MASTER. -- MODERN ZEN POEM",
      "length": 162
    },
    {
      "text": "NO PROBLEM SHOULD EVER HAVE TO BE SOLVED TWICE. -- ERIC S. RAYMOND, HOW TO BECOME A HACKER",
      "length": 90
    },
    {
      "text": "ATTITUDE IS NO SUBSTITUTE FOR COMPETENCE. -- ERIC S. RAYMOND, HOW TO BECOME A HACKER",
      "length": 84
    },
    {
      "text": "IT IS SAID THAT THE REAL WINNER IS THE ONE WHO LIVES IN TODAY BUT ABLE TO SEE TOMORROW. -- JUAN MENG, REVIEWING \"THE FUTURE OF IDEAS\" BY LAWRENCE LESSIG",
      "length": 152
    },
    {
      "text": "FOOLS IGNORE COMPLEXITY. PRAGMATISTS SUFFER IT. SOME CAN AVOID IT. GENIUSES REMOVE IT. -- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 130
    },
    {
      "text": "A YEAR SPENT IN ARTIFICIAL INTELLIGENCE IS ENOUGH TO MAKE ONE BELIEVE IN GOD. -- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 121
    },
    {
      "text": "DEALING WITH FAILURE IS EASY: WORK HARD TO IMPROVE. SUCCESS IS ALSO EASY TO HANDLE: YOU'VE SOLVED THE WRONG PROBLEM. WORK HARD TO IMPROVE. -- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMI NG)",
      "length": 183
    },
    {
      "text": "WITHIN A COMPUTER NATURAL LANGUAGE IS UNNATURAL. -- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 92
    },
    {
      "text": "YOU THINK YOU KNOW WHEN YOU LEARN, ARE MORE SURE WHEN YOU CAN WRITE, EVEN MORE WHEN YOU CAN TEACH, BUT CERTAIN WHEN YOU CAN PROGRAM. -- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 176
    },
    {
      "text": "ADAPTING OLD PROGRAMS TO FIT NEW MACHINES USUALLY MEANS ADAPTING NEW MACHINES TO BEHAVE LIKE OLD ONES. -- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 146
    },
    {
      "text": "A LITTLE LEARNING IS A DANGEROUS THING. -- ALEXANDER POPE",
      "length": 57
    },
    {
      "text": "COMPUTER SCIENCE EDUCATION CANNOT MAKE ANYBODY AN EXPERT PROGRAMMER ANY MORE THAN STUDYING BRUSHES AND PIGMENT CAN MAKE SOMEBODY AN EXPERT PAINTER. -- ERIC RAYMOND",
      "length": 163
    },
    {
      "text": "EINSTEIN ARGUED THAT THERE MUST BE SIMPLIFIED EXPLANATIONS OF NATURE, BECAUSE GOD IS NOT CAPRICIOUS OR ARBITRARY. -- FREDERICK P. BROOKS, NO SLIVER BULLET.",
      "length": 155
    },
    {
      "text": "STUDENTS SHOULD BE EVALUATED ON HOW WELL THEY CAN ACHIEVE THE GOALS THEY STRIVED TO ACHIEVE WITHIN A REALISTIC CONTEXT. STUDENTS NEED TO LEARN TO DO THINGS, NOT KNOW THINGS. -- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 212
    },
    {
      "text": "WE REMEMBER WHAT WE LEARN WHEN WE CARE ABOUT PERFORMING BETTER AND WHEN WE BELIEVE THAT WHAT WE HAVE BEEN ASKED TO DO IS REPRESENTATIVE OF REALITY. -- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 186
    },
    {
      "text": "THERE REALLY IS NO LEARNING WITHOUT DOING. -- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 81
    },
    {
      "text": "WE REALLY HAVE TO GET OVER THE IDEA THAT SOME STUFF IS JUST WORTH KNOWING EVEN IF YOU NEVER DO ANYTHING WITH IT. HUMAN MEMORIES HAPPILY ERASE STUFF THAT HAS NO PURPOSE, SO WHY TRY TO FILL UP CHILDREN'S HEADS WITH SUCH STUFF? -- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 263
    },
    {
      "text": "THE ONLY PROBLEMS WE CAN REALLY SOLVE IN A SATISFACTORY MANNER ARE THOSE THAT FINALLY ADMIT A NICELY FACTORED SOLUTION. -- E. W. DIJKSTRA, THE HUMBLE PROGRAMMER",
      "length": 160
    },
    {
      "text": "THE BEST WAY TO LEARN TO LIVE WITH OUR LIMITATIONS IS TO KNOW THEM. --E. W. DIJKSTRA, THE HUMBLE PROGRAMMER",
      "length": 107
    },
    {
      "text": "THIS CHALLENGE, VIZ. THE CONFRONTATION WITH THE PROGRAMMING TASK, IS SO UNIQUE THAT THIS NOVEL EXPERIENCE CAN TEACH US A LOT ABOUT OURSELVES. IT SHOULD DEEPEN OUR UNDERSTANDING OF THE PROCESSES OF DESIGN AND CREATION, IT SHOULD GIVE US BETTER CONTROL OVER THE TASK OF ORGANIZING OUR THOUGHTS. IF IT DID NOT DO SO, TO MY TASTE WE SHOULD NO DESERVE THE COMPUTER AT ALL!  IT HAS ALLREADY TAUGHT US A FEW LESSONS, AND THE ONE I HAVE CHOSEN TO STRESS IN THIS TALK IS THE FOLLOWING. WE SHALL DO A MUCH BETTER PROGRAMMING JOB, PROVIDED THAT WE APPROACH THE TASK WITH A FULL APPRECIATION OF ITS TREMENDUOUS DIFFICULTY, PROVIDED THAT WE STICK TO MODEST AND ELEGANT PROGRAMMING LANGUAGES, PROVIDED THAT WE RESPECT THE INTRINSEC LIMITATIONS OF THE HUMAN MIND AND APPROACH THE TASK AS VERY HUMBLE PROGRAMMERS. -- E. W. DIJKSTRA, THE HUMBLE PROGRAMMER",
      "length": 838
    },
    {
      "text": "WE NOW COME TO THE DECISIVE STEP OF MATHEMATICAL ABSTRACTION: WE FORGET ABOUT WHAT THE SYMBOLS STAND FOR. ...[THE MATHEMATICIAN] NEED NOT BE IDLE; THERE ARE MANY OPERATIONS WHICH HE MAY CARRY OUT WITH THESE SYMBOLS, WITHOUT EVER HAVING TO LOOK AT THE THINGS THEY STAND FOR. -- HERMANN WEYL, THE MATHEMATICAL WAY OF THINKING",
      "length": 323
    },
    {
      "text": "AN EXPERT IS, ACCORDING TO MY WORKING DEFINITION \"SOMEONE WHO DOESN'T NEED TO LOOK UP ANSWERS TO EASY QUESTIONS\". -- ERIC LIPPERT.",
      "length": 130
    },
    {
      "text": "THE PROGRAMMER MUST SEEK BOTH PERFECTION OF PART AND ADEQUACY OF COLLECTION. -- ALAN J. PERLIS",
      "length": 94
    },
    {
      "text": "THUS, PROGRAMS MUST BE WRITTEN FOR PEOPLE TO READ, AND ONLY INCIDENTALLY FOR MACHINES TO EXECUTE. -- ALAN J. PERLIS",
      "length": 115
    },
    {
      "text": "WE CONTROL COMPLEXITY BY BUILDING ABSTRACTIONS THAT HIDE DETAILS WHEN APPROPRIATE. WE CONTROL COMPLEXITY BY ESTABLISHING CONVENTIONAL INTERFACES THAT ENABLE US TO CONSTRUCT SYSTEMS BY COMBINING STANDARD, WELL-UNDERSTOOD PIECES IN A ``MIX AND MATCH'' WAY. WE CONTROL COMPLEXITY BY ESTABLISHING NEW LANGUAGES FOR DESCRIBING A DESIGN, EACH OF WHICH EMPHASIZES PARTICULAR ASPECTS OF THE DESIGN AND DEEMPHASIZES OTHERS. -- ALAN J. PERLIS",
      "length": 432
    },
    {
      "text": "THE ACTS OF THE MIND, WHEREIN IT EXERTS ITS POWER OVER SIMPLE IDEAS, ARE CHIEFLY THESE THREE: 1. COMBINING SEVERAL SIMPLE IDEAS INTO ONE COMPOUND ONE, AND THUS ALL COMPLEX IDEAS ARE MADE. 2. THE SECOND IS BRINGING TWO IDEAS, WHETHER SIMPLE OR COMPLEX, TOGETHER, AND SETTING THEM BY ONE ANOTHER SO AS TO TAKE A VIEW OF THEM AT ONCE, WITHOUT UNITING THEM INTO ONE, BY WHICH IT GETS ALL ITS IDEAS OF RELATIONS. 3. THE THIRD IS SEPARATING THEM FROM ALL OTHER IDEAS THAT ACCOMPANY THEM IN THEIR REAL EXISTENCE: THIS IS CALLED ABSTRACTION, AND THUS ALL ITS GENERAL IDEAS ARE MADE. -- JOHN LOCKE, AN ESSAY CONCERNING HUMAN UNDERSTANDING (1690)",
      "length": 636
    },
    {
      "text": "LISP PROGRAMMERS KNOW THE VALUE OF EVERYTHING BUT THE COST OF NOTHING. -- ALAN J. PERLIS",
      "length": 88
    },
    {
      "text": "AN INTERPRETER RAISES THE MACHINE TO THE LEVEL OF THE USER PROGRAM; A COMPILER LOWERS THE USER PROGRAM TO THE LEVEL OF THE MACHINE LANGUAGE. -- SICP",
      "length": 148
    },
    {
      "text": "EVERYTHING SHOULD BE MADE AS SIMPLE AS POSSIBLE, BUT NO SIMPLER. -- ALBERT EINSTEIN",
      "length": 83
    },
    {
      "text": "THE GREAT DIVIDING LINE BETWEEN SUCCESS AND FAILURE CAN BE EXPRESSED IN FIVE WORDS: \"I DID NOT HAVE TIME.\" -- WESTHOST WEEKLY NEWSLETTER 14 FEB 2003",
      "length": 148
    },
    {
      "text": "WHEN YOUR ENEMY IS MAKING A VERY SERIOUS MISTAKE, DON'T BE IMPOLITE AND DISTURB HIM. -- NAPOLEON BONAPARTE (ALLEGEDLY)",
      "length": 118
    },
    {
      "text": "A CHARLATAN MAKES OBSCURE WHAT IS CLEAR; A THINKER MAKES CLEAR WHAT IS OBSCURE. -- HUGH KINGSMILL",
      "length": 97
    },
    {
      "text": "THERE ARE TWO WAYS OF CONSTRUCTING A SOFTWARE DESIGN; ONE WAY IS TO MAKE IT SO SIMPLE THAT THERE ARE OBVIOUSLY NO DEFICIENCIES, AND THE OTHER WAY IS TO MAKE IT SO COMPLICATED THAT THERE ARE NO OBVIOUS DEFICIENCIES. THE FIRST METHOD IS FAR MORE DIFFICULT. -- C. A. R. HOARE",
      "length": 272
    },
    {
      "text": "AND IF YOU GO TOO FAR UP, ABSTRACTION-WISE, YOU RUN OUT OF OXYGEN. SOMETIMES SMART THINKERS JUST DON'T KNOW WHEN TO STOP, AND THEY CREATE THESE ABSURD, ALL-ENCOMPASSING, HIGH-LEVEL PICTURES OF THE UNIVERSE THAT ARE ALL GOOD AND FINE, BUT DON'T ACTUALLY MEAN ANYTHING AT ALL. -- JOEL SPOLSKY",
      "length": 292
    },
    {
      "text": "THE THREE CHIEF VIRTUES OF A PROGRAMMER ARE: LAZINESS, IMPATIENCE AND HUBRIS. -- LARRY WALL (PROGRAMMING PERL)",
      "length": 110
    },
    {
      "text": "ALL NON-TRIVIAL ABSTRACTIONS, TO SOME DEGREE, ARE LEAKY. -- JOEL SPOLSKY (THE LAW OF LEAKY ABSTRACTIONS)",
      "length": 104
    },
    {
      "text": "XML WASN'T DESIGNED TO BE EDITED BY HUMANS ON A REGULAR BASIS. -- GUIDO VAN ROSSUM",
      "length": 82
    },
    {
      "text": "PREMATURE ABSTRACTION IS AN EQUALLY GREVIOUS SIN AS PREMATURE OPTIMIZATION. -- KEITH DEVENS",
      "length": 91
    },
    {
      "text": "YOU CAN HAVE PREMATURE GENERALIZATION AS WELL AS PREMATURE OPTIMIZATION. -- BJARNE STROUSTRUP",
      "length": 93
    },
    {
      "text": "HE CAUSES HIS SUN TO RISE ON THE EVIL AND THE GOOD, AND SENDS RAIN ON THE RIGHTEOUS AND THE UNRIGHTEOUS. -- MATTHEW 5:45",
      "length": 120
    },
    {
      "text": "A LANGUAGE THAT DOESN'T AFFECT THE WAY YOU THINK ABOUT PROGRAMMING, IS NOT WORTH KNOWING. -- ALAN PERLIS",
      "length": 104
    },
    {
      "text": "JE N'AI FAIT CELLE-CI PLUS LONGUE QUE PARCE QUE JE N'AI PAS EU LE LOISIR DE LA FAIRE PLUS COURTE. (I HAVE MADE THIS LETTER SO LONG ONLY BECAUSE I DID NOT HAVE THE LEISURE TO MAKE IT SHORTER.) -- BLAISE PASCAL (LETTRES PROVINCIALES)",
      "length": 231
    },
    {
      "text": "MEN NEVER DO EVIL SO COMPLETELY AND CHEERFULLY AS WHEN THEY DO IT FROM RELIGIOUS CONVICTION. -- BLAISE PASCAL (ATTRIBUTED)",
      "length": 122
    },
    {
      "text": "EVERYBODY MAKES THEIR OWN FUN. IF YOU DON'T MAKE IT YOURSELF, IT AIN'T FUN -- IT'S ENTERTAINMENT. -- DAVID MAMET (AS RELAYED BY JOSS WHEDON)",
      "length": 140
    },
    {
      "text": "IF WE WISH TO COUNT LINES OF CODE, WE SHOULD NOT REGARD THEM AS *LINES PRODUCED* BUT AS *LINES SPENT*. -- EDSGER DIJKSTRA",
      "length": 123
    },
    {
      "text": "SOMETIMES A MAN WITH TOO BROAD A PERSPECTIVE REVEALS HIMSELF AS HAVING NO REAL PERSPECTIVE AT ALL. A MAN WHO TRIES TOO HARD TO SEE EVERY SIDE MAY BE A MAN WHO IS TRYING TO AVOID CHOOSING ANY SIDE. A MAN WHO TRIES TOO HARD TO SEEK A DEEPER TRUTH MAY BE TRYING TO HIDE FROM THE TRUTH HE ALREADY KNOWS.  THAT IS NOT A SIGN OF INTELLECTUAL SOPHISTICATION AND \"GREAT THINKING\". IT IS A DEMONSTRATION OF MORAL DEGENERACY AND COWARDICE. -- STEVEN DEN BESTE",
      "length": 449
    },
    {
      "text": "OMIT NEEDLESS WORDS. -- WILLIAM STRUNK, JR. (THE ELEMENTS OF STYLE)",
      "length": 67
    },
    {
      "text": "I HAVE NEVER MET A MAN SO IGNORANT THAT I COULDN'T LEARN SOMETHING FROM HIM. -- GALILEO GALILEI",
      "length": 95
    },
    {
      "text": "A SOCIETY THAT PUTS EQUALITY -- IN THE SENSE OF EQUALITY OF OUTCOME -- AHEAD OF FREEDOM WILL END UP WITH NEITHER EQUALITY NOR FREEDOM. THE USE OF FORCE TO ACHIEVE EQUALITY WILL DESTROY FREEDOM, AND THE FORCE, INTRODUCED FOR GOOD PURPOSES, WILL END UP IN THE HANDS OF PEOPLE WHO USE IT TO PROMOTE THEIR OWN INTERESTS. -- MILTON FRIEDMAN (THOMAS SOWELL: A CONFLICT OF VISIONS, P130)",
      "length": 380
    },
    {
      "text": "PHILOSOPHY: THE FINDING OF BAD REASONS FOR WHAT ONE BELIEVES BY INSTINCT. -- BRAVE NEW WORLD (PARAPHRASED)",
      "length": 106
    },
    {
      "text": "OF ALL TYRANNIES A TYRANNY SINCERELY EXERCISED FOR THE GOOD OF ITS VICTIMS MAY BE THE MOST OPPRESSIVE. IT MAY BE BETTER TO LIVE UNDER ROBBER BARONS THAN UNDER OMNIPOTENT MORAL BUSYBODIES, THE ROBBER BARON'S CRUELTY MAY SOMETIMES SLEEP, HIS CUPIDITY MAY AT SOME POINT BE SATIATED; BUT THOSE WHO TORMENT US FOR OWN GOOD WILL TORMENT US WITHOUT END, FOR THEY DO SO WITH THE APPROVAL OF THEIR OWN CONSCIENCE. -- C.S. LEWIS",
      "length": 418
    },
    {
      "text": "FOOLS! DON'T THEY KNOW THAT TEARS ARE A WOMAN'S MOST EFFECTIVE WEAPON? -- CATWOMAN (THE BATMAN TV SERIES, EPISODE 83)",
      "length": 117
    },
    {
      "text": "IT'S LIKE A CONDOM; I'D RATHER HAVE IT AND NOT NEED IT THAN NEED IT AND NOT HAVE IT. -- SOME CHICK IN ALIEN VS. PREDATOR, WHEN ASKED WHY SHE ALWAYS CARRIES A GUN",
      "length": 161
    },
    {
      "text": "C++ IS HISTORY REPEATED AS TRAGEDY. JAVA IS HISTORY REPEATED AS FARCE. -- SCOTT MCKAY",
      "length": 85
    },
    {
      "text": "SIMPLICITY TAKES EFFORT-- GENIUS, EVEN. -- PAUL GRAHAM",
      "length": 54
    },
    {
      "text": "SHOW, DON'T TELL. -- UNKNOWN",
      "length": 28
    },
    {
      "text": "IN GOD I TRUST; I WILL NOT BE AFRAID. WHAT CAN MORTAL MAN DO TO ME? -- DAVID (PSALM 56:4)",
      "length": 89
    },
    {
      "text": "LINUX IS ONLY FREE IF YOUR TIME HAS NO VALUE. -- JAMIE ZAWINSKI",
      "length": 63
    },
    {
      "text": "CODE IS POETRY. -- WORDPRESS.ORG",
      "length": 32
    },
    {
      "text": "IF YOU CHOOSE NOT TO DECIDE, YOU STILL HAVE MADE A CHOICE. -- RUSH (FREEWILL)",
      "length": 77
    },
    {
      "text": "CIVILIZATION ADVANCES BY EXTENDING THE NUMBER OF IMPORTANT OPERATIONS WHICH WE CAN PERFORM WITHOUT THINKING ABOUT THEM. -- ALFRED NORTH WHITEHEAD (INTRODUCTION TO MATHEMATICS)",
      "length": 177
    },
    {
      "text": "THE FUNCTION OF WISDOM IS TO DISCRIMINATE BETWEEN GOOD AND EVIL. -- CICERO",
      "length": 74
    },
    {
      "text": "THE REASON TO DO ANIMATION IS CARICATURE. GOOD CARICATURE PICKS OUT THE ESSENSE OF THE STATEMENT AND REMOVES EVERYTHING ELSE. IT'S NOT SIMPLY ABOUT REPRODUCING REALITY; IT'S ABOUT BUMPING IT UP. -- BRAD BIRD, WRITER AND DIRECTOR, THE INCREDIBLES",
      "length": 245
    },
    {
      "text": "MISTAKES WERE MADE. -- RONALD REAGAN",
      "length": 36
    },
    {
      "text": "I WOULD RATHER BE AN OPTIMIST AND BE WRONG THAN A PESSIMIST WHO PROVES TO BE RIGHT. THE FORMER SOMETIMES WINS, BUT NEVER THE LATTER. -- \"HOOTS\"",
      "length": 143
    },
    {
      "text": "WHAT IS TRUTH? -- PONTIUS PILATE",
      "length": 32
    },
    {
      "text": "LIFE MOVES PRETTY FAST. IF YOU DON'T STOP AND LOOK AROUND ONCE IN A WHILE, YOU COULD MISS IT. -- FERRIS BUELLER",
      "length": 111
    },
    {
      "text": "LISP IS WORTH LEARNING FOR THE PROFOUND ENLIGHTENMENT EXPERIENCE YOU WILL HAVE WHEN YOU FINALLY GET IT; THAT EXPERIENCE WILL MAKE YOU A BETTER PROGRAMMER FOR THE REST OF YOUR DAYS, EVEN IF YOU NEVER ACTUALLY USE LISP ITSELF A LOT. -- ERIC S. RAYMOND",
      "length": 249
    },
    {
      "text": "ANY SUFFICIENTLY COMPLICATED C OR FORTRAN PROGRAM CONTAINS AN AD HOC, INFORMALLY SPECIFIED, BUG-RIDDEN, SLOW IMPLEMENTATION OF HALF OF COMMON LISP. -- PHILIP GREENSPUN (GREENSPUN'S TENTH RULE)",
      "length": 192
    },
    {
      "text": "I WAS TALKING RECENTLY TO A FRIEND WHO TEACHES AT MIT. HIS FIELD IS HOT NOW AND EVERY YEAR HE IS INUNDATED BY APPLICATIONS FROM WOULD-BE GRADUATE STUDENTS. \"A LOT OF THEM SEEM SMART,\" HE SAID. \"WHAT I CAN'T TELL IS WHETHER THEY HAVE ANY KIND OF TASTE.\" -- PAUL GRAHAM",
      "length": 267
    },
    {
      "text": "THE DIRECT PURSUIT OF HAPPINESS IS A RECIPE FOR AN UNHAPPY LIFE. -- DONALD CAMPBELL",
      "length": 83
    },
    {
      "text": "IT'S NO TRICK FOR TALENTED PEOPLE TO BE INTERESTING, BUT IT'S A GIFT TO BE INTERESTED. WE WANT AN ORGANIZATION FILLED WITH INTERESTED PEOPLE. -- RANDY S. NELSON (DEAN OF PIXAR UNIVERSITY)",
      "length": 187
    },
    {
      "text": "WHY TEACH DRAWING TO ACCOUNTANTS? BECAUSE DRAWING CLASS DOESN'T JUST TEACH PEOPLE TO DRAW. IT TEACHES THEM TO BE MORE OBSERVANT. THERE'S NO COMPANY ON EARTH THAT WOULDN'T BENEFIT FROM HAVING PEOPLE BECOME MORE OBSERVANT. -- RANDY S. NELSON (DEAN OF PIXAR UNIVERSITY)",
      "length": 266
    },
    {
      "text": "ALL PROBLEMS IN COMPUTER SCIENCE CAN BE SOLVED BY ANOTHER LEVEL OF INDIRECTION. -- BUTLER LAMPSON",
      "length": 98
    },
    {
      "text": "A DESIGNER KNOWS HE HAS ARRIVED AT PERFECTION NOT WHEN THERE IS NO LONGUER ANYTHING TO ADD, BUT WHEN THERE IS NO LONGUER ANYTHING TO TAKE AWAY. -- ANTOINE DE ST EXUPERY.",
      "length": 169
    },
    {
      "text": "FOR THE THINGS WE HAVE TO LEARN BEFORE WE CAN DO THEM, WE LEARN BY DOING THEM. -- ARISTOTLE.",
      "length": 92
    },
    {
      "text": "THERE ARE MANY WAYS TO AVOID SUCCESS IN LIFE, BUT THE MOST SURE-FIRE JUST MIGHT BE PROCRASTINATION. -- HARA ESTROFF MARANO.",
      "length": 123
    },
    {
      "text": "PI SECONDS IS A NANOCENTURY. -- [FACT]",
      "length": 38
    },
    {
      "text": "A NON NEGATIVE BINARY INTEGER VALUE X IS A POWER OF 2 IFF (X & (X-1)) IS 0 USING 2'S COMPLEMENT ARITHMETIC. -- [FACT]",
      "length": 117
    },
    {
      "text": "WHILE I’VE ALWAYS APPRECIATED BEAUTIFUL CODE, I SHARE JONATHAN’S CONCERN ABOUT STUDYING IT TOO MUCH. I THINK STUDYING BEAUTY IN MUSIC AND PAINTING HAS LED US TO MODERN CLASSICAL MUSIC AND PAINTING THAT THE MAJORITY OF US JUST DON’T GET. BEAUTY CAN BE SEEN WHEN IT EMERGES, BUT ISN’T SOMETHING TO STRIVE FOR IN ISOLATION OF A LARGER CONTEXT. IN THE SOFTWARE WORLD, THE LARGER CONTEXT WOULD BE THE UTILITY OF THE SOFTWARE TO THE END USER. -- [A COMMENT ON A BLOG]",
      "length": 461
    },
    {
      "text": "DONT GIVE USERS THE OPPORTUNITY TO LOCK THEMSELVES. -- UNKNOWN",
      "length": 62
    },
    {
      "text": "ANY FOOL CAN MAKE THE SIMPLE COMPLEX, ONLY A SMART PERSON CAN MAKE THE COMPLEX SIMPLE. -- UNKNOWN",
      "length": 97
    },
    {
      "text": "TO DO SOMETHING WELL YOU HAVE TO LOVE IT. SO TO THE EXTENT YOU CAN PRESERVE HACKING AS SOMETHING YOU LOVE, YOU'RE LIKELY TO DO IT WELL. TRY TO KEEP THE SENSE OF WONDER YOU HAD ABOUT PROGRAMMING AT AGE 14. IF YOU'RE WORRIED THAT YOUR CURRENT JOB IS ROTTING YOUR BRAIN, IT PROBABLY IS. -- PAUL GRAHAM.",
      "length": 299
    },
    {
      "text": "- IF YOU GIVE HIM A PENNY FOR HIS THOUGHTS, YOU'D GET CHANGE. - NOT THE SHARPEST KNIFE IN THE DRAWER. - A PRIME CANDIDATE FOR NATURAL DESELECTION. -- [IDEAS FOR FLAMEWARS]",
      "length": 171
    },
    {
      "text": "WHAT I DIDN'T UNDERSTAND WAS THAT THE VALUE OF SOME NEW ACQUISITION WASN'T THE DIFFERENCE BETWEEN ITS RETAIL PRICE AND WHAT I PAID FOR IT. IT WAS THE VALUE I DERIVED FROM IT. STUFF IS AN EXTREMELY ILLIQUID ASSET. UNLESS YOU HAVE SOME PLAN FOR SELLING THAT VALUABLE THING YOU GOT SO CHEAPLY, WHAT DIFFERENCE DOES IT MAKE WHAT IT'S \"WORTH?\" THE ONLY WAY YOU'RE EVER GOING TO EXTRACT ANY VALUE FROM IT IS TO USE IT. AND IF YOU DON'T HAVE ANY IMMEDIATE USE FOR IT, YOU PROBABLY NEVER WILL. -- PAUL GRAHAM",
      "length": 500
    },
    {
      "text": "ONLY BAD DESIGNERS BLAME THEIR FAILINGS ON THE USERS. -- UNKNOWN",
      "length": 64
    },
    {
      "text": "HUMANS AREN'T RATIONAL -- THEY RATIONALIZE. AND I DON'T JUST MEAN \"SOME OF THEM\" OR \"OTHER PEOPLE\". I'M TALKING ABOUT EVERYONE. WE HAVE A \"LOGIC ENGINE\" IN OUR BRAINS, BUT FOR THE MOST PART, IT'S NOT THE ONE IN THE DRIVER'S SEAT -- INSTEAD IT OPERATES AFTER THE FACT, GENERATING RATIONALIZATIONS AND EXCUSES FOR OUR BEHAVIOR. -- PAUL BUCHHEIT",
      "length": 342
    },
    {
      "text": "WHAT DO AMERICANS LOOK FOR IN A CAR? I'VE HEARD MANY ANSWERS WHEN I'VE ASKED THIS QUESTION. THE ANSWERS INCLUDE EXCELLENT SAFETY RATINGS, GREAT GAS MILEAGE, HANDLING, AND CORNERING ABILITY, AMONG OTHERS. I DON'T BELIEVE ANY OF THESE. THAT'S BECAUSE THE FIRST PRINCIPLE OF THE CULTURE CODE IS THAT THE ONLY EFFECTIVE WAY TO UNDERSTAND WHAT PEOPLE TRULY MEAN IS TO IGNORE WHAT THEY SAY. THIS IS NOT TO SUGGEST THAT PEOPLE INTENTIONALLY LIE OR MISREPRESENT THEMSELVES. WHAT IT MEANS IS THAT, WHEN ASKED DIRECT QUESTIONS ABOUT THEIR INTERESTS AND PREFERENCES, PEOPLE TEND TO GIVE ANSWERS THEY BELIEVE THE QUESTIONER WANTS TO HEAR. AGAIN, THIS IS NOT BECAUSE THEY INTEND TO MISLEAD. IT IS BECAUSE PEOPLE RESPOND TO THESE QUESTIONS WITH THEIR CORTEXES, THE PARTS OF THEIR BRAINS THAT CONTROL INTELLIGENCE RATHER THAN EMOTION OR INSTINCT. THEY PONDER A QUESTION, THEY PROCESS A QUESTION, AND WHEN THEY DELIVER AN ANSWER, IT IS THE PRODUCT OF DELIBERATION. THEY BELIEVE THEY ARE TELLING THE TRUTH. A LIE DETECTOR WOULD CONFIRM THIS. IN MOST CASES, HOWEVER, THEY AREN'T SAYING WHAT THEY MEAN. -- THE CULTURE CODE.",
      "length": 1104
    },
    {
      "text": "WHEN ALL YOU HAVE IS A HAMMER, EVERYTHING LOOKS LIKE A NAIL. -- UNKNOWN",
      "length": 71
    },
    {
      "text": "GOOD CODERS CODE, GREAT REUSE. -- HTTP://WWW.CATONMAT.NET",
      "length": 57
    },
    {
      "text": "THE LESSON OF THE STORY MIGHT APPEAR TO BE THAT SELF-INTERESTED AND AMBITIOUS PEOPLE IN POWER ARE OFTEN THE CAUSE OF WASTEFULNESS IN DEVELOPING COUNTRIES. BUT SELF-INTERESTED AND AMBITIOUS PEOPLE ARE IN POSITIONS OF POWER, GREAT AND SMALL, ALL OVER THE WORLD. IN MANY PLACES, THEY ARE RESTRAINED BY THE LAW, THE PRESS, AND DEMOCRATIC OPPOSITION. CAMEROON'S TRAGEDY IS THAT THERE IS NOTHING TO HOLD SELF-INTEREST IN CHECK. -- TIM HARFORD",
      "length": 436
    },
    {
      "text": "TO SOLVE YOUR PROBLEMS YOU MUST LEARN NEW SKILLS, ADAPT NEW THOUGHT PATTERNS, AND BECOME A DIFFERENT PERSON THAN YOU WERE BEFORE THAT PROBLEM.  GOD HAS CRAFTED YOU FOR SUCCESS. IN THE MIDDLE OF EVERY ADVERSITY LIE YOUR BEST OPPORTUNITIES. DISCOVER IT, BUILD UPON IT AND MOVE FORWARD IN YOUR JOURNEY TO LIVE AN EXTRAORDINARY LIFE.  YOU OWE IT TO YOURSELF TO LIVE A GREAT LIFE. DON’T LET NEGATIVE THOUGHTS PULL YOU DOWN. BE GRATEFUL AND OPEN TO LEARN AND GROW. -- HTTP://SECRETSOFSTUDYING.COM/",
      "length": 491
    },
    {
      "text": "IF THERE IS A WILL, THERE IS A WAY. -- UNKNOWN",
      "length": 46
    },
    {
      "text": "HAVING LARGE CASE STATEMENTS IN AN OBJECT-ORIENTED LANGUAGE IS A SURE SIGN YOUR DESIGN IS FLAWED. -- [FIXING ARCHITECTURE FLAWS IN RAILS' ORM]",
      "length": 142
    },
    {
      "text": "BEING A PROGRAMMER IS THE SAME WAY. THE ONLY WAY TO BE A GOOD PROGRAMMER IS TO WRITE CODE. WHEN YOU REALIZE YOU HAVEN'T BEEN WRITING MUCH CODE LATELY, AND IT SEEMS LIKE ALL YOU DO IS BRAG ABOUT CODE YOU WROTE IN THE PAST, AND PEOPLE START LOOKING AT YOU FUNNY WHILE YOU'RE SHOOTING YOUR MOUTH OFF, REALIZE IT'S BECAUSE THEY KNOW. THEY MIGHT NOT EVEN KNOW THEY KNOW, BUT THEY KNOW. SO, YES, DOING WHAT YOU LOVE BRINGS SUCCESS, AND BY ALL MEANS, THROW YOURSELF A NICE BIG PARTY, BUY YOURSELF A NICE CAR, SOAK UP THE ADULATION OF AN ADORING CROWD. THEN SHUT THE FUCK UP AND GET BACK TO WORK. -- SINCERITY THEORY",
      "length": 608
    },
    {
      "text": "ANOTHER FEATURE ABOUT THIS GUY IS HIS LOW THRESHOLD OF BOREDOM. HE'LL PICK UP ON A TASK AND WORK FRANTICALLY AT IT, ACCOMPLISHING WONDERS IN A SHORT TIME AND THEN GET BORED AND DROP IT BEFORE ITS PROPERLY FINISHED. HE'LL DO NOTHING BUT STRUM HIS GUITAR AND LIE AROUND IN BED FOR SEVERAL DAYS AFTER.  THATS ALSO PART OF THE PATTERN TOO; PERIODS OF FRENETIC ACTIVITY FOLLOWED BY PERIODS OF MELANCHOLIA, WITHDRAWAL AND INACTIVITY. THIS IS A BIPOLAR PERSONALITY. -- THE BIPOLAR LISP PROGRAMMER",
      "length": 489
    },
    {
      "text": "MY DREAM IS THAT PEOPLE ADOPT IT ON ITS OWN MERITS. WE'RE NOT TRYING TO BEND RUBY ON RAILS TO FIT THE ENTERPRISE, WE'RE ENCOURAGING ENTERPRISES TO BEND TO RUBY ON RAILS. COME IF YOU LIKE IT, STAY AWAY IF YOU DON'T. WE'RE NOT GOING HEAD OVER HEELS TO ACCOMMODATE THE ENTERPRISE OR TO LURE THEM AWAY FROM JAVA. THAT'S HOW YOU END UP WITH JAVA, IF YOU START BENDING TO SPECIAL INTEREST GROUPS. -- DAVID HEINEMEIER HANSSON (RUBY ON RAILS' CREATOR)",
      "length": 443
    },
    {
      "text": "NEW EYES HAVE X-RAY VISION.  [SOMEONE THAT HASN'T WRITTEN IT IS MORE LIKELY TO SPOT THE BUG. \"SOMEONE\" CAN BE YOU AFTER A BREAK] -- WILLIAM S. ANNIS",
      "length": 148
    },
    {
      "text": "SO - WHAT ARE THE MOST IMPORTANT PROBLEMS IN SOFTWARE ENGINEERING? I’D ANSWER “DEALING WITH COMPLEXITY”. -- MARK CHU-CARROLL",
      "length": 124
    },
    {
      "text": "SO THE MERE CONSTRAINT OF STAYING IN REGULAR CONTACT WITH US WILL PUSH YOU TO MAKE THINGS HAPPEN, BECAUSE OTHERWISE YOU'LL BE EMBARRASSED TO TELL US THAT YOU HAVEN'T DONE ANYTHING NEW SINCE THE LAST TIME WE TALKED. -- PAUL GRAHAM (A TALK AT Y COMBINATOR, FOR STARTUP CREATORS).",
      "length": 277
    },
    {
      "text": "THE CHOICE OF THE UNIVERSITY IS MOSTLY IMPORTANT FOR THE PIECE OF PAPER YOU GET AT THE END. THE EDUCATION YOU GET DEPENDS ON YOU. -- ANDREAS ZWINKAU",
      "length": 148
    },
    {
      "text": "REMEMBER THAT YOU ARE HUMANS IN THE FIRST PLACE AND ONLY AFTER THAT PROGRAMMERS. -- ALEXANDRU VANCEA",
      "length": 100
    },
    {
      "text": "HUMANS DIFFER FROM ANIMALS TO THE DEGREE THAT THEY ARE NOT MERELY AN END RESULT OF THEIR CONDITIONING, BUT ARE ABLE TO REFLECT ON THEIR EXPERIENCES AND STRATEGIES, AND APPLY INSIGHT TO MAKE CHANGES IN THE WAY THEY LIVE TO MODIFY THE OUTCOME. -- SLIDETROMBONE (COMMENT ON \"PROGRAMMING CAN RUIN YOUR LIFE\")",
      "length": 304
    },
    {
      "text": "AS BUILDERS AND CREATORS FINDING THE PERFECT SOLUTION SHOULD NOT BE OUR MAIN GOAL. WE SHOULD FIND THE PERFECT PROBLEM. -- ISAAC (BLOG COMMENT)",
      "length": 142
    },
    {
      "text": "JUST LIKE CARPENTRY, MEASURE TWICE CUT ONCE. -- SUPER-SIZING YOUTUBE WITH PYTHON (MIKE SOLOMON, MIKE@YOUTUBE.COM)",
      "length": 113
    },
    {
      "text": "THE GOOD THING ABOUT REINVENTING THE WHEEL IS THAT YOU GET A ROUND ONE. -- DOUGLAS CROCKFORD (AUTHOR OF JSON AND JSLINT)",
      "length": 120
    },
    {
      "text": "I FEEL IT IS EVERYBODIES OBLIGATION TO REACH FOR THE BEST IN THEMSELVES AND USE THAT FOR THE INTEREST OF MANKIND. -- CORNELUIS (COMMENT ON 'ARE YOU GOING TO CHANGE THE WORLD? (REALLY?)')",
      "length": 186
    },
    {
      "text": "ABSTRACTION IS A FORM OF DATA COMPRESSION: ABSOLUTELY NECESSARY, BECAUSE HUMAN SHORT-TERM MEMORY IS SO SMALL, BUT THE CRITICALLY IMPORTANT ASPECT OF ABSTRACTION IS THE ALGORITHM THAT GETS YOU FROM THE NAME BACK TO THE \"UNCOMPRESSED\" DETAILS. -- BRUCE WILDER (BLOG POST COMMENT)",
      "length": 277
    },
    {
      "text": "HAVE YOU EVER NOTICED THAT WHEN YOU SIT DOWN TO WRITE SOMETHING, HALF THE IDEAS THAT END UP IN IT ARE ONES YOU THOUGHT OF WHILE WRITING IT? THE SAME THING HAPPENS WITH SOFTWARE. WORKING TO IMPLEMENT ONE IDEA GIVES YOU MORE IDEAS. -- PAUL GRAHAM, THE OTHER ROAD AHEAD.",
      "length": 267
    },
    {
      "text": "IN GENERAL, WE CAN THINK OF DATA AS DEFINED BY SOME COLLECTION OF SELECTORS AND CONSTRUCTORS, TOGETHER WITH SPECIFIED CONDITIONS THAT THESE PROCEDURES MUST FULFILL IN ORDER TO BE A VALID REPRESENTATION. -- SICP, WHAT IS MEANT BY DATA?",
      "length": 234
    },
    {
      "text": "RESUME WRITING IS JUST LIKE DATING, OR APPLYING FOR A BANK LOAN, IN THAT NOBODY WANTS YOU IF YOU'RE DESPERATE. -- STEVE YEGGE.",
      "length": 126
    },
    {
      "text": "MASTERING ISN’T A SURVIVAL INSTINCT; IT’S AN URGE TO EXCEL. MASTERING IS ONE OF THE EXPERIENCES THAT DELINEATES US FROM ANIMALS. IT IS STRIVING TO BE MORE TOMORROW THAN WE ARE TODAY; TO PERFECTLY PITCH THE BALL OVER HOME PLATE; TO CRAFT THE PERFECT SENTENCE IN AN ARTICLE; TO OPEN THE OVEN AND FEEL THE WARM, RICHLY-SCENTED CLOUD TELLING YOU DINNER IS GOING TO BE ABSOLUTELY EXTRAORDINARY. WE HUMANS CRAVE PERFECTION, TO BE MASTERS OF OUR DOMAIN, TO DISTINGUISH OURSELVES BY SHEER SKILL AND PROWESS. -- JOESGOALS.COM",
      "length": 516
    },
    {
      "text": "IT(MASTERING)’S KNOWING WHAT YOU ARE DOING. -- JOESGOALS.COM",
      "length": 60
    },
    {
      "text": "WELL THEN. HOW COULD YOU POSSIBLY LIVE WITHOUT AUTOMATED REFACTORING TOOLS? HOW ELSE COULD YOU COORDINATE THE CATERPILLAR-LIKE MOTIONS OF ALL JAVA’S IDENTICAL TINY LEGS, ITS THOUSANDS OF SIMILAR PARTS? I’LL TELL YOU HOW: RUBY IS A BUTTERFLY. -- STEVEY, REFACTORING TRILOGY, PART 1.",
      "length": 281
    },
    {
      "text": "YOU WILL NEVER BECOME A GREAT PROGRAMMER UNTIL YOU ACKNOWLEDGE THAT YOU WILL ALWAYS BE A TERRIBLE PROGRAMMER. YOU WILL REMAIN A GREAT PROGRAMMER FOR ONLY AS LONG AS YOU ACKNOWLEDGE THAT YOU ARE STILL A TERRIBLE PROGRAMMER. -- MARC (HTTP://KICKIN-THE-DARKNESS.BLOGSPOT.COM/)",
      "length": 273
    },
    {
      "text": "IF I TELL YOU I'M GOOD, YOU WOULD PROBABLY THINK I'M BOASTING. IF I TELL YOU I'M NO GOOD, YOU KNOW I'M LYING. -- BRUCE LEE",
      "length": 122
    },
    {
      "text": "LET ME TRY TO GET THIS STRAIGHT: LISP IS A LANGUAGE FOR DESCRIBING ALGORITHMS. THIS WAS JOHNMCCARTHY'S ORIGINAL PURPOSE, ANYWAY: TO BUILD SOMETHING MORE CONVENIENT THAN A TURING MACHINE. LISP IS NOT ABOUT FILE, SOCKET OR GUI PROGRAMMING - LISP IS ABOUT EXPRESSIVE POWER. (FOR EXAMPLE, YOU CAN DESIGN MULTIPLE OBJECT SYSTEMS FOR LISP, IN LISP. OR IMPLEMENT THE NOW-FASHIONABLE AOP. OR DO ARBITRARY TRANSFORMATIONS ON PARSED SOURCE CODE.) IF YOU DON'T VALUE EXPRESSIVE POWER, LISP AIN'T FOR YOU. I, PERSONALLY, WOULD PREFER LISP TO NOT BECOME MAINSTREAM: THIS WOULD NECESSARILY INVOLVE A DUMBING DOWN. -- VLADIMIRSLEPNEV",
      "length": 618
    },
    {
      "text": "IF SOMETHING ISN’T WORKING, YOU NEED TO LOOK BACK AND FIGURE OUT WHAT GOT YOU EXCITED IN THE FIRST PLACE. -- DAVID GORMAN (IMTHERE.COM)",
      "length": 135
    },
    {
      "text": "OPPORTUNITIES THAT PRESENT THEMSELVES TO YOU ARE THE CONSEQUENCE -- AT LEAST PARTIALLY -- OF BEING IN THE RIGHT PLACE AT THE RIGHT TIME. THEY TEND TO PRESENT THEMSELVES WHEN YOU'RE NOT EXPECTING IT -- AND OFTEN WHEN YOU ARE ENGAGED IN OTHER ACTIVITIES THAT WOULD SEEM TO PRECLUDE YOU FROM PURSUING THEM. AND THEY COME AND GO QUICKLY -- IF YOU DON'T JUMP ALL OVER AN OPPORTUNITY, SOMEONE ELSE GENERALLY WILL AND IT WILL VANISH. -- MARC ANDREESSEN (HTTP://BLOG.PMARCA.COM/)",
      "length": 471
    },
    {
      "text": "PAY ATTENTION TO OPPORTUNITY COST AT ALL TIMES. DOING ONE THING MEANS NOT DOING OTHER THINGS. THIS IS A FORM OF RISK THAT IS VERY EASY TO IGNORE, TO YOUR DETRIMENT. -- MARC ANDREESSEN (HTTP://BLOG.PMARCA.COM/)",
      "length": 209
    },
    {
      "text": "SEIZE ANY OPPORTUNITY, OR ANYTHING THAT LOOKS LIKE OPPORTUNITY. THEY ARE RARE, MUCH RARER THAN YOU THINK... -- NASSIM NICHOLAS TALEB, \"THE BLACK SWAN\".",
      "length": 151
    },
    {
      "text": "I THINK THAT A LOT OF PROGRAMMERS ARE IGNORING AN IMPORTANT POINT WHEN PEOPLE TALK ABOUT REDUCING CODE REPETITION ON LARGE PROJECTS. PART OF THE IDEA IS THAT LARGE PROJECTS ARE INTRINSICALLY *WRONG*. THAT YOU SHOULD BE LOOKING AT MAKING A NUMBER OF SMALLER PROJECTS THAT ARE COMPOSABLE, EVEN IF YOU NEVER END UP REUSING ONE OF THOSE SMALLER PROJECTS ELSEWHERE. -- DAN NUGENT",
      "length": 374
    },
    {
      "text": "WE TEND TO SEEK EASY, SINGLE-FACTOR EXPLANATIONS OF SUCCESS. FOR MOST IMPORTANT THINGS, THOUGH, SUCCESS ACTUALLY REQUIRES AVOIDING MANY SEPARATE CAUSES OF FAILURE. -- JARED DIAMOND",
      "length": 180
    },
    {
      "text": "THINGS WHICH MATTER MOST MUST NEVER BE AT THE MERCY OF THINGS WHICH MATTER LEAST. -- JOHANN WOLFGANG VON GOETHE (1749-1832)",
      "length": 123
    },
    {
      "text": "I THINK THE ROOT OF YOUR MISTAKE IS SAYING THAT MACROS DON'T SCALE TO LARGER GROUPS. THE REAL TRUTH IS THAT MACROS DON'T SCALE TO STUPIDER GROUPS. -- PAUL GRAHAM, ON THE LIGHTWEIGHT LANGUAGES MAILING LIST.",
      "length": 205
    },
    {
      "text": "ARGUE WITH IDIOTS, AND YOU BECOME AN IDIOT. IF YOU COMPETE WITH SLAVES YOU BECOME A SLAVE. -- PAUL GRAHAM AND NORBERT WEINER, RESPECTIVELY",
      "length": 138
    },
    {
      "text": "ALWAYS DIVE DOWN INTO A PROBLEM AND GET YOUR HANDS ON THE DEEPEST ISSUE BEHIND THE PROBLEM. ALL OTHER CONSIDERATIONS ARE TO DISMISSED AS \"ENGINEERING DETAILS\"; THEY CAN BE SORTED OUT AFTER THE BASIC PROBLEM HAS BEEN SOLVED. -- CHRIS CRAWFORD",
      "length": 241
    },
    {
      "text": "DON'T HAVE GOOD IDEAS IF YOU AREN'T WILLING TO BE RESPONSIBLE FOR THEM. -- ALAN PERLIS",
      "length": 86
    },
    {
      "text": "IT IS IMPOSSIBLE TO SHARPEN A PENCIL WITH A BLUNT AXE. IT IS EQUALLY VAIN TO TRY TO DO IT WITH TEN BLUNT AXES INSTEAD.  -- EDSGER DIJKSTRA",
      "length": 138
    },
    {
      "text": "IF WE WISH TO COUNT LINES OF CODE, WE SHOULD NOT REGARD THEM AS LINES PRODUCED BUT AS LINES SPENT. -- EDSGER DIJKSTRA",
      "length": 117
    },
    {
      "text": "THE MOST DAMAGING PHRASE IN THE LANGUAGE IS, IT'S ALWAYS BEEN DONE THAT WAY. -- REAR ADMIRAL GRACE HOPPER",
      "length": 105
    },
    {
      "text": "GETTING BACK TO FAILING EARLY, I'VE LEARNED IT'S IMPORTANT TO COMPLETELY FAIL. GET FIRED. SHOOT THE PROJECT, THEN BURN ITS CORPSE. MELT THE CVS REPOSITORY AND MICROWAVE THE BACKUP CDS. WHEN THINGS GO WRONG, I'VE OFTEN TRIED TO PLAY THE HERO FROM START TO FINISH. GUESS WHAT? SOME PROJECTS ARE DOOMED NO MATTER WHAT. SOME NEED SKILLS I DON'T POSSESS. AND SOME NEED A FRESH FACE. -- REGINALD BRAITHWAITE",
      "length": 401
    },
    {
      "text": "THE ONLY THING A MAN SHOULD EVER BE 100% CONVINCED OF IS HIS OWN IGNORANCE. -- DJ MACLEAN",
      "length": 89
    },
    {
      "text": "THE BEST PEOPLE AND ORGANIZATIONS HAVE THE ATTITUDE OF WISDOM: THE COURAGE TO ACT ON WHAT THEY KNOW RIGHT NOW AND THE HUMILITY TO CHANGE COURSE WHEN THEY FIND BETTER EVIDENCE. THE QUEST FOR MANAGEMENT MAGIC AND BREAKTHROUGH IDEAS IS OVERRATED; BEING A MASTER OF THE OBVIOUS IS UNDERRATED. JIM MALONEY IS RIGHT: WORK IS AN OVERRATED ACTIVITY -- BOB SUTTON",
      "length": 354
    },
    {
      "text": "IN THEORY, THERE’S NO DIFFERENCE BETWEEN THEORY AND PRACTICE. BUT IN PRACTICE, THERE IS. -- ALBERT EINSTEIN",
      "length": 107
    },
    {
      "text": "ACT FROM REASON, AND FAILURE MAKES YOU RETHINK AND STUDY HARDER. ACT FROM FAITH, AND FAILURE MAKES YOU BLAME SOMEONE AND PUSH HARDER. --  ERIK NAGGUM",
      "length": 149
    },
    {
      "text": "MEASURE EVERYTHING YOU CAN ABOUT THE PRODUCT, AND YOU'LL START SEEING PATTERNS. -- MAX LEVCHIN, PAYPAL FOUNDER, TALK AT STARTUPSCHOOL2007",
      "length": 137
    },
    {
      "text": "SOMETHING CONFUSING ABOUT \"HARD\": IT'S TEMPTING TO THINK THAT IF IT'S HARD, THEN IT'S VALUABLE. MOST VALUABLE THINGS ARE HARD. MOST HARD THINGS ARE COMPLETELY USELESS -- (PICTURE OF SOMEONE SMASHING THEIR HEAD THROUGH CONCRETE BLOCKS KUNG-FU STYLE). HARD DOES NOT EQUATE TO BEING VALUABLE. REMEMBER FRIENDSTER BACK IN THE DAY? YOU'D SIGN IN, INVITE FRIENDS, HAVE 25 FRIENDS, GO TO THEIR PROFILE, AND THEN IT'D SHOW HOW YOU WERE CONNECTED TO EACH ONE. THAT'S AN IMPRESSIVE [SOME GEEKY CS JARGON] CONE TRAVERSAL OF A TREE - 100 MILLION STRING COMPARISONS PER PAGE -- IT WON'T SCALE. USED TO TAKE A MINUTE PER PAGE TO LOAD, AND FRIENDSTER DIED A PAINFUL DEATH. MYSPACE -- NOT INTERESTED IN SOLVING PROBLEMS THEY USE THE SHORTCUT OF \"MISS FITZPATRICK IS IN YOUR EXTENDED NETWORK\" (I.E. EVEN WHEN YOU'RE NOT EVEN SIGNED UP FOR MYSPACE) THEY DIDN'T SOLVE THE HARD PROBLEM. BUT THEY MAKE THE MORE RELEVANT ASSUMPTION THAT YOU WANT TO BE CONNECTED TO HOT WOMEN. [LOL] SHOWS ALEXA GRAPH SHOWING THAT IN EARLY 2005 MYSPACE TOOK OFF, AND QUICKLY BYPASSED FRIENDSTER AND NEVER LOOKED BACK. -- MAX LEVCHIN, PAYPAL FOUNDER, TALK AT STARTUPSCHOOL2007",
      "length": 1135
    },
    {
      "text": "QUALITY OF THE PEOPLE IS BETTER THAN THE QUALITY OF THE BUSINESS IDEA. CRAPPY PEOPLE CAN SCREW UP THE BEST IDEA IN THE WORLD. -- HADI PARTOVI & ALI PARTOVI (ILIKE.COM), TALK AT STARTUPSCHOOL2007",
      "length": 194
    },
    {
      "text": "THE ONLY CONSTANT IN THE WORLD OF HI-TECH IS CHANGE. -- MARK WARD",
      "length": 65
    },
    {
      "text": "WRITE IT PROPERLY FIRST. IT'S EASIER TO MAKE A CORRECT PROGRAM FAST, THAN TO MAKE A FAST PROGRAM CORRECT. -- HTTP://WWW.CPAX.ORG.UK/PRG/",
      "length": 136
    },
    {
      "text": "YOU CAN’T GET TO VERSION 500 IF YOU DON’T START WITH A VERSION 1. -- BETTEREXPLAINED.COM",
      "length": 88
    },
    {
      "text": "THE WONDERFUL AND FRUSTRATING THING ABOUT UNDERSTANDING YOURSELF IS THAT NOBODY CAN DO IT FOR YOU. -- BETTEREXPLAINED.COM",
      "length": 121
    },
    {
      "text": "WHEN YOU HAVE ELIMINATED THE IMPOSSIBLE, WHATEVER REMAINS, HOWEVER IMPROBABLE, MUST BE THE TRUTH. -- SHERLOCK HOLMES",
      "length": 116
    },
    {
      "text": "IN ORDER TO UNDERSTAND WHAT ANOTHER PERSON IS SAYING, YOU MUST ASSUME THAT IT IS TRUE AND TRY TO FIND OUT WHAT IT COULD BE TRUE OF. -- GEORGE MILLER",
      "length": 148
    },
    {
      "text": "A JOURNEY OF A THOUSAND MILES MUST BEGIN WITH A SINGLE STEP. -- LAO­TZU",
      "length": 71
    },
    {
      "text": "C’S GREAT FOR WHAT IT’S GREAT FOR. -- BEN HOYTS (MICROPLEDGE)",
      "length": 61
    },
    {
      "text": "THERE IS ONE MEANING [FOR STATIC IN C]: A GLOBAL VARIABLE THAT IS INVISIBLE OUTSIDE THE CURRENT SCOPE, BE IT A FUNCTION OR A FILE. -- PAOLO BONZINI",
      "length": 147
    },
    {
      "text": "PROCESSORS DON'T GET BETTER SO THAT THEY CAN HAVE MORE FREE TIME. PROCESSORS GET BETTER SO _YOU_ CAN HAVE MORE FREE TIME. -- LECAMARADE (FREESHELLS.CH)",
      "length": 151
    },
    {
      "text": "THE VENERABLE MASTER QC NA WAS WALKING WITH HIS STUDENT, ANTON.  HOPING TO PROMPT THE MASTER INTO A DISCUSSION, ANTON SAID \"MASTER, I HAVE HEARD THAT OBJECTS ARE A VERY GOOD THING - IS THIS TRUE?\"  QC NA LOOKED PITYINGLY AT HIS STUDENT AND REPLIED, \"FOOLISH PUPIL - OBJECTS ARE MERELY A POOR MAN'S CLOSURES.\"     CHASTISED, ANTON TOOK HIS LEAVE FROM HIS MASTER AND RETURNED TO HIS CELL, INTENT ON STUDYING CLOSURES.  HE CAREFULLY READ THE ENTIRE \"LAMBDA: THE ULTIMATE...\" SERIES OF PAPERS AND ITS COUSINS, AND IMPLEMENTED A SMALL SCHEME INTERPRETER WITH A CLOSURE-BASED OBJECT SYSTEM.  HE LEARNED MUCH, AND LOOKED FORWARD TO INFORMING HIS MASTER OF HIS PROGRESS.     ON HIS NEXT WALK WITH QC NA, ANTON ATTEMPTED TO IMPRESS HIS MASTER BY SAYING \"MASTER, I HAVE DILIGENTLY STUDIED THE MATTER, AND NOW UNDERSTAND THAT OBJECTS ARE TRULY A POOR MAN'S CLOSURES.\"  QC NA RESPONDED BY HITTING ANTON WITH HIS STICK, SAYING \"WHEN WILL YOU LEARN? CLOSURES ARE A POOR MAN'S OBJECT.\"  AT THAT MOMENT, ANTON BECAME ENLIGHTENED. -- ANTON VAN STRAATEN (NA = NORMAN ADAMS, QA = CHRISTIAN QUEINNEC)",
      "length": 1080
    },
    {
      "text": "UNDERSTANDING WHY C++ IS THE WAY IT IS HELPS A PROGRAMMER USE IT WELL. A DEEP UNDERSTANDING OF A TOOL IS ESSENTIAL FOR AN EXPERT CRAFTSMAN. -- BJARNE STROUSTRAP",
      "length": 160
    },
    {
      "text": "NO ART, HOWEVER MINOR, DEMANDS LESS THAN TOTAL DEDICATION IF YOU WANT TO EXCEL IN IT. -- ALBERTI",
      "length": 96
    },
    {
      "text": "THE MINUTE YOU PUT THE BLAME ON SOMEONE ELSE YOU’VE SWITCH THINGS FROM BEING A PROBLEM YOU CAN CONTROL TO A PROBLEM OUTSIDE OF YOUR CONTROL. -- ENGTECH (INTERNETDUCTTAPE.COM)",
      "length": 174
    },
    {
      "text": "STATE IS THE ROOT OF ALL EVIL. IN PARTICULAR FUNCTIONS WITH SIDE EFFECTS SHOULD BE AVOIDED. -- OO SUCKS (BLUETAIL.COM)",
      "length": 118
    },
    {
      "text": "ILS NE SONT PAS FORTS PARCE QU'ILS SONT FORTS. ILS SONT FORTS PARCE QUE NOUS SOMMES FAIBLES. -- RAGALA KHALID",
      "length": 109
    },
    {
      "text": "IT IS BETTER TO BE QUIET AND THOUGHT A FOOL THAN TO OPEN YOUR MOUTH AND REMOVE ALL DOUBT. -- WIKIHOW",
      "length": 100
    },
    {
      "text": "A TAIL CALL ALLOWS A FUNCTION TO RETURN THE RESULT OF ANOTHER FUNCTION WITHOUT LEAVING AN ENTRY ON THE STACK. TAIL RECURSION IS A SPECIFIC CASE OF TAIL CALLING. -- ASPN : PYTHON COOKBOOK : EXPLICIT TAIL CALL",
      "length": 207
    },
    {
      "text": "SIMPLICITY MEANS THE ACHIEVEMENT OF MAXIMUM EFFECT WITH MINIMUM MEANS. -- DR. KOICHI KAWANA",
      "length": 91
    },
    {
      "text": "NORMALITY IS THE ROUTE TO NOWHERE. -- RIDDERSTRALE & NORDSTORM, FUNKY BUSINESS",
      "length": 78
    },
    {
      "text": "THE PROBLEM IS THAT MICROSOFT JUST HAS NO TASTE. AND I DON'T MEAN THAT IN A SMALL WAY, I MEAN THAT IN A BIG WAY. -- STEVE JOBS",
      "length": 126
    },
    {
      "text": "DO YOU WANT TO SELL SUGARED WATER ALL YOUR LIFE OR DO YOU WANT TO CHANGE THE WORLD? -- STEVE JOBS, TO JOHN SCULLEY (FORMER PEPSI EXECUTIVE)",
      "length": 139
    },
    {
      "text": "1 - CREATIVITY AND INNOVATION ALWAYS BUILD ON THE PAST. 2 - THE PAST ALWAYS TRIES TO CONTROL THE CREATIVITY THAT BUILDS ON IT. 3 - FREE SOCIETIES ENABLE THE FUTURE BY LIMITING THE PAST. 4 - OURS IS LESS AND LESS A FREE SOCIETY. -- LAWRENCE LESSIG, FREE CULTURE.",
      "length": 261
    },
    {
      "text": "GOOD WORK IS NO DONE BY ‘HUMBLE’ MEN. -- H. HARDY, A MATHEMATICIAN'S APOLOGY.",
      "length": 77
    },
    {
      "text": "SIMPLICITY AND PRAGMATISM BEAT COMPLEXITY AND THEORY ANY DAY. -- DENNIS (BLOG COMMENT)",
      "length": 86
    },
    {
      "text": "THE PROOF IS BY REDUCTIO AD ABSURDUM, AND REDUCTIO AD ABSURDUM, WHICH EUCLID LOVED SO MUCH, IS ONE OF A MATHEMATICIAN’S FINEST WEAPONS. IT IS A FAR FINER GAMBIT THAN ANY CHESS GAMBIT: A CHESS PLAYER MAY OFFER THE SACRIFICE OF A PAWN OR EVEN A PIECE, BUT A MATHEMATICIAN OFFERS THE GAME. -- G. H. HARDY",
      "length": 301
    },
    {
      "text": "REMEMBER, ALWAYS BE YOURSELF ... UNLESS YOU SUCK! -- JOSS WHEDON",
      "length": 64
    },
    {
      "text": "ALL GREAT THINGS REQUIRE GREAT DEDICATION. -- CHUCK NORRIS(?)",
      "length": 61
    },
    {
      "text": "I'M ALWAYS HAPPY TO TRADE PERFORMANCE FOR READABILITY AS LONG AS THE FORMER ISN'T ALREADY SCARCE. -- CRAYZ (COMMENTOR ON BLOG.RAGANWALD.COM)",
      "length": 140
    },
    {
      "text": "YOU HAVE TO WRITE FOR YOUR AUDIENCE. I WOULD NEVER WRITE (1..5).MAP &'*2' IN JAVA WHEN I COULD WRITE LISTFACTORYFACTORY.GETLISTFACTORYFROMRESOURCE(     NEW RESOURCENAME('COM.JAVAX.MAGNITUDES.INTEGERS'). SETLOWERBOUND(1).SETUPPERBOUND(5).SETSTEP(1).APPLYFUNCTOR(     NEW FUNCTOR () { PUBLIC VOID EVAL (X) { RETURN X * 2; } })) I'M SIMPLIFYING, OF COURSE, I'VE LEFT OUT THE SECURITY AND LOGGING WRAPPERS. -- REGINALD BRAITHWAIT",
      "length": 425
    },
    {
      "text": "THE DEFINITION OF INSANITY IS DOING THE SAME THING OVER AND OVER AGAIN AND EXPECTING DIFFERENT RESULTS. -- BENJAMIN FRANKLIN",
      "length": 124
    },
    {
      "text": "A NO UTTERED FROM THE DEEPEST CONVICTION IS BETTER THAN A YES MERELY UTTERED TO PLEASE OR WHAT IS WORSE, TO AVOID TROUBLE. -- MAHATMA GANDHI",
      "length": 140
    },
    {
      "text": "I THINK IT IS WISE, AND ONLY HONEST, TO WARN YOU THAT MY GOAL IS IMMODEST. IT IS NOT MY PURPOSE TO \"TRANSFER KNOWLEDGE\" TO YOU THAT, SUBSEQUENTLY, YOU CAN FORGET AGAIN. MY PURPOSE IS NO LESS THAN TO EFFECTUATE IN EACH OF YOU A NOTICEABLE, IRREVERSABLE CHANGE. I WANT YOU TO GAIN, FOR THE REST OF YOUR LIVES, THE INSIGHT THAT BEAUTIFUL PROOFS ARE NOT \"FOUND\" BY TRIAL ANF ERROR BUT ARE THE RESULT OF A CONSCIOUSLY APPLIED DESIGN DISCIPLINE. I WANT YOU TO RAISE YOUR QUALITY STANDARDS. I MEAN, IF 10 YEARS FROM NOW, WHEN YOU ARE DOING SOMETHING QUICK AND DIRTY, YOU SUDDENLY VISUALIZE THAT I AM LOOKING OVER YOUR SHOULDERS AND SAY TO YOURSELF \"DIJKSTRA WOULD NOT HAVE LIKED THIS\", WELL, THAT WOULD BE ENOUGH IMMORTALITY FOR ME. -- E. W. DIJKSTRA",
      "length": 743
    },
    {
      "text": "THE GENERAL PRINCIPLE FOR COMPLEXITY DESIGN IS THIS: THINK LOCALLY, ACT LOCALLY. -- RICHARD P. GABRIEL & RON GOLDMAN, MOB SOFTWARE: THE EROTIC LIFE OF CODE",
      "length": 155
    },
    {
      "text": "PROGRAMMING IS THE ART OF FIGURING OUT WHAT YOU WANT SO PRECISELY THAT EVEN A MACHINE CAN DO IT. -- SOME GUY WHO ISN'T FAMOUS",
      "length": 125
    },
    {
      "text": "HENCE MY URGENT ADVICE TO ALL OF YOU TO REJECT THE MORALS OF THE BESTSELLER SOCIETY AND TO FIND, TO START WITH, YOUR REWARD IN YOUR OWN FUN. THIS IS QUITE FEASIBLE, FOR THE CHALLENGE OF SIMPLIFICATION IS SO FASCINATING THAT, IF WE DO OUR JOB PROPERLY, WE SHALL HAVE THE GREATEST FUN IN THE WORLD. -- E. W. DIJKSTRA, ON THE NATURE OF COMPUTING SCIENCE.",
      "length": 351
    },
    {
      "text": "REMEMBER: YOU ARE ALONE. EVERY TIME YOU CAN GET HELP FROM SOMEONE, IT IS AN OPPORTUNITY: YOU SHOULD EAGERLY SIZE IT. BUT THEN, PROMPTLY RETURN TO NORMAL MODE: YOU ARE ALONE AND YOU MUST BE PREPARED TO SOLVE EVERY PROBLEM YOURSELF. -- ERIC KEDJI",
      "length": 244
    },
    {
      "text": "MAKING ALL SOFTWARE INTO TOOLS REDUCES RISK. -- SMOOTHSPAN.COM",
      "length": 62
    },
    {
      "text": "SOME MAY SAY RUBY IS A BAD RIP-OFF OF LISP OR SMALLTALK, AND I ADMIT THAT. BUT IT IS NICER TO ORDINARY PEOPLE. -- MATZ, LL2",
      "length": 123
    },
    {
      "text": "C AND LISP STAND AT OPPOSITE ENDS OF THE SPECTRUM; THEY'RE EACH GREAT AT WHAT THE OTHER ONE SUCKS AT. -- STEVE YEGGE, TOUR DE BABEL.",
      "length": 132
    },
    {
      "text": "TWO PEOPLE SHOULD STAY TOGETHER IF TOGETHER THEY ARE BETTER PEOPLE THAN THEY WOULD BE INDIVIDUALLY. -- ?",
      "length": 104
    },
    {
      "text": "TO THE OPTIMIST, THE GLASS IS HALF FULL. TO THE PESSIMIST, THE GLASS IS HALF EMPTY. TO THE ENGINEER, THE GLASS IS TWICE AS BIG AS IT NEEDS TO BE. -- AUTHOR UNKNOWN (QUOTED IN `ROBUST SYSTEMS', GERALD JAY SUSEMAN)",
      "length": 212
    },
    {
      "text": "IT IS PRACTICALLY IMPOSSIBLE TO TEACH GOOD PROGRAMMING TO STUDENTS THAT HAVE HAD A PRIOR EXPOSURE TO BASIC: AS POTENTIAL PROGRAMMERS THEY ARE MENTALLY MUTILATED BEYOND HOPE OF REGENERATION. -- EDSGER DIJKSTRA",
      "length": 208
    },
    {
      "text": "WHATEVER IS WORTH DOING AT ALL, IS WORTH DOING WELL. -- EARL OF CHESTERFIELD",
      "length": 76
    },
    {
      "text": "RULES OF OPTIMIZATION: RULE 1: DON’T DO IT. RULE 2 (FOR EXPERTS ONLY): DON’T DO IT YET. -- M.A. JACKSON",
      "length": 103
    },
    {
      "text": "MORE COMPUTING SINS ARE COMMITTED IN THE NAME OF EFFICIENCY (WITHOUT NECESSARILY ACHIEVING IT) THAN FOR ANY OTHER SINGLE REASON - INCLUDING BLIND STUPIDITY. -- W.A. WULF",
      "length": 169
    },
    {
      "text": "WE SHOULD FORGET ABOUT SMALL EFFICIENCIES, SAY ABOUT 97% OF THE TIME: PREMATURE OPTIMIZATION IS THE ROOT OF ALL EVIL. -- DONALD KNUTH",
      "length": 133
    },
    {
      "text": "THE BEST IS THE ENEMY OF THE GOOD. -- VOLTAIRE",
      "length": 46
    },
    {
      "text": "THE JOB OF A LEADER TODAY IS NOT TO CREATE FOLLOWERS. IT’S TO CREATE MORE LEADERS. -- RALPH NADER",
      "length": 97
    },
    {
      "text": "THE PRESIDENT WAS VISITING NASA HEADQUARTERS AND STOPPED TO TALK TO A MAN WHO WAS HOLDING A MOP. “AND WHAT DO YOU DO?” HE ASKED. THE MAN, A JANITOR, REPLIED, “I’M HELPING TO PUT A MAN ON THE MOON, SIR.” -- THE LITTLE BOOK OF LEADERSHIP",
      "length": 235
    },
    {
      "text": "ONLY MAKE NEW MISTAKES. -- PHIL DOURADO",
      "length": 39
    },
    {
      "text": "YOU CAN RECOGNIZE TRUTH BY ITS BEAUTY AND SIMPLICITY. WHEN YOU GET IT RIGHT, IT IS OBVIOUS THAT IT IS RIGHT. -- RICHARD FEYNMAN",
      "length": 127
    },
    {
      "text": "TALKERS ARE NO GOOD DOERS. -- WILLIAM SHAKESPEARE, \"HENRY VI\"",
      "length": 61
    },
    {
      "text": "PHOTOGRAPHY IS PAINTING WITH LIGHT. -- ERIC HAMILTON",
      "length": 52
    },
    {
      "text": "GOOD ARTISTS COPY. GREAT ARTISTS STEAL. -- PABLO PICASSO",
      "length": 56
    },
    {
      "text": "A GUIDELINE IN THE PROCESS OF STEPWISE REFINEMENT SHOULD BE THE PRINCIPLE TO DECOMPOSE DECISIONS AS MUCH AS POSSIBLE, TO UNTANGLE ASPECTS WHICH ARE ONLY SEEMINGLY INTERDEPENDENT, AND TO DEFER THOSE DECISIONS WHICH CONCERN DETAILS OF REPRESENTATION AS LONG AS POSSIBLE. -- NIKLAUS WIRTH",
      "length": 285
    },
    {
      "text": "VIGOROUS WRITING IS CONCISE. A SENTENCE SHOULD CONTAIN NO UNNECESSARY WORDS, A PARAGRAPH NO UNNECESSARY SENTENCES, FOR THE SAME REASON THAT A DRAWING SHOULD HAVE NO UNNECESSARY LINES AND A MACHINE NO UNNECESSARY PARTS. THIS REQUIRES NOT THAT THE WRITER MAKE ALL SENTENCES SHORT OR AVOID ALL DETAIL AND TREAT SUBJECTS ONLY IN OUTLINE, BUT THAT EVERY WORD TELL. -- WILLIAM STRUNK, JR. (THE ELEMENTS OF STYLE)",
      "length": 406
    },
    {
      "text": "THE PROBLEM IS THAT SMALL EXAMPLES FAIL TO CONVINCE, AND LARGE EXAMPLES ARE TOO BIG TO FOLLOW. -- STEVE YEGGE.",
      "length": 110
    },
    {
      "text": "WE ARE THE SUM OF OUR BEHAVIOURS; EXCELLENCE THEREFORE IS NOT AN ACT BUT A HABIT. -- ARISTOTLE.",
      "length": 95
    },
    {
      "text": "THE PURPOSE OF ABSTRACTION IS NOT TO BE VAGUE, BUT TO CREATE A NEW SEMANTIC LEVEL IN WHICH ONE CAN BE ABSOLUTELY PRECISE. -- EDSGER DIJKSTRA",
      "length": 140
    },
    {
      "text": "EVERY MAN PREFERS BELIEF TO THE EXERCISE OF JUDGMENT. -- SENECA",
      "length": 63
    },
    {
      "text": "IT’S HARD TO GRASP ABSTRACTIONS IF YOU DON’T UNDERSTAND WHAT THEY’RE ABSTRACTING AWAY FROM. -- NATHAN WEIZENBAUM",
      "length": 112
    },
    {
      "text": "THAT IS ONE OF THE MOST DISTINCTIVE DIFFERENCES BETWEEN SCHOOL AND THE REAL WORLD: THERE IS NO REWARD FOR PUTTING IN A GOOD EFFORT. IN FACT, THE WHOLE CONCEPT OF A \"GOOD EFFORT\" IS A FAKE IDEA ADULTS INVENTED TO ENCOURAGE KIDS. IT IS NOT FOUND IN NATURE. -- PAUL GRAHAM",
      "length": 269
    },
    {
      "text": "I FIND THAT THE HARDER I WORK, THE MORE LUCK I SEEM TO HAVE. -- THOMAS JEFFERSON",
      "length": 80
    },
    {
      "text": "DON'T STAY IN BED, UNLESS YOU CAN MAKE MONEY IN BED. -- GEORGE BURNS",
      "length": 68
    },
    {
      "text": "IF EVERYTHING SEEMS UNDER CONTROL, YOU'RE NOT GOING FAST ENOUGH. -- MARIO ANDRETTI",
      "length": 82
    },
    {
      "text": "CHANCE FAVORS THE PREPARED MIND. -- LOUIS PASTEUR",
      "length": 49
    },
    {
      "text": "CONTROLLING COMPLEXITY IS THE ESSENCE OF COMPUTER PROGRAMMING. -- BRIAN KERNIGAN",
      "length": 80
    },
    {
      "text": "THE FUNCTION OF GOOD SOFTWARE IS TO MAKE THE COMPLEX APPEAR TO BE SIMPLE. -- GRADY BOOCH",
      "length": 88
    },
    {
      "text": "PROGRAMMERS ARE IN A RACE WITH THE UNIVERSE TO CREATE BIGGER AND BETTER IDIOT-PROOF PROGRAMS, WHILE THE UNIVERSE IS TRYING TO CREATE BIGGER AND BETTER IDIOTS.  SO FAR THE UNIVERSE IS WINNING. -- RICH COOK",
      "length": 204
    },
    {
      "text": "A HACKER ON A ROLL MAY BE ABLE TO PRODUCE–IN A PERIOD OF A FEW MONTHS–SOMETHING THAT A SMALL DEVELOPMENT GROUP (SAY, 7-8 PEOPLE) WOULD HAVE A HARD TIME GETTING TOGETHER OVER A YEAR.  IBM USED TO REPORT THAT CERTAIN PROGRAMMERS MIGHT BE AS MUCH AS 100 TIMES AS PRODUCTIVE AS OTHER WORKERS, OR MORE. -- PETER SEEBACH",
      "length": 314
    },
    {
      "text": "THE BEST PROGRAMMERS ARE NOT MARGINALLY BETTER THAN MERELY GOOD ONES. THEY ARE AN ORDER-OF-MAGNITUDE BETTER, MEASURED BY WHATEVER STANDARD: CONCEPTUAL CREATIVITY, SPEED, INGENUITY OF DESIGN, OR PROBLEM-SOLVING ABILITY. -- RANDALL E. STROSS",
      "length": 239
    },
    {
      "text": "A GREAT LATHE OPERATOR COMMANDS SEVERAL TIMES THE WAGE OF AN AVERAGE LATHE OPERATOR, BUT A GREAT WRITER OF SOFTWARE CODE IS WORTH 10,000 TIMES THE PRICE OF AN AVERAGE SOFTWARE WRITER. -- BILL GATES",
      "length": 197
    },
    {
      "text": "MEASURING PROGRAMMING PROGRESS BY LINES OF CODE IS LIKE MEASURING AIRCRAFT BUILDING PROGRESS BY WEIGHT. -- BILL GATES",
      "length": 117
    },
    {
      "text": "FIRST LEARN COMPUTER SCIENCE AND ALL THE THEORY.  NEXT DEVELOP A PROGRAMMING STYLE.  THEN FORGET ALL THAT AND JUST HACK. -- GEORGE CARRETTE",
      "length": 139
    },
    {
      "text": "TO ITERATE IS HUMAN, TO RECURSE DIVINE. -- L. PETER DEUTSCH",
      "length": 59
    },
    {
      "text": "THE BEST THING ABOUT A BOOLEAN IS EVEN IF YOU ARE WRONG, YOU ARE ONLY OFF BY A BIT. -- ANONYMOUS",
      "length": 96
    },
    {
      "text": "SHOULD ARRAY INDICES START AT 0 OR 1?  MY COMPROMISE OF 0.5 WAS REJECTED WITHOUT, I THOUGHT, PROPER CONSIDERATION. -- STAN KELLY-BOOTLE",
      "length": 135
    },
    {
      "text": "THE USE OF COBOL CRIPPLES THE MIND; ITS TEACHING SHOULD THEREFORE BE REGARDED AS A CRIMINAL OFFENSE. -- E.W. DIJKSTRA",
      "length": 117
    },
    {
      "text": "IT IS PRACTICALLY IMPOSSIBLE TO TEACH GOOD PROGRAMMING STYLE TO STUDENTS THAT HAVE HAD PRIOR EXPOSURE TO BASIC.  AS POTENTIAL PROGRAMMERS, THEY ARE MENTALLY MUTILATED BEYOND HOPE OF REGENERATION. -- E. W. DIJKSTRA",
      "length": 213
    },
    {
      "text": "ONE OF THE MAIN CAUSES OF THE FALL OF THE ROMAN EMPIRE WAS THAT–LACKING ZERO–THEY HAD NO WAY TO INDICATE SUCCESSFUL TERMINATION OF THEIR C PROGRAMS. -- ROBERT FIRTH",
      "length": 164
    },
    {
      "text": "SAYING THAT JAVA IS NICE BECAUSE IT WORKS ON ALL OSES IS LIKE SAYING THAT ANAL SEX IS NICE BECAUSE IT WORKS ON ALL GENDERS. -- ALANNA",
      "length": 133
    },
    {
      "text": "IF JAVA HAD TRUE GARBAGE COLLECTION, MOST PROGRAMS WOULD DELETE THEMSELVES UPON EXECUTION. -- ROBERT SEWELL",
      "length": 107
    },
    {
      "text": "SOFTWARE IS LIKE SEX: IT’S BETTER WHEN IT’S FREE. -- LINUS TORVALDS",
      "length": 67
    },
    {
      "text": "ANY CODE OF YOUR OWN THAT YOU HAVEN’T LOOKED AT FOR SIX OR MORE MONTHS MIGHT AS WELL HAVE BEEN WRITTEN BY SOMEONE ELSE. -- EAGLESON’S LAW",
      "length": 137
    },
    {
      "text": "GOOD PROGRAMMERS USE THEIR BRAINS, BUT GOOD GUIDELINES SAVE US HAVING TO THINK OUT EVERY CASE. -- FRANCIS GLASSBOROW",
      "length": 116
    },
    {
      "text": "CONSIDERING THE CURRENT SAD STATE OF OUR COMPUTER PROGRAMS, SOFTWARE DEVELOPMENT IS CLEARLY STILL A BLACK ART, AND CANNOT YET BE CALLED AN ENGINEERING DISCIPLINE. -- BILL CLINTON",
      "length": 178
    },
    {
      "text": "IF DEBUGGING IS THE PROCESS OF REMOVING BUGS, THEN PROGRAMMING MUST BE THE PROCESS OF PUTTING THEM IN. -- EDSGER W. DIJKSTRA",
      "length": 124
    },
    {
      "text": "ALWAYS CODE AS IF THE GUY WHO ENDS UP MAINTAINING YOUR CODE WILL BE A VIOLENT PSYCHOPATH WHO KNOWS WHERE YOU LIVE. -- MARTIN GOLDING",
      "length": 132
    },
    {
      "text": "EVERYTHING THAT CAN BE INVENTED HAS BEEN INVENTED. -- CHARLES H. DUELL, COMMISSIONER, U.S. OFFICE OF PATENTS, 1899",
      "length": 114
    },
    {
      "text": "I THINK THERE’S A WORLD MARKET FOR ABOUT 5 COMPUTERS. -- THOMAS J. WATSON, CHAIRMAN OF THE BOARD, IBM, CIRCA 1948",
      "length": 113
    },
    {
      "text": "IT WOULD APPEAR THAT WE HAVE REACHED THE LIMITS OF WHAT IT IS POSSIBLE TO ACHIEVE WITH COMPUTER TECHNOLOGY, ALTHOUGH ONE SHOULD BE CAREFUL WITH SUCH STATEMENTS, AS THEY TEND TO SOUND PRETTY SILLY IN 5 YEARS.  -- JOHN VON NEUMANN, CIRCA 1949",
      "length": 240
    },
    {
      "text": "BUT WHAT IS IT GOOD FOR? -- ENGINEER AT THE ADVANCED COMPUTING SYSTEMS DIVISION OF IBM, COMMENTING ON THE MICROCHIP, 1968",
      "length": 121
    },
    {
      "text": "THERE IS NO REASON FOR ANY INDIVIDUAL TO HAVE A COMPUTER IN HIS HOME. -- KEN OLSON, PRESIDENT, DIGITAL EQUIPMENT CORPORATION, 1977",
      "length": 130
    },
    {
      "text": "640K OUGHT TO BE ENOUGH FOR ANYBODY. -- BILL GATES, 1981",
      "length": 56
    },
    {
      "text": "WINDOWS NT ADDRESSES 2 GIGABYTES OF RAM, WHICH IS MORE THAN ANY APPLICATION WILL EVER NEED. -- MICROSOFT, ON THE DEVELOPMENT OF WINDOWS NT, 1992",
      "length": 144
    },
    {
      "text": "WE WILL NEVER BECOME A TRULY PAPER-LESS SOCIETY UNTIL THE PALM PILOT FOLKS COME OUT WITH WIPEME 1.0. -- ANDY PIERSON",
      "length": 116
    },
    {
      "text": "IF IT KEEPS UP, MAN WILL ATROPHY ALL HIS LIMBS BUT THE PUSH-BUTTON FINGER. -- FRANK LLOYD WRIGHT",
      "length": 96
    },
    {
      "text": "FUNCTIONAL PROGRAMMING IS LIKE DESCRIBING YOUR PROBLEM TO A MATHEMATICIAN.  IMPERATIVE PROGRAMMING IS LIKE GIVING INSTRUCTIONS TO AN IDIOT. -- ARCUS, #SCHEME ON FREENODE",
      "length": 169
    },
    {
      "text": "ITS A SHAME THAT THE STUDENTS OF OUR GENERATION GREW UP WITH WINDOWS AND MICE BECAUSE THAT TAINTED OUR MINDSET NOT TO THINK IN TERMS OF POWERFUL TOOLS. SOME OF US ARE JUST SO TAINTED THAT WE WILL NEVER RECOVER. -- JEFFREY MARK SISKIND <QOBI@RESEARCH.NJ.NEC.COM> IN COMP.LANG.LISP",
      "length": 279
    },
    {
      "text": "LISP IS A PROGRAMMABLE PROGRAMMING LANGUAGE. -- JOHN FODERARO",
      "length": 61
    },
    {
      "text": "I GUESS, WHEN YOU'RE DRUNK, EVERY WOMAN LOOKS BEAUTIFUL AND EVERY LANGUAGE LOOKS (LIKE) A LISP :) -- LAMENT, #SCHEME@FREENODE.NET",
      "length": 129
    },
    {
      "text": "MANY OF LIFE'S FAILURES ARE PEOPLE WHO DID NOT REALIZE HOW CLOSE THEY WERE TO SUCCESS WHEN THEY GAVE UP. -- THOMAS EDISON",
      "length": 121
    },
    {
      "text": "YOU MUST ALWAYS WORK NOT JUST WITHIN BUT BELOW YOUR MEANS. IF YOU CAN HANDLE THREE ELEMENTS, HANDLE ONLY TWO. IF YOU CAN HANDLE TEN, THEN HANDLE FIVE. IN THAT WAY THE ONES YOU DO HANDLE, YOU HANDLE WITH MORE EASE, MORE MASTERY AND YOU CREATE A FEELING OF STRENGTH IN RESERVE. -- PABLO PICASSO",
      "length": 292
    },
    {
      "text": "WHEN YOU’VE GOT THE CODE ALL RIPPED APART, IT’S LIKE A CAR THAT’S ALL DISASSEMBLED. YOU’VE GOT ALL THE PARTS TYING ALL OVER YOUR GARAGE AND YOU HAVE TO REPLACE THE BROKEN PART OR THE CAR WILL NEVER RUN. IT’S NOT FUN UNTIL THE CODE GETS BACK TO THE BASELINE AGAIN. -- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 334
    },
    {
      "text": "WELL, IF YOU TALK ABOUT PROGRAMMING TO A GROUP OF PROGRAMMERS WHO USE THE SAME LANGUAGE, THEY CAN BECOME ALMOST EVANGELISTIC ABOUT THE LANGUAGE. THEY FORM A TIGHT-KNIT COMMUNITY, HOLD TO CERTAIN BELIEFS, AND FOLLOW CERTAIN RULES IN THEIR PROGRAMMING. IT’S LIKE A CHURCH WITH A PROGRAMMING LANGUAGE FOR A BIBLE. -- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 381
    },
    {
      "text": "IT’S A PROBLEM IF THE DESIGN DOESN’T LET YOU ADD FEATURES AT A LATER DATE. IF YOU HAVE TO REDO A PROGRAM, THE HOURS YOU SPEND CAN CAUSE YOU TO LOSE YOUR COMPETITIVE EDGE. A FLEXIBLE PROGRAM DEMONSTRATES THE DIFFERENCE BETWEEN A GOOD DESIGNER AND SOMEONE WHO IS JUST GETTING A PIECE OF CODE OUT. -- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 365
    },
    {
      "text": "[HOW FRIENDLY WILL THIS MACHINE BE?] WELL, I DON’T THINK IT’S A MATTER OF FRIENDLINESS, BECAUSE ULTIMATELY IF THE PROGRAM IS GOING TO ACCOMPLISH ANYTHING OF VALUE, IT WILL PROBABLY BE RELATIVELY COMPLEX. -- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 274
    },
    {
      "text": "SOME PEOPLE SUGGEST THAT MACHINES WOULD BE FRIENDLIER IF INPUT COULD BE IN A NATURAL LANGUAGE. BUT NATURAL LANGUAGE IS PROBABLY THE WORST KIND OF INPUT BECAUSE IT CAN BE QUITE AMBIGUOUS. THE PROCESS OF RETRIEVING INFORMATION FROM THE COMPUTER WOULD BE SO TIME-CONSUMING THAT YOU WOULD BE BETTER OFF SPENDING THAT TIME GETTING THE INFORMATION DIRECTLY FROM AN EXPERT. -- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 437
    },
    {
      "text": "THE ONLY WAY OF DISCOVERING THE LIMITS OF THE POSSIBLE IS TO VENTURE A LITTLE WAY PAST THEM INTO THE IMPOSSIBLE. -- ARTHUR C. CLARKE",
      "length": 132
    },
    {
      "text": "ANY SUFFICIENTLY ADVANCED TECHNOLOGY IS UNDISTINGUISHABLE FROM MAGIC. -- ARTHUR C. CLARKE",
      "length": 89
    },
    {
      "text": "THAT IS THE INEVITABLE HUMAN RESPONSE. WE’RE RELUCTANT TO BELIEVE THAT GREAT DISCOVERIES ARE IN THE AIR. WE WANT TO BELIEVE THAT GREAT DISCOVERIES ARE IN OUR HEADS—AND TO EACH PARTY IN THE MULTIPLE THE PRESENCE OF THE OTHER PARTY IS INVARIABLY CAUSE FOR SUSPICION. -- MALCOLM GLADWELL, WHO SAYS BIG IDEAS ARE RARE? ",
      "length": 315
    },
    {
      "text": "GOOD IDEAS ARE OUT THERE FOR ANYONE WITH THE WIT AND THE WILL TO FIND THEM. -- MALCOLM GLADWELL, WHO SAYS BIG IDEAS ARE RARE?",
      "length": 125
    },
    {
      "text": "A PERSON WON'T BECOME PROFICIENT AT SOMETHING UNTIL HE OR SHE HAS DONE IT MANY TIMES. IN OTHER WORDS., IF YOU WANT SOMEONE TO BE REALLY GOOD AT BUILDING A SOFTWARE SYSTEM, HE OR SHE WILL HAVE TO HAVE BUILT 10 OR MORE SYSTEMS OF THAT TYPE. -- PHILIP GREENSPUN",
      "length": 258
    },
    {
      "text": "A PERSON WON'T RETAIN PROFICIENCY AT A TASK UNLESS HE OR SHE HAS AT ONE TIME LEARNED TO PERFORM THAT TASK VERY RAPIDLY. LEARNING RESEARCH DEMONSTRATES THAT THE SKILLS OF PEOPLE WHO BECOME ACCURATE BUT NOT FAST DETERIORATE MUCH SOONER THAN THE SKILLS OF PEOPLE WHO BECOME BOTH ACCURATE AND FAST. -- PHILIP GREENSPUN",
      "length": 314
    },
    {
      "text": "TRAINING RESEARCH SHOWS THAT IF YOU GET SPEED NOW YOU CAN GET QUALITY LATER. BUT IF YOU DON'T GET SPEED YOU WILL NEVER GET QUALITY IN THE LONG RUN. -- PHILIP GREENSPUN",
      "length": 167
    },
    {
      "text": "BEWARE OF BUGS IN THE ABOVE CODE; I HAVE ONLY PROVED IT CORRECT, NOT TRIED IT. -- DONALD KNUTH",
      "length": 94
    },
    {
      "text": "WEAR YOUR BEST FOR YOUR EXECUTION AND STAND DIGNIFIED. YOUR LAST RECOURSE AGAINST RANDOMNESS IS HOW YOU ACT — IF YOU CAN’T CONTROL OUTCOMES, YOU CAN CONTROL THE ELEGANCE OF YOUR BEHAVIOUR. YOU WILL ALWAYS HAVE THE LAST WORD. -- NASSIM TALEB",
      "length": 240
    },
    {
      "text": "THE HUMAN BRAIN STARTS WORKING THE MOMENT YOU ARE BORN AND NEVER STOPS UNTIL YOU STAND UP TO SPEAK IN PUBLIC. -- ANONYMOUS",
      "length": 122
    },
    {
      "text": "THE TROUBLE WITH THE WORLD IS THAT THE STUPID ARE ALWAYS COCKSURE AND THE INTELLIGENT ARE ALWAYS FILLED WITH DOUBT. -- BERTRAND RUSSELL",
      "length": 135
    },
    {
      "text": "SIMPLE, CLEAR PURPOSE AND PRINCIPLES GIVE RISE TO COMPLEX, INTELLIGENT BEHAVIOR. COMPLEX RULES AND REGULATIONS GIVE RISE TO SIMPLE, STUPID BEHAVIOR. -- DEE HOCK, BIRTH OF THE CHAORDIC AGE",
      "length": 187
    },
    {
      "text": "C++ IS LIKE TEENAGE SEX: EVERYBODY IS TALKING ABOUT IT ALL THE TIME, ONLY FEW ARE REALLY DOING IT. -- UNKNOWN",
      "length": 109
    },
    {
      "text": "FUNCTIONAL PROGRAMMING IS TO ALGORITHMS AS THE UBIQUITOUS LITTLE BLACK DRESS IS TO WOMEN'S FASHION. -- MARK TARVER (OF \"THE BIPOLAR LISP PROGRAMMER\" FAME)",
      "length": 154
    },
    {
      "text": "JAVA AND C++ MAKE YOU THINK THAT THE NEW IDEAS ARE LIKE THE OLD ONES. JAVA IS THE MOST DISTRESSING THING TO HIT COMPUTING SINCE MS-DOS. -- ALAN KAY",
      "length": 147
    },
    {
      "text": "FOR COMPLEX SYSTEMS, THE COMPILER AND DEVELOPMENT ENVIRONMENT NEED TO BE IN THE SAME LANGUAGE THAT ITS SUPPORTING. IT'S THE ONLY WAY TO GROW CODE. -- ALAN KAY",
      "length": 158
    },
    {
      "text": "SIMPLE THINGS SHOULD BE SIMPLE. COMPLEX THINGS SHOULD BE POSSIBLE. -- ALAN KAY",
      "length": 78
    },
    {
      "text": "I INVENTED THE TERM OBJECT-ORIENTED, AND I CAN TELL YOU I DID NOT HAVE C++ IN MIND. -- ALAN KAY",
      "length": 95
    },
    {
      "text": "ALL CREATIVITY IS AN EXTENDED FORM OF A JOKE. -- ALAN KAY",
      "length": 57
    },
    {
      "text": "IF YOU DON'T FAIL AT LEAST 90 PERCENT OF THE TIME, YOU'RE NOT AIMING HIGH ENOUGH. -- ALAN KAY",
      "length": 93
    },
    {
      "text": "REVOLUTIONS COME FROM STANDING ON THE SHOULDERS OF GIANTS AND FACING IN A BETTER DIRECTION. -- ALAN KAY",
      "length": 103
    },
    {
      "text": "IF IT LOOKS LIKE A DUCK, WALKS LIKE A DUCK, AND QUACKS LIKE A DUCK, IT'S A DUCK. -- OFFICIAL DEFINITION OF \"DUCK TYPING\"",
      "length": 120
    },
    {
      "text": "IN OO, IT'S THE DATA THAT IS THE \"IMPORTANT\" THING: YOU DEFINE THE CLASS WHICH CONTAINS MEMBER DATA, AND ONLY INCIDENTALLY CONTAINS CODE FOR MANIPULATING THE OBJECT. IN FP, IT'S THE CODE THAT'S IMPORTANT: YOU DEFINE A FUNCTION WHICH CONTAINS CODE FOR WORKING WITH THE DATA, AND ONLY INCIDENTALLY DEFINE WHAT THE DATA IS. -- ALMKGOR, ON REDDIT",
      "length": 342
    },
    {
      "text": "IT WAS EDISON WHO SAID ‘1% INSPIRATION, 99% PERSPIRATION’. THAT MAY HAVE BEEN TRUE A HUNDRED YEARS AGO. THESE DAYS IT'S ‘0.01% INSPIRATION, 99.99% PERSPIRATION’, AND THE INSPIRATION IS THE EASY PART. -- LINUX TORVALDS",
      "length": 217
    },
    {
      "text": "THE GREATEST CHALLENGE TO ANY THINKER IS STATING THE PROBLEM IN A WAY THAT WILL ALLOW A SOLUTION. -- BERTRAND RUSSELL",
      "length": 117
    },
    {
      "text": "NO MATTER HOW MUCH YOU PLAN YOU’RE LIKELY TO GET HALF WRONG ANYWAY. SO DON’T DO THE ‘PARALYSIS THROUGH ANALYSIS’ THING. THAT ONLY SLOWS PROGRESS AND SAPS MORALE. -- 37 SIGNAL, GETTING REAL",
      "length": 188
    },
    {
      "text": "[INNOVATION] COMES FROM SAYING NO TO 1,000 THINGS TO MAKE SURE WE DON’T GET ON THE WRONG TRACK OR TRY TO DO TOO MUCH. WE’RE ALWAYS THINKING ABOUT NEW MARKETS WE COULD ENTER, BUT IT’S ONLY BY SAYING NO THAT YOU CAN CONCENTRATE ON THE THINGS THAT ARE REALLY IMPORTANT. -- STEVE JOBS",
      "length": 280
    },
    {
      "text": "THE ABILITY TO SIMPLIFY MEANS TO ELIMINATE THE UNNECESSARY SO THAT THE NECESSARY MAY SPEAK. -- HANS HOFMANN",
      "length": 107
    },
    {
      "text": "HOWEVER BEAUTIFUL THE STRATEGY, YOU SHOULD OCCASIONALLY LOOK AT THE RESULTS. -- WINSTON CHURCHILL",
      "length": 97
    },
    {
      "text": "GENIUS IS 1% INSPIRATION AND 99% PERSPIRATION. -- THOMAS EDISON",
      "length": 63
    },
    {
      "text": "I’D RATHER WRITE PROGRAMS TO WRITE PROGRAMS THAN WRITE PROGRAMS. -- RICHARD SITES",
      "length": 81
    },
    {
      "text": "SIDE PROJECTS ARE LESS MASTURBATORY THAN READING RSS, OFTEN MORE USEFUL THAN MOBILEME, MORE EDUCATIONAL THAN THE COMMENTS ON REDDIT, AND USUALLY MORE FUN THAN LISTENING TO KEYNOTES. -- CHRIS WANSTRATH",
      "length": 200
    },
    {
      "text": ":NUNMAP CAN ALSO BE USED OUTSIDE OF A MONASTERY. -- VIM USER MANUAL",
      "length": 67
    },
    {
      "text": "I HAD TO LEARN HOW TO TEACH LESS, SO THAT MORE COULD BE LEARNED. -- TIM GALLWEY, THE INNER GAME OF WORK",
      "length": 103
    },
    {
      "text": "WORKERS OF THE WORLD, THE CHAINS THAT BIND YOU ARE NOT HELD IN PLACE BY A RULING CLASS, A \"SUPERIOR\" RACE, BY SOCIETY, THE STATE, OR A LEADER. THEY ARE HELD IN PLACE BY NONE OTHER THAN YOURSELF. THOSE WHO SEEK TO EXPLOIT ARE NOT THEMSELVES FREE, FOR THEY PLACE NO VALUE IN FREEDOM. WHO IS IT THAT REALLY EMPLOYS YOU AND COMMANDS YOU TO PICK UP YOUR DAILY LOAD? AND WHO IS IT THAT YOU ALLOW TO PASS JUDGMENT ON THE ADEQUACY OF YOUR TOIL? WHO HAVE YOU EMPOWERED TO DANGLE THE CARROT BEFORE YOU AND THREATEN WITH DISAPPROVAL? WHO, WHEN YOU WAKE EACH MORNING, SENDS YOU OFF TO WHAT YOU CALL YOUR WORK? IS THERE AN \"I WANT TO\" BEHIND ALL YOUR \"I HAVE TO,\" OR HAVE YOU BEEN SO LONG FORGOTTEN TO YOURSELF THAT \"I WANT\" EXISTS ONLY AS AN IDEA IN YOUR HEAD? IF YOU HAVE DISCONNECTED FROM YOUR SOUL'S DESIRE AND ARE DROWNING IN AN OCEAN OF \"HAVE TO,\" THEN RISE UP AND OVERTHROW YOUR MASTER. BEGIN THE JOURNEY TOWARD EMANCIPATION.  WORK ONLY IN SUCH A WAY THAT YOU ARE TRULY SELF-EMPLOYED. -- TIM GALLWEY, THE INNER GAME OF WORK",
      "length": 1017
    },
    {
      "text": "THE WORK BEGINS ANEW, THE HOPE RISES AGAIN, AND THE DREAM LIVES ON. -- TED KENNEDY",
      "length": 82
    },
    {
      "text": "THE HARDEST PART OF DESIGN ... IS KEEPING FEATURES OUT. -- DONALD NORMAN ",
      "length": 73
    },
    {
      "text": "BEFORE SOFTWARE CAN BE REUSABLE IT FIRST HAS TO BE USABLE. -- RALPH JOHNSON ",
      "length": 76
    },
    {
      "text": "THE OPPOSITE OF LOVE IS NOT HATE, IT IS INDIFFERENCE. -- ELIE WIESEL",
      "length": 68
    },
    {
      "text": "PERPETUAL OPTIMISM IS A FORCE MULTIPLIER. -- COLIN POWELL",
      "length": 57
    },
    {
      "text": "BE THE CHANGE YOU WANT TO SEE IN THE WORLD. -- MAHATMA GANDHI",
      "length": 61
    },
    {
      "text": "THE ART OF GETTING SOMEONE ELSE TO DO SOMETHING YOU WANT DONE BECAUSE HE WANTS TO DO IT [LEADERSHIP]. -- DWIGHT D. ENSEINHOVER.",
      "length": 127
    },
    {
      "text": "NO ONE IS ALL EVIL. EVERYBODY HAS A GOOD SIDE. IF YOU KEEP WAITING, IT WILL COMME UP. -- RANDY PAUSCH",
      "length": 101
    },
    {
      "text": "EXPERIENCE IS WHAT YOU GET WHEN YOU DON'T GET WHAT YOU WANT. -- CITED BY RANDY PAUSCH",
      "length": 85
    },
    {
      "text": "LUCK IS WHERE PREPARATION MEETS OPPORTUNITY. -- RANDY PAUSCH",
      "length": 60
    },
    {
      "text": "BONNE BOSSE ET RESTE LE BOSS. -- DARRYL AMEDON",
      "length": 46
    },
    {
      "text": "THE GREATEST OF ALL WEAKNESSES IS THE FEAR OF APPEARING WEAK. -- J. B. BOSSUET, POLITICS FROM HOLY WRIT, 1709",
      "length": 109
    },
    {
      "text": "IT'S EASIER TO ASK FORGIVENESS THAN IT IS TO GET PERMISSION. -- REAR ADMIRAL DR. GRACE HOPPER",
      "length": 93
    },
    {
      "text": "AN INVESTMENT IN KNOWLEDGE ALWAYS PAYS THE BEST INTEREST. -- BENJAMIN FRANKLIN",
      "length": 78
    },
    {
      "text": "NATIVES WHO BEAT DRUMS TO DRIVE OFF EVIL SPIRITS ARE OBJECTS OF SCORN TO SMART AMERICANS WHO BLOW HORNS TO BREAK UP TRAFFIC JAMS. -- MARY ELLEN KELLY",
      "length": 149
    },
    {
      "text": "A CS PROFESSOR ONCE EXPLAINED RECURSION AS FOLLOWS: A CHILD COULDN'T SLEEP, SO HER MOTHER TOLD HER A STORY ABOUT A LITTLE FROG,     WHO COULDN'T SLEEP, SO THE FROG'S MOTHER TOLD HER A STORY ABOUT A LITTLE BEAR,          WHO COULDN'T SLEEP, SO THE BEAR'S MOTHER TOLD HER A STORY ABOUT A LITTLE WEASEL...             WHO FELL ASLEEP.         ...AND THE LITTLE BEAR FELL ASLEEP;     ...AND THE LITTLE FROG FELL ASLEEP; ...AND THE CHILD FELL ASLEEP. -- EVERYTHING2.COM",
      "length": 464
    },
    {
      "text": "NEVER DO THE IMPOSSIBLE. PEOPLE WILL EXPECT YOU TO DO IT FOREVER AFTER. -- PIGSANDFISHES.COM",
      "length": 92
    },
    {
      "text": "HIRE PEOPLE SMARTER THAN YOU.  WORK WITH PEOPLE SMARTER THAN YOU. LISTEN TO THEM. LET THEM LEAD YOU. TAKE THE BLAME FOR ALL FAILURES, GIVE AWAY THE CREDIT FOR ALL SUCCESSES. -- HOW TO FAIL: 25 SECRETS LEARNED THROUGH FAILURE",
      "length": 224
    },
    {
      "text": "GIVE UP CONTROL. YOU NEVER REALLY HAD IT ANYWAY. -- HOW TO FAIL: 25 SECRETS LEARNED THROUGH FAILURE",
      "length": 99
    },
    {
      "text": "NE TE METS PAS DE LIMITE, LA VIE SE CHARGERA DE LA METTRE A TA PLACE. -- DARRYL AMEDON",
      "length": 86
    },
    {
      "text": "ONLY TWO THINGS ARE INFINITE, THE UNIVERSE AND HUMAN STUPIDITY. AND I'M NOT SO SURE ABOUT THE FORMER. -- ALBERT EINSTEIN",
      "length": 120
    },
    {
      "text": "THE IMPORTANT THING IS NOT TO STOP QUESTIONING. -- ALBERT EINSTEIN",
      "length": 66
    },
    {
      "text": "DO NOT ACCEPT ANYTHING BECAUSE IT COMES FROM THE MOUTH OF A RESPECTED PERSON. -- BUDDHA",
      "length": 87
    },
    {
      "text": "WORK AS INTENSELY AS YOU PLAY AND PLAY AS INTENSELY AS YOU WORK. -- ERIC S. RAYMOND, HOW TO BE A HACKER",
      "length": 103
    },
    {
      "text": "A WITTY SAYING PROVES NOTHING -- VOLTAIRE",
      "length": 41
    },
    {
      "text": "SOUND METHODOLOGY CAN EMPOWER AND LIBERATE THE CREATIVE MIND; IT CANNOT INFLAME OR INSPIRE THE DRUDGE. -- FREDERICK P. BROOKS, NO SLIVER BULLET.",
      "length": 144
    },
    {
      "text": "DO NOT SPOIL WHAT YOU HAVE BY DESIRING WHAT YOU HAVE NOT; BUT REMEMBER THAT WHAT YOU NOW HAVE WAS ONCE AMONG THE THINGS ONLY HOPED FOR. -- GREEK PHILOSOPHER EPICURUS",
      "length": 165
    },
    {
      "text": "NOBODY CAN MAKE YOU FEEL INFERIOR WITHOUT YOUR CONSENT. -- ELEANOR ROOSEVELT",
      "length": 76
    },
    {
      "text": "IF YOU TELL THE TRUTH, YOU DON'T HAVE TO REMEMBER ANYTHING. -- MARK TWAIN",
      "length": 73
    },
    {
      "text": "YOU KNOW YOU'RE IN LOVE WHEN YOU CAN'T FALL ASLEEP BECAUSE REALITY IS FINALLY BETTER THAN YOUR DREAMS. -- DR. SEUSS",
      "length": 115
    },
    {
      "text": "THE OPPOSITE OF LOVE IS NOT HATE, IT'S INDIFFERENCE. -- ELIE WIESEL",
      "length": 67
    },
    {
      "text": "LIFE IS WHAT HAPPENS TO YOU WHILE YOU'RE BUSY MAKING OTHER PLANS. -- JOHN LENNON",
      "length": 80
    },
    {
      "text": "WHENEVER YOU FIND YOURSELF ON THE SIDE OF THE MAJORITY, IT IS TIME TO PAUSE AND REFLECT. -- MARK TWAIN",
      "length": 102
    },
    {
      "text": "TO BE YOURSELF IN A WORLD THAT IS CONSTANTLY TRYING TO MAKE YOU SOMETHING ELSE IS THE GREATEST ACCOMPLISHMENT. -- RALPH WALDO EMERSON",
      "length": 133
    },
    {
      "text": "IT IS NOT A LACK OF LOVE, BUT A LACK OF FRIENDSHIP THAT MAKES UNHAPPY MARRIAGES. -- FRIEDRICH NIETZSCHE",
      "length": 103
    },
    {
      "text": "IN TERMS OF ENERGY, IT'S BETTER TO MAKE A WRONG CHOICE THAN NONE AT ALL. -- GEORGE LEONARD, MASTERY.",
      "length": 100
    },
    {
      "text": "COURAGE IS GRACE UNDER PRESSURE. -- ERNEST HEMINGWAY",
      "length": 52
    },
    {
      "text": "ACTUALLY, THE ESSENCE OF BOREDOM IS TO BE FOUND IN THE OBSESSIVE SEARCH FOR NOVELTY. SATISFACTION LIES IN MINDFUL REPETITION, THE DISCOVERY OF ENDLESS RICHNESS IN SUBTLE VARIATIONS ON FAMILIAR THEMES. -- GEORGE LEONARD, MASTERY.",
      "length": 228
    },
    {
      "text": "BEFORE ENLIGHTENMENT, CHOP WOOD AND CARRY WATER. AFTER ENLIGHTENMENT, CHOP WOOD AND CARRY WATER. -- ANCIENT EASTERN ADAGE",
      "length": 121
    },
    {
      "text": "ACKNOWLEDGING THE NEGATIVE DOESN'T MEAN SNIVELING [WHINING, COMPLAINING]; IT MEANS FACING THE TRUTH AND THEN MOVING ON. -- GEORGE LEONARD, MASTERY.",
      "length": 147
    },
    {
      "text": "WHATEVER YOU CAN DO, OR DREAM YOU CAN, BEGIN IT. BOLDNESS HAS GENIUS, POWER, AND MAGIC IN IT. -- GOETHE",
      "length": 103
    },
    {
      "text": "WHAT WE CHOOSE TO FIGHT IS SO TINY! WHAT FIGHTS US IS SO GREAT! ... WHEN WE WIN IT'S WITH SMALL THINGS, AND THE TRIUMPH ITSELF MAKES US SMALL. ... WINNING DOES NOT TEMPT THAT MAN. THIS IS HOW HE GROWS: BY BEING DEFEATED, DECISIVELY, BY CONSTANTLY GREATER BEINGS.  -- RAINER MARIA RILKE, THE MAN WATCHING.",
      "length": 304
    },
    {
      "text": "WE FAIL TO REALIZE THAT MASTERY IS NOT ABOUT PERFECTION. IT'S ABOUT A PROCESS, A JOURNEY. THE MASTER IS THE ONE WHO STAYS ON THE PATH DAY AFTER DAY, YEAR AFTER YEAR. THE MASTER IS THE ONE WHO IS WILLING TO TRY, AND FAIL, AND TRY AGAIN, FOR AS LONG AS HE OR SHE LIVES. -- GEORGE LEONARD, MASTERY.",
      "length": 295
    },
    {
      "text": "ARE YOU WILLING TO WEAR YOUR WHITE BELT? -- GEORGE LEONARD, MASTERY.",
      "length": 68
    }
  ]
}
