{
  "quotes": [
    {
      "text": "DON'T WORRY ABOUT WHAT ANYBODY ELSE IS GOING TO DO. THE BEST WAY TO\nPREDICT THE FUTURE IS TO INVENT IT.\n-- ALAN KAY",
      "length": 115
    },
    {
      "text": "PREMATURE OPTIMIZATION IS THE ROOT OF ALL EVIL (OR AT LEAST MOST OF IT)\nIN PROGRAMMING.\n-- DONALD KNUTH",
      "length": 103
    },
    {
      "text": "LISP HAS JOKINGLY BEEN CALLED \"THE MOST INTELLIGENT WAY TO MISUSE A\nCOMPUTER\". I THINK THAT DESCRIPTION IS A GREAT COMPLIMENT BECAUSE IT\nTRANSMITS THE FULL FLAVOR OF LIBERATION: IT HAS ASSISTED A NUMBER OF OUR\nMOST GIFTED FELLOW HUMANS IN THINKING PREVIOUSLY IMPOSSIBLE THOUGHTS.\n-- EDSGER DIJKSTRA, CACM, 15:10",
      "length": 311
    },
    {
      "text": "KEEP AWAY FROM PEOPLE WHO TRY TO BELITTLE YOUR AMBITIONS. SMALL PEOPLE\nALWAYS DO THAT, BUT THE REALLY GREAT MAKE YOU FEEL THAT YOU, TOO, CAN\nBECOME GREAT.\n-- MARK TWAIN",
      "length": 168
    },
    {
      "text": "WHAT PAUL DOES, AND DOES VERY WELL, IS TO TAKE IDEAS AND CONCEPTS THAT\nARE BEAUTIFUL IN THE ABSTRACT, AND BRINGS THEM DOWN TO A REAL WORLD\nLEVEL. THAT'S A RARE TALENT TO FIND IN WRITING THESE DAYS.\n-- JEFF \"HEMOS\" BATES, DIRECTOR, OSDN; CO-EVOLVER, SLASHDOT",
      "length": 257
    },
    {
      "text": "SINCE PROGRAMMERS CREATE PROGRAMS OUT OF NOTHING, IMAGINATION IS OUR\nONLY LIMITATION. THUS, IN THE WORLD OF PROGRAMMING, THE HERO IS THE ONE\nWHO HAS GREAT VISION. PAUL GRAHAM IS ONE OF OUR CONTEMPORARY HEROES. HE\nHAS THE ABILITY TO EMBRACE THE VISION, AND TO EXPRESS IT PLAINLY. HIS\nWORKS ARE MY FAVORITES, ESPECIALLY THE ONES DESCRIBING LANGUAGE DESIGN.\nHE EXPLAINS SECRETS OF PROGRAMMING, LANGUAGES, AND HUMAN NATURE THAT CAN\nONLY BE LEARNED FROM THE HACKER EXPERIENCE. THIS BOOK SHOWS YOU HIS\nGREAT VISION, AND TELLS YOU THE TRUTH ABOUT THE NATURE OF HACKING.\n-- YUKIHIRO \"MATZ\" MATSUMOTO, CREATOR OF RUBY",
      "length": 608
    },
    {
      "text": "TO FOLLOW THE PATH:\n    LOOK TO THE MASTER,\n    FOLLOW THE MASTER,\n    WALK WITH THE MASTER,\n    SEE THROUGH THE MASTER,\n    BECOME THE MASTER.\n-- MODERN ZEN POEM",
      "length": 162
    },
    {
      "text": "NO PROBLEM SHOULD EVER HAVE TO BE SOLVED TWICE.\n-- ERIC S. RAYMOND, HOW TO BECOME A HACKER",
      "length": 90
    },
    {
      "text": "ATTITUDE IS NO SUBSTITUTE FOR COMPETENCE.\n-- ERIC S. RAYMOND, HOW TO BECOME A HACKER",
      "length": 84
    },
    {
      "text": "IT IS SAID THAT THE REAL WINNER IS THE ONE WHO LIVES IN TODAY BUT ABLE\nTO SEE TOMORROW.\n-- JUAN MENG, REVIEWING \"THE FUTURE OF IDEAS\" BY LAWRENCE LESSIG",
      "length": 152
    },
    {
      "text": "FOOLS IGNORE COMPLEXITY. PRAGMATISTS SUFFER IT. SOME CAN AVOID IT.\nGENIUSES REMOVE IT.\n-- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 130
    },
    {
      "text": "A YEAR SPENT IN ARTIFICIAL INTELLIGENCE IS ENOUGH TO MAKE ONE BELIEVE IN\nGOD.\n-- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 121
    },
    {
      "text": "DEALING WITH FAILURE IS EASY: WORK HARD TO IMPROVE. SUCCESS IS ALSO EASY\nTO HANDLE: YOU'VE SOLVED THE WRONG PROBLEM. WORK HARD TO IMPROVE.\n-- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMI NG)",
      "length": 183
    },
    {
      "text": "WITHIN A COMPUTER NATURAL LANGUAGE IS UNNATURAL.\n-- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 92
    },
    {
      "text": "YOU THINK YOU KNOW WHEN YOU LEARN, ARE MORE SURE WHEN YOU CAN WRITE,\nEVEN MORE WHEN YOU CAN TEACH, BUT CERTAIN WHEN YOU CAN PROGRAM.\n-- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 176
    },
    {
      "text": "ADAPTING OLD PROGRAMS TO FIT NEW MACHINES USUALLY MEANS ADAPTING NEW\nMACHINES TO BEHAVE LIKE OLD ONES.\n-- ALAN J. PERLIS (EPIGRAMS IN PROGRAMMING)",
      "length": 146
    },
    {
      "text": "A LITTLE LEARNING IS A DANGEROUS THING.\n-- ALEXANDER POPE",
      "length": 57
    },
    {
      "text": "COMPUTER SCIENCE EDUCATION CANNOT MAKE ANYBODY AN EXPERT PROGRAMMER ANY\nMORE THAN STUDYING BRUSHES AND PIGMENT CAN MAKE SOMEBODY AN EXPERT\nPAINTER.\n-- ERIC RAYMOND",
      "length": 163
    },
    {
      "text": "EINSTEIN ARGUED THAT THERE MUST BE SIMPLIFIED EXPLANATIONS OF NATURE,\nBECAUSE GOD IS NOT CAPRICIOUS OR ARBITRARY.\n-- FREDERICK P. BROOKS, NO SLIVER BULLET.",
      "length": 155
    },
    {
      "text": "STUDENTS SHOULD BE EVALUATED ON HOW WELL THEY CAN ACHIEVE THE GOALS THEY\nSTRIVED TO ACHIEVE WITHIN A REALISTIC CONTEXT. STUDENTS NEED TO LEARN TO\nDO THINGS, NOT KNOW THINGS.\n-- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 212
    },
    {
      "text": "WE REMEMBER WHAT WE LEARN WHEN WE CARE ABOUT PERFORMING BETTER AND WHEN\nWE BELIEVE THAT WHAT WE HAVE BEEN ASKED TO DO IS REPRESENTATIVE OF\nREALITY.\n-- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 186
    },
    {
      "text": "THERE REALLY IS NO LEARNING WITHOUT DOING.\n-- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 81
    },
    {
      "text": "WE REALLY HAVE TO GET OVER THE IDEA THAT SOME STUFF IS JUST WORTH\nKNOWING EVEN IF YOU NEVER DO ANYTHING WITH IT. HUMAN MEMORIES HAPPILY\nERASE STUFF THAT HAS NO PURPOSE, SO WHY TRY TO FILL UP CHILDREN'S HEADS\nWITH SUCH STUFF?\n-- ROGER SCHANK, ENGINES FOR EDUCATION",
      "length": 263
    },
    {
      "text": "LA TACTIQUE, C'EST CE QUE VOUS FAITES QUAND IL Y A QUELQUE CHOSE À\nFAIRE; LA STRATÉGIE, C'EST CE QUE VOUS FAITES QUAND IL N'Y A RIEN À\nFAIRE.\n-- XAVIER TARTACOVER",
      "length": 162
    },
    {
      "text": "THE ONLY PROBLEMS WE CAN REALLY SOLVE IN A SATISFACTORY MANNER ARE THOSE\nTHAT FINALLY ADMIT A NICELY FACTORED SOLUTION.\n-- E. W. DIJKSTRA, THE HUMBLE PROGRAMMER",
      "length": 160
    },
    {
      "text": "THE BEST WAY TO LEARN TO LIVE WITH OUR LIMITATIONS IS TO KNOW THEM.\n--E. W. DIJKSTRA, THE HUMBLE PROGRAMMER",
      "length": 107
    },
    {
      "text": "THIS CHALLENGE, VIZ. THE CONFRONTATION WITH THE PROGRAMMING TASK, IS SO\nUNIQUE THAT THIS NOVEL EXPERIENCE CAN TEACH US A LOT ABOUT OURSELVES. IT\nSHOULD DEEPEN OUR UNDERSTANDING OF THE PROCESSES OF DESIGN AND CREATION,\nIT SHOULD GIVE US BETTER CONTROL OVER THE TASK OF ORGANIZING OUR\nTHOUGHTS. IF IT DID NOT DO SO, TO MY TASTE WE SHOULD NO DESERVE THE\nCOMPUTER AT ALL!  IT HAS ALLREADY TAUGHT US A FEW LESSONS, AND THE ONE I\nHAVE CHOSEN TO STRESS IN THIS TALK IS THE FOLLOWING. WE SHALL DO A MUCH\nBETTER PROGRAMMING JOB, PROVIDED THAT WE APPROACH THE TASK WITH A FULL\nAPPRECIATION OF ITS TREMENDUOUS DIFFICULTY, PROVIDED THAT WE STICK TO\nMODEST AND ELEGANT PROGRAMMING LANGUAGES, PROVIDED THAT WE RESPECT THE\nINTRINSEC LIMITATIONS OF THE HUMAN MIND AND APPROACH THE TASK AS VERY\nHUMBLE PROGRAMMERS.\n-- E. W. DIJKSTRA, THE HUMBLE PROGRAMMER",
      "length": 838
    },
    {
      "text": "CE N'EST QUE PAR LES RELATIONS QU'ON ENTRETIENT ENTRE NOS DIFFÉRENTES\nCONNAISSANCES QU'ELLES NOUS RESTENT ACCESSIBLES.\n-- SHNUUP, SUR L'HYPERTEXTE (SELFHTML -> INTRODUCTION -> DEFINITIONS SUR L'HYPERTEXTE)",
      "length": 205
    },
    {
      "text": "WE NOW COME TO THE DECISIVE STEP OF MATHEMATICAL ABSTRACTION: WE FORGET\nABOUT WHAT THE SYMBOLS STAND FOR. ...[THE MATHEMATICIAN] NEED NOT BE\nIDLE; THERE ARE MANY OPERATIONS WHICH HE MAY CARRY OUT WITH THESE\nSYMBOLS, WITHOUT EVER HAVING TO LOOK AT THE THINGS THEY STAND FOR.\n-- HERMANN WEYL, THE MATHEMATICAL WAY OF THINKING",
      "length": 323
    },
    {
      "text": "AN EXPERT IS, ACCORDING TO MY WORKING DEFINITION \"SOMEONE WHO DOESN'T\nNEED TO LOOK UP ANSWERS TO EASY QUESTIONS\".\n-- ERIC LIPPERT.",
      "length": 130
    },
    {
      "text": "THE PROGRAMMER MUST SEEK BOTH PERFECTION OF PART AND ADEQUACY OF\nCOLLECTION.\n-- ALAN J. PERLIS",
      "length": 94
    },
    {
      "text": "THUS, PROGRAMS MUST BE WRITTEN FOR PEOPLE TO READ, AND ONLY INCIDENTALLY\nFOR MACHINES TO EXECUTE.\n-- ALAN J. PERLIS",
      "length": 115
    },
    {
      "text": "WE CONTROL COMPLEXITY BY BUILDING ABSTRACTIONS THAT HIDE DETAILS WHEN\nAPPROPRIATE. WE CONTROL COMPLEXITY BY ESTABLISHING CONVENTIONAL\nINTERFACES THAT ENABLE US TO CONSTRUCT SYSTEMS BY COMBINING STANDARD,\nWELL-UNDERSTOOD PIECES IN A ``MIX AND MATCH'' WAY. WE CONTROL COMPLEXITY\nBY ESTABLISHING NEW LANGUAGES FOR DESCRIBING A DESIGN, EACH OF WHICH\nEMPHASIZES PARTICULAR ASPECTS OF THE DESIGN AND DEEMPHASIZES OTHERS.\n-- ALAN J. PERLIS",
      "length": 432
    },
    {
      "text": "THE ACTS OF THE MIND, WHEREIN IT EXERTS ITS POWER OVER SIMPLE IDEAS, ARE\nCHIEFLY THESE THREE: 1. COMBINING SEVERAL SIMPLE IDEAS INTO ONE COMPOUND\nONE, AND THUS ALL COMPLEX IDEAS ARE MADE. 2. THE SECOND IS BRINGING TWO\nIDEAS, WHETHER SIMPLE OR COMPLEX, TOGETHER, AND SETTING THEM BY ONE\nANOTHER SO AS TO TAKE A VIEW OF THEM AT ONCE, WITHOUT UNITING THEM INTO\nONE, BY WHICH IT GETS ALL ITS IDEAS OF RELATIONS. 3. THE THIRD IS\nSEPARATING THEM FROM ALL OTHER IDEAS THAT ACCOMPANY THEM IN THEIR REAL\nEXISTENCE: THIS IS CALLED ABSTRACTION, AND THUS ALL ITS GENERAL IDEAS\nARE MADE.\n-- JOHN LOCKE, AN ESSAY CONCERNING HUMAN UNDERSTANDING (1690)",
      "length": 636
    },
    {
      "text": "LISP PROGRAMMERS KNOW THE VALUE OF EVERYTHING BUT THE COST OF NOTHING.\n-- ALAN J. PERLIS",
      "length": 88
    },
    {
      "text": "AN INTERPRETER RAISES THE MACHINE TO THE LEVEL OF THE USER PROGRAM; A\nCOMPILER LOWERS THE USER PROGRAM TO THE LEVEL OF THE MACHINE LANGUAGE.\n-- SICP",
      "length": 148
    },
    {
      "text": "EVERYTHING SHOULD BE MADE AS SIMPLE AS POSSIBLE, BUT NO SIMPLER.\n-- ALBERT EINSTEIN",
      "length": 83
    },
    {
      "text": "THE GREAT DIVIDING LINE BETWEEN SUCCESS AND FAILURE CAN BE EXPRESSED IN\nFIVE WORDS: \"I DID NOT HAVE TIME.\"\n-- WESTHOST WEEKLY NEWSLETTER 14 FEB 2003",
      "length": 148
    },
    {
      "text": "WHEN YOUR ENEMY IS MAKING A VERY SERIOUS MISTAKE, DON'T BE IMPOLITE AND\nDISTURB HIM.\n-- NAPOLEON BONAPARTE (ALLEGEDLY)",
      "length": 118
    },
    {
      "text": "A CHARLATAN MAKES OBSCURE WHAT IS CLEAR; A THINKER MAKES CLEAR WHAT IS\nOBSCURE.\n-- HUGH KINGSMILL",
      "length": 97
    },
    {
      "text": "THERE ARE TWO WAYS OF CONSTRUCTING A SOFTWARE DESIGN; ONE WAY IS TO MAKE\nIT SO SIMPLE THAT THERE ARE OBVIOUSLY NO DEFICIENCIES, AND THE OTHER WAY\nIS TO MAKE IT SO COMPLICATED THAT THERE ARE NO OBVIOUS DEFICIENCIES. THE\nFIRST METHOD IS FAR MORE DIFFICULT.\n-- C. A. R. HOARE",
      "length": 272
    },
    {
      "text": "AND IF YOU GO TOO FAR UP, ABSTRACTION-WISE, YOU RUN OUT OF OXYGEN.\nSOMETIMES SMART THINKERS JUST DON'T KNOW WHEN TO STOP, AND THEY CREATE\nTHESE ABSURD, ALL-ENCOMPASSING, HIGH-LEVEL PICTURES OF THE UNIVERSE THAT\nARE ALL GOOD AND FINE, BUT DON'T ACTUALLY MEAN ANYTHING AT ALL.\n-- JOEL SPOLSKY\t\t",
      "length": 292
    },
    {
      "text": "THE THREE CHIEF VIRTUES OF A PROGRAMMER ARE: LAZINESS, IMPATIENCE AND\nHUBRIS.\n-- LARRY WALL (PROGRAMMING PERL)",
      "length": 110
    },
    {
      "text": "ALL NON-TRIVIAL ABSTRACTIONS, TO SOME DEGREE, ARE LEAKY.\n-- JOEL SPOLSKY (THE LAW OF LEAKY ABSTRACTIONS)",
      "length": 104
    },
    {
      "text": "XML WASN'T DESIGNED TO BE EDITED BY HUMANS ON A REGULAR BASIS.\n-- GUIDO VAN ROSSUM",
      "length": 82
    },
    {
      "text": "PREMATURE ABSTRACTION IS AN EQUALLY GREVIOUS SIN AS PREMATURE\nOPTIMIZATION.\n-- KEITH DEVENS",
      "length": 91
    },
    {
      "text": "YOU CAN HAVE PREMATURE GENERALIZATION AS WELL AS PREMATURE OPTIMIZATION.\n-- BJARNE STROUSTRUP",
      "length": 93
    },
    {
      "text": "HE CAUSES HIS SUN TO RISE ON THE EVIL AND THE GOOD, AND SENDS RAIN ON\nTHE RIGHTEOUS AND THE UNRIGHTEOUS.\n-- MATTHEW 5:45",
      "length": 120
    },
    {
      "text": "A LANGUAGE THAT DOESN'T AFFECT THE WAY YOU THINK ABOUT PROGRAMMING, IS\nNOT WORTH KNOWING.\n-- ALAN PERLIS",
      "length": 104
    },
    {
      "text": "JE N'AI FAIT CELLE-CI PLUS LONGUE QUE PARCE QUE JE N'AI PAS EU LE LOISIR\nDE LA FAIRE PLUS COURTE. (I HAVE MADE THIS LETTER SO LONG ONLY BECAUSE I\nDID NOT HAVE THE LEISURE TO MAKE IT SHORTER.)\n-- BLAISE PASCAL (LETTRES PROVINCIALES)",
      "length": 231
    },
    {
      "text": "MEN NEVER DO EVIL SO COMPLETELY AND CHEERFULLY AS WHEN THEY DO IT FROM\nRELIGIOUS CONVICTION.\n-- BLAISE PASCAL (ATTRIBUTED)",
      "length": 122
    },
    {
      "text": "EVERYBODY MAKES THEIR OWN FUN. IF YOU DON'T MAKE IT YOURSELF, IT AIN'T\nFUN -- IT'S ENTERTAINMENT.\n-- DAVID MAMET (AS RELAYED BY JOSS WHEDON)",
      "length": 140
    },
    {
      "text": "IF WE WISH TO COUNT LINES OF CODE, WE SHOULD NOT REGARD THEM AS *LINES\nPRODUCED* BUT AS *LINES SPENT*.\n-- EDSGER DIJKSTRA\t\t",
      "length": 123
    },
    {
      "text": "SOMETIMES A MAN WITH TOO BROAD A PERSPECTIVE REVEALS HIMSELF AS HAVING\nNO REAL PERSPECTIVE AT ALL. A MAN WHO TRIES TOO HARD TO SEE EVERY SIDE\nMAY BE A MAN WHO IS TRYING TO AVOID CHOOSING ANY SIDE. A MAN WHO TRIES\nTOO HARD TO SEEK A DEEPER TRUTH MAY BE TRYING TO HIDE FROM THE TRUTH HE\nALREADY KNOWS.  THAT IS NOT A SIGN OF INTELLECTUAL SOPHISTICATION AND\n\"GREAT THINKING\". IT IS A DEMONSTRATION OF MORAL DEGENERACY AND\nCOWARDICE.\n-- STEVEN DEN BESTE",
      "length": 449
    },
    {
      "text": "OMIT NEEDLESS WORDS.\n-- WILLIAM STRUNK, JR. (THE ELEMENTS OF STYLE)",
      "length": 67
    },
    {
      "text": "I HAVE NEVER MET A MAN SO IGNORANT THAT I COULDN'T LEARN SOMETHING FROM\nHIM.\n-- GALILEO GALILEI",
      "length": 95
    },
    {
      "text": "A SOCIETY THAT PUTS EQUALITY -- IN THE SENSE OF EQUALITY OF OUTCOME --\nAHEAD OF FREEDOM WILL END UP WITH NEITHER EQUALITY NOR FREEDOM. THE USE\nOF FORCE TO ACHIEVE EQUALITY WILL DESTROY FREEDOM, AND THE FORCE,\nINTRODUCED FOR GOOD PURPOSES, WILL END UP IN THE HANDS OF PEOPLE WHO USE\nIT TO PROMOTE THEIR OWN INTERESTS.\n-- MILTON FRIEDMAN (THOMAS SOWELL: A CONFLICT OF VISIONS, P130)",
      "length": 380
    },
    {
      "text": "PHILOSOPHY: THE FINDING OF BAD REASONS FOR WHAT ONE BELIEVES BY\nINSTINCT.\n-- BRAVE NEW WORLD (PARAPHRASED)",
      "length": 106
    },
    {
      "text": "OF ALL TYRANNIES A TYRANNY SINCERELY EXERCISED FOR THE GOOD OF ITS\nVICTIMS MAY BE THE MOST OPPRESSIVE. IT MAY BE BETTER TO LIVE UNDER\nROBBER BARONS THAN UNDER OMNIPOTENT MORAL BUSYBODIES, THE ROBBER BARON'S\nCRUELTY MAY SOMETIMES SLEEP, HIS CUPIDITY MAY AT SOME POINT BE SATIATED;\nBUT THOSE WHO TORMENT US FOR OWN GOOD WILL TORMENT US WITHOUT END, FOR\nTHEY DO SO WITH THE APPROVAL OF THEIR OWN CONSCIENCE.\n-- C.S. LEWIS",
      "length": 418
    },
    {
      "text": "FOOLS! DON'T THEY KNOW THAT TEARS ARE A WOMAN'S MOST EFFECTIVE WEAPON?\n-- CATWOMAN (THE BATMAN TV SERIES, EPISODE 83)",
      "length": 117
    },
    {
      "text": "IT'S LIKE A CONDOM; I'D RATHER HAVE IT AND NOT NEED IT THAN NEED IT AND\nNOT HAVE IT.\n-- SOME CHICK IN ALIEN VS. PREDATOR, WHEN ASKED WHY SHE\nALWAYS CARRIES A GUN",
      "length": 161
    },
    {
      "text": "C++ IS HISTORY REPEATED AS TRAGEDY. JAVA IS HISTORY REPEATED AS FARCE.\n-- SCOTT MCKAY",
      "length": 85
    },
    {
      "text": "SIMPLICITY TAKES EFFORT-- GENIUS, EVEN.\n-- PAUL GRAHAM",
      "length": 54
    },
    {
      "text": "SHOW, DON'T TELL.\n-- UNKNOWN",
      "length": 28
    },
    {
      "text": "IN GOD I TRUST; I WILL NOT BE AFRAID. WHAT CAN MORTAL MAN DO TO ME?\n-- DAVID (PSALM 56:4)",
      "length": 89
    },
    {
      "text": "LINUX IS ONLY FREE IF YOUR TIME HAS NO VALUE.\n-- JAMIE ZAWINSKI",
      "length": 63
    },
    {
      "text": "CODE IS POETRY.\n-- WORDPRESS.ORG",
      "length": 32
    },
    {
      "text": "IF YOU CHOOSE NOT TO DECIDE, YOU STILL HAVE MADE A CHOICE.\n-- RUSH (FREEWILL)",
      "length": 77
    },
    {
      "text": "CIVILIZATION ADVANCES BY EXTENDING THE NUMBER OF IMPORTANT OPERATIONS\nWHICH WE CAN PERFORM WITHOUT THINKING ABOUT THEM.\n-- ALFRED NORTH WHITEHEAD (INTRODUCTION TO MATHEMATICS)\t\t",
      "length": 177
    },
    {
      "text": "THE FUNCTION OF WISDOM IS TO DISCRIMINATE BETWEEN GOOD AND EVIL.\n-- CICERO",
      "length": 74
    },
    {
      "text": "THE REASON TO DO ANIMATION IS CARICATURE. GOOD CARICATURE PICKS OUT THE\nESSENSE OF THE STATEMENT AND REMOVES EVERYTHING ELSE. IT'S NOT SIMPLY\nABOUT REPRODUCING REALITY; IT'S ABOUT BUMPING IT UP.\n-- BRAD BIRD, WRITER AND DIRECTOR, THE INCREDIBLES",
      "length": 245
    },
    {
      "text": "MISTAKES WERE MADE.\n-- RONALD REAGAN",
      "length": 36
    },
    {
      "text": "I WOULD RATHER BE AN OPTIMIST AND BE WRONG THAN A PESSIMIST WHO PROVES\nTO BE RIGHT. THE FORMER SOMETIMES WINS, BUT NEVER THE LATTER.\n-- \"HOOTS\"",
      "length": 143
    },
    {
      "text": "WHAT IS TRUTH?\n-- PONTIUS PILATE",
      "length": 32
    },
    {
      "text": "LIFE MOVES PRETTY FAST. IF YOU DON'T STOP AND LOOK AROUND ONCE IN A\nWHILE, YOU COULD MISS IT.\n-- FERRIS BUELLER",
      "length": 111
    },
    {
      "text": "LISP IS WORTH LEARNING FOR THE PROFOUND ENLIGHTENMENT EXPERIENCE YOU\nWILL HAVE WHEN YOU FINALLY GET IT; THAT EXPERIENCE WILL MAKE YOU A\nBETTER PROGRAMMER FOR THE REST OF YOUR DAYS, EVEN IF YOU NEVER ACTUALLY\nUSE LISP ITSELF A LOT.\n-- ERIC S. RAYMOND",
      "length": 249
    },
    {
      "text": "ANY SUFFICIENTLY COMPLICATED C OR FORTRAN PROGRAM CONTAINS AN AD HOC,\nINFORMALLY SPECIFIED, BUG-RIDDEN, SLOW IMPLEMENTATION OF HALF OF COMMON\nLISP.\n-- PHILIP GREENSPUN (GREENSPUN'S TENTH RULE)",
      "length": 192
    },
    {
      "text": "I WAS TALKING RECENTLY TO A FRIEND WHO TEACHES AT MIT. HIS FIELD IS HOT\nNOW AND EVERY YEAR HE IS INUNDATED BY APPLICATIONS FROM WOULD-BE\nGRADUATE STUDENTS. \"A LOT OF THEM SEEM SMART,\" HE SAID. \"WHAT I CAN'T\nTELL IS WHETHER THEY HAVE ANY KIND OF TASTE.\"\n-- PAUL GRAHAM",
      "length": 267
    },
    {
      "text": "THE DIRECT PURSUIT OF HAPPINESS IS A RECIPE FOR AN UNHAPPY LIFE.\n-- DONALD CAMPBELL",
      "length": 83
    },
    {
      "text": "IT'S NO TRICK FOR TALENTED PEOPLE TO BE INTERESTING, BUT IT'S A GIFT TO\nBE INTERESTED. WE WANT AN ORGANIZATION FILLED WITH INTERESTED PEOPLE.\n-- RANDY S. NELSON (DEAN OF PIXAR UNIVERSITY)",
      "length": 187
    },
    {
      "text": "WHY TEACH DRAWING TO ACCOUNTANTS? BECAUSE DRAWING CLASS DOESN'T JUST\nTEACH PEOPLE TO DRAW. IT TEACHES THEM TO BE MORE OBSERVANT. THERE'S NO\nCOMPANY ON EARTH THAT WOULDN'T BENEFIT FROM HAVING PEOPLE BECOME MORE\nOBSERVANT.\n-- RANDY S. NELSON (DEAN OF PIXAR UNIVERSITY)",
      "length": 266
    },
    {
      "text": "ALL PROBLEMS IN COMPUTER SCIENCE CAN BE SOLVED BY ANOTHER LEVEL OF\nINDIRECTION.\n-- BUTLER LAMPSON\t",
      "length": 98
    },
    {
      "text": "A DESIGNER KNOWS HE HAS ARRIVED AT PERFECTION NOT WHEN THERE IS NO\nLONGUER ANYTHING TO ADD, BUT WHEN THERE IS NO LONGUER ANYTHING TO TAKE\nAWAY.\n-- ANTOINE DE ST EXUPERY.",
      "length": 169
    },
    {
      "text": "FOR THE THINGS WE HAVE TO LEARN BEFORE WE CAN DO THEM, WE LEARN BY DOING\nTHEM.\n-- ARISTOTLE.",
      "length": 92
    },
    {
      "text": "THERE ARE MANY WAYS TO AVOID SUCCESS IN LIFE, BUT THE MOST SURE-FIRE\nJUST MIGHT BE PROCRASTINATION.\n-- HARA ESTROFF MARANO.",
      "length": 123
    },
    {
      "text": "PI SECONDS IS A NANOCENTURY.\n-- [FACT]",
      "length": 38
    },
    {
      "text": "A NON NEGATIVE BINARY INTEGER VALUE X IS A POWER OF 2 IFF (X & (X-1)) IS\n0 USING 2'S COMPLEMENT ARITHMETIC.\n-- [FACT]",
      "length": 117
    },
    {
      "text": "WHILE I’VE ALWAYS APPRECIATED BEAUTIFUL CODE, I SHARE JONATHAN’S CONCERN\nABOUT STUDYING IT TOO MUCH. I THINK STUDYING BEAUTY IN MUSIC AND\nPAINTING HAS LED US TO MODERN CLASSICAL MUSIC AND PAINTING THAT THE\nMAJORITY OF US JUST DON’T GET. BEAUTY CAN BE SEEN WHEN IT EMERGES, BUT\nISN’T SOMETHING TO STRIVE FOR IN ISOLATION OF A LARGER CONTEXT. IN THE\nSOFTWARE WORLD, THE LARGER CONTEXT WOULD BE THE UTILITY OF THE SOFTWARE\nTO THE END USER.\n-- [A COMMENT ON A BLOG]",
      "length": 461
    },
    {
      "text": "DONT GIVE USERS THE OPPORTUNITY TO LOCK THEMSELVES.\n-- UNKNOWN",
      "length": 62
    },
    {
      "text": "ANY FOOL CAN MAKE THE SIMPLE COMPLEX, ONLY A SMART PERSON CAN MAKE THE\nCOMPLEX SIMPLE.\n-- UNKNOWN",
      "length": 97
    },
    {
      "text": "TO DO SOMETHING WELL YOU HAVE TO LOVE IT. SO TO THE EXTENT YOU CAN\nPRESERVE HACKING AS SOMETHING YOU LOVE, YOU'RE LIKELY TO DO IT WELL. TRY\nTO KEEP THE SENSE OF WONDER YOU HAD ABOUT PROGRAMMING AT AGE 14. IF\nYOU'RE WORRIED THAT YOUR CURRENT JOB IS ROTTING YOUR BRAIN, IT PROBABLY\nIS.\n-- PAUL GRAHAM.",
      "length": 299
    },
    {
      "text": "- IF YOU GIVE HIM A PENNY FOR HIS THOUGHTS, YOU'D GET CHANGE.\n- NOT THE SHARPEST KNIFE IN THE DRAWER.\n- A PRIME CANDIDATE FOR NATURAL DESELECTION.\n-- [IDEAS FOR FLAMEWARS]",
      "length": 171
    },
    {
      "text": "WHAT I DIDN'T UNDERSTAND WAS THAT THE VALUE OF SOME NEW ACQUISITION\nWASN'T THE DIFFERENCE BETWEEN ITS RETAIL PRICE AND WHAT I PAID FOR IT.\nIT WAS THE VALUE I DERIVED FROM IT. STUFF IS AN EXTREMELY ILLIQUID\nASSET. UNLESS YOU HAVE SOME PLAN FOR SELLING THAT VALUABLE THING YOU GOT\nSO CHEAPLY, WHAT DIFFERENCE DOES IT MAKE WHAT IT'S \"WORTH?\" THE ONLY WAY\nYOU'RE EVER GOING TO EXTRACT ANY VALUE FROM IT IS TO USE IT. AND IF YOU\nDON'T HAVE ANY IMMEDIATE USE FOR IT, YOU PROBABLY NEVER WILL.\n-- PAUL GRAHAM",
      "length": 500
    },
    {
      "text": "ONLY BAD DESIGNERS BLAME THEIR FAILINGS ON THE USERS.\n-- UNKNOWN",
      "length": 64
    },
    {
      "text": "HUMANS AREN'T RATIONAL -- THEY RATIONALIZE. AND I DON'T JUST MEAN \"SOME\nOF THEM\" OR \"OTHER PEOPLE\". I'M TALKING ABOUT EVERYONE. WE HAVE A \"LOGIC\nENGINE\" IN OUR BRAINS, BUT FOR THE MOST PART, IT'S NOT THE ONE IN THE\nDRIVER'S SEAT -- INSTEAD IT OPERATES AFTER THE FACT, GENERATING\nRATIONALIZATIONS AND EXCUSES FOR OUR BEHAVIOR.\n-- PAUL BUCHHEIT",
      "length": 342
    },
    {
      "text": "WHAT DO AMERICANS LOOK FOR IN A CAR? I'VE HEARD MANY ANSWERS WHEN I'VE\nASKED THIS QUESTION. THE ANSWERS INCLUDE EXCELLENT SAFETY RATINGS, GREAT\nGAS MILEAGE, HANDLING, AND CORNERING ABILITY, AMONG OTHERS. I DON'T\nBELIEVE ANY OF THESE. THAT'S BECAUSE THE FIRST PRINCIPLE OF THE CULTURE\nCODE IS THAT THE ONLY EFFECTIVE WAY TO UNDERSTAND WHAT PEOPLE TRULY MEAN\nIS TO IGNORE WHAT THEY SAY. THIS IS NOT TO SUGGEST THAT PEOPLE\nINTENTIONALLY LIE OR MISREPRESENT THEMSELVES. WHAT IT MEANS IS THAT,\nWHEN ASKED DIRECT QUESTIONS ABOUT THEIR INTERESTS AND PREFERENCES,\nPEOPLE TEND TO GIVE ANSWERS THEY BELIEVE THE QUESTIONER WANTS TO HEAR.\nAGAIN, THIS IS NOT BECAUSE THEY INTEND TO MISLEAD. IT IS BECAUSE PEOPLE\nRESPOND TO THESE QUESTIONS WITH THEIR CORTEXES, THE PARTS OF THEIR\nBRAINS THAT CONTROL INTELLIGENCE RATHER THAN EMOTION OR INSTINCT. THEY\nPONDER A QUESTION, THEY PROCESS A QUESTION, AND WHEN THEY DELIVER AN\nANSWER, IT IS THE PRODUCT OF DELIBERATION. THEY BELIEVE THEY ARE TELLING\nTHE TRUTH. A LIE DETECTOR WOULD CONFIRM THIS. IN MOST CASES, HOWEVER,\nTHEY AREN'T SAYING WHAT THEY MEAN.\n-- THE CULTURE CODE.",
      "length": 1104
    },
    {
      "text": "WHEN ALL YOU HAVE IS A HAMMER, EVERYTHING LOOKS LIKE A NAIL.\n-- UNKNOWN",
      "length": 71
    },
    {
      "text": "GOOD CODERS CODE, GREAT REUSE.\n-- HTTP://WWW.CATONMAT.NET",
      "length": 57
    },
    {
      "text": "THE LESSON OF THE STORY MIGHT APPEAR TO BE THAT SELF-INTERESTED AND\nAMBITIOUS PEOPLE IN POWER ARE OFTEN THE CAUSE OF WASTEFULNESS IN\nDEVELOPING COUNTRIES. BUT SELF-INTERESTED AND AMBITIOUS PEOPLE ARE IN\nPOSITIONS OF POWER, GREAT AND SMALL, ALL OVER THE WORLD. IN MANY PLACES,\nTHEY ARE RESTRAINED BY THE LAW, THE PRESS, AND DEMOCRATIC OPPOSITION.\nCAMEROON'S TRAGEDY IS THAT THERE IS NOTHING TO HOLD SELF-INTEREST IN\nCHECK.\n-- TIM HARFORD",
      "length": 436
    },
    {
      "text": "TO SOLVE YOUR PROBLEMS YOU MUST LEARN NEW SKILLS, ADAPT NEW THOUGHT\nPATTERNS, AND BECOME A DIFFERENT PERSON THAN YOU WERE BEFORE THAT\nPROBLEM.  GOD HAS CRAFTED YOU FOR SUCCESS. IN THE MIDDLE OF EVERY\nADVERSITY LIE YOUR BEST OPPORTUNITIES. DISCOVER IT, BUILD UPON IT AND\nMOVE FORWARD IN YOUR JOURNEY TO LIVE AN EXTRAORDINARY LIFE.  YOU OWE IT\nTO YOURSELF TO LIVE A GREAT LIFE. DON’T LET NEGATIVE THOUGHTS PULL YOU\nDOWN. BE GRATEFUL AND OPEN TO LEARN AND GROW.\n-- HTTP://SECRETSOFSTUDYING.COM/",
      "length": 491
    },
    {
      "text": "IF THERE IS A WILL, THERE IS A WAY.\n-- UNKNOWN",
      "length": 46
    },
    {
      "text": "HAVING LARGE CASE STATEMENTS IN AN OBJECT-ORIENTED LANGUAGE IS A SURE\nSIGN YOUR DESIGN IS FLAWED.\n-- [FIXING ARCHITECTURE FLAWS IN RAILS' ORM]",
      "length": 142
    },
    {
      "text": "BEING A PROGRAMMER IS THE SAME WAY. THE ONLY WAY TO BE A GOOD PROGRAMMER\nIS TO WRITE CODE. WHEN YOU REALIZE YOU HAVEN'T BEEN WRITING MUCH CODE\nLATELY, AND IT SEEMS LIKE ALL YOU DO IS BRAG ABOUT CODE YOU WROTE IN THE\nPAST, AND PEOPLE START LOOKING AT YOU FUNNY WHILE YOU'RE SHOOTING YOUR\nMOUTH OFF, REALIZE IT'S BECAUSE THEY KNOW. THEY MIGHT NOT EVEN KNOW THEY\nKNOW, BUT THEY KNOW. SO, YES, DOING WHAT YOU LOVE BRINGS SUCCESS, AND BY\nALL MEANS, THROW YOURSELF A NICE BIG PARTY, BUY YOURSELF A NICE CAR,\nSOAK UP THE ADULATION OF AN ADORING CROWD. THEN SHUT THE FUCK UP AND GET\nBACK TO WORK.\n-- SINCERITY THEORY",
      "length": 608
    },
    {
      "text": "ANOTHER FEATURE ABOUT THIS GUY IS HIS LOW THRESHOLD OF BOREDOM. HE'LL\nPICK UP ON A TASK AND WORK FRANTICALLY AT IT, ACCOMPLISHING WONDERS IN A\nSHORT TIME AND THEN GET BORED AND DROP IT BEFORE ITS PROPERLY FINISHED.\nHE'LL DO NOTHING BUT STRUM HIS GUITAR AND LIE AROUND IN BED FOR SEVERAL\nDAYS AFTER.  THATS ALSO PART OF THE PATTERN TOO; PERIODS OF FRENETIC\nACTIVITY FOLLOWED BY PERIODS OF MELANCHOLIA, WITHDRAWAL AND INACTIVITY.\nTHIS IS A BIPOLAR PERSONALITY.\n-- THE BIPOLAR LISP PROGRAMMER",
      "length": 489
    },
    {
      "text": "MY DREAM IS THAT PEOPLE ADOPT IT ON ITS OWN MERITS. WE'RE NOT TRYING TO\nBEND RUBY ON RAILS TO FIT THE ENTERPRISE, WE'RE ENCOURAGING ENTERPRISES\nTO BEND TO RUBY ON RAILS. COME IF YOU LIKE IT, STAY AWAY IF YOU DON'T.\nWE'RE NOT GOING HEAD OVER HEELS TO ACCOMMODATE THE ENTERPRISE OR TO LURE\nTHEM AWAY FROM JAVA. THAT'S HOW YOU END UP WITH JAVA, IF YOU START\nBENDING TO SPECIAL INTEREST GROUPS.\n-- DAVID HEINEMEIER HANSSON (RUBY ON RAILS' CREATOR)",
      "length": 443
    },
    {
      "text": "NEW EYES HAVE X-RAY VISION.  [SOMEONE THAT HASN'T WRITTEN IT IS MORE\nLIKELY TO SPOT THE BUG. \"SOMEONE\" CAN BE YOU AFTER A BREAK]\n-- WILLIAM S. ANNIS",
      "length": 148
    },
    {
      "text": "SO - WHAT ARE THE MOST IMPORTANT PROBLEMS IN SOFTWARE ENGINEERING? I’D\nANSWER “DEALING WITH COMPLEXITY”.\n-- MARK CHU-CARROLL",
      "length": 124
    },
    {
      "text": "SO THE MERE CONSTRAINT OF STAYING IN REGULAR CONTACT WITH US WILL PUSH\nYOU TO MAKE THINGS HAPPEN, BECAUSE OTHERWISE YOU'LL BE EMBARRASSED TO\nTELL US THAT YOU HAVEN'T DONE ANYTHING NEW SINCE THE LAST TIME WE\nTALKED.\n-- PAUL GRAHAM (A TALK AT Y COMBINATOR, FOR STARTUP CREATORS).",
      "length": 277
    },
    {
      "text": "THE CHOICE OF THE UNIVERSITY IS MOSTLY IMPORTANT FOR THE PIECE OF PAPER\nYOU GET AT THE END. THE EDUCATION YOU GET DEPENDS ON YOU.\n-- ANDREAS ZWINKAU",
      "length": 148
    },
    {
      "text": "REMEMBER THAT YOU ARE HUMANS IN THE FIRST PLACE AND ONLY AFTER THAT\nPROGRAMMERS.\n-- ALEXANDRU VANCEA",
      "length": 100
    },
    {
      "text": "HUMANS DIFFER FROM ANIMALS TO THE DEGREE THAT THEY ARE NOT MERELY AN END\nRESULT OF THEIR CONDITIONING, BUT ARE ABLE TO REFLECT ON THEIR\nEXPERIENCES AND STRATEGIES, AND APPLY INSIGHT TO MAKE CHANGES IN THE WAY\nTHEY LIVE TO MODIFY THE OUTCOME.\n-- SLIDETROMBONE (COMMENT ON \"PROGRAMMING CAN RUIN YOUR LIFE\")",
      "length": 304
    },
    {
      "text": "AS BUILDERS AND CREATORS FINDING THE PERFECT SOLUTION SHOULD NOT BE OUR\nMAIN GOAL. WE SHOULD FIND THE PERFECT PROBLEM.\n-- ISAAC (BLOG COMMENT)",
      "length": 142
    },
    {
      "text": "JUST LIKE CARPENTRY, MEASURE TWICE CUT ONCE.\n-- SUPER-SIZING YOUTUBE WITH PYTHON (MIKE SOLOMON, MIKE@YOUTUBE.COM)",
      "length": 113
    },
    {
      "text": "THE GOOD THING ABOUT REINVENTING THE WHEEL IS THAT YOU GET A ROUND ONE.\n-- DOUGLAS CROCKFORD (AUTHOR OF JSON AND JSLINT)",
      "length": 120
    },
    {
      "text": "I FEEL IT IS EVERYBODIES OBLIGATION TO REACH FOR THE BEST IN THEMSELVES\nAND USE THAT FOR THE INTEREST OF MANKIND.\n-- CORNELUIS (COMMENT ON 'ARE YOU GOING TO CHANGE THE WORLD? (REALLY?)')",
      "length": 186
    },
    {
      "text": "ABSTRACTION IS A FORM OF DATA COMPRESSION: ABSOLUTELY NECESSARY, BECAUSE\nHUMAN SHORT-TERM MEMORY IS SO SMALL, BUT THE CRITICALLY IMPORTANT ASPECT\nOF ABSTRACTION IS THE ALGORITHM THAT GETS YOU FROM THE NAME BACK TO THE\n\"UNCOMPRESSED\" DETAILS.\n-- BRUCE WILDER (BLOG POST COMMENT)",
      "length": 277
    },
    {
      "text": "HAVE YOU EVER NOTICED THAT WHEN YOU SIT DOWN TO WRITE SOMETHING, HALF\nTHE IDEAS THAT END UP IN IT ARE ONES YOU THOUGHT OF WHILE WRITING IT?\nTHE SAME THING HAPPENS WITH SOFTWARE. WORKING TO IMPLEMENT ONE IDEA\nGIVES YOU MORE IDEAS.\n-- PAUL GRAHAM, THE OTHER ROAD AHEAD.",
      "length": 267
    },
    {
      "text": "IN GENERAL, WE CAN THINK OF DATA AS DEFINED BY SOME COLLECTION OF\nSELECTORS AND CONSTRUCTORS, TOGETHER WITH SPECIFIED CONDITIONS THAT\nTHESE PROCEDURES MUST FULFILL IN ORDER TO BE A VALID REPRESENTATION.\n-- SICP, WHAT IS MEANT BY DATA?",
      "length": 234
    },
    {
      "text": "RESUME WRITING IS JUST LIKE DATING, OR APPLYING FOR A BANK LOAN, IN THAT\nNOBODY WANTS YOU IF YOU'RE DESPERATE.\n-- STEVE YEGGE.",
      "length": 126
    },
    {
      "text": "MASTERING ISN’T A SURVIVAL INSTINCT; IT’S AN URGE TO EXCEL. MASTERING IS\nONE OF THE EXPERIENCES THAT DELINEATES US FROM ANIMALS. IT IS STRIVING\nTO BE MORE TOMORROW THAN WE ARE TODAY; TO PERFECTLY PITCH THE BALL OVER\nHOME PLATE; TO CRAFT THE PERFECT SENTENCE IN AN ARTICLE; TO OPEN THE\nOVEN AND FEEL THE WARM, RICHLY-SCENTED CLOUD TELLING YOU DINNER IS GOING\nTO BE ABSOLUTELY EXTRAORDINARY. WE HUMANS CRAVE PERFECTION, TO BE\nMASTERS OF OUR DOMAIN, TO DISTINGUISH OURSELVES BY SHEER SKILL AND\nPROWESS.\n-- JOESGOALS.COM",
      "length": 516
    },
    {
      "text": "IT(MASTERING)’S KNOWING WHAT YOU ARE DOING.\n-- JOESGOALS.COM",
      "length": 60
    },
    {
      "text": "WELL THEN. HOW COULD YOU POSSIBLY LIVE WITHOUT AUTOMATED REFACTORING\nTOOLS? HOW ELSE COULD YOU COORDINATE THE CATERPILLAR-LIKE MOTIONS OF ALL\nJAVA’S IDENTICAL TINY LEGS, ITS THOUSANDS OF SIMILAR PARTS?\nI’LL TELL YOU HOW:\nRUBY IS A BUTTERFLY.\n-- STEVEY, REFACTORING TRILOGY, PART 1.",
      "length": 281
    },
    {
      "text": "YOU WILL NEVER BECOME A GREAT PROGRAMMER UNTIL YOU ACKNOWLEDGE THAT YOU\nWILL ALWAYS BE A TERRIBLE PROGRAMMER.\nYOU WILL REMAIN A GREAT PROGRAMMER FOR ONLY AS LONG AS YOU ACKNOWLEDGE\nTHAT YOU ARE STILL A TERRIBLE PROGRAMMER.\n-- MARC (HTTP://KICKIN-THE-DARKNESS.BLOGSPOT.COM/)",
      "length": 273
    },
    {
      "text": "IF I TELL YOU I'M GOOD, YOU WOULD PROBABLY THINK I'M BOASTING. IF I TELL\nYOU I'M NO GOOD, YOU KNOW I'M LYING.\n-- BRUCE LEE",
      "length": 122
    },
    {
      "text": "LET ME TRY TO GET THIS STRAIGHT: LISP IS A LANGUAGE FOR DESCRIBING\nALGORITHMS. THIS WAS JOHNMCCARTHY'S ORIGINAL PURPOSE, ANYWAY: TO BUILD\nSOMETHING MORE CONVENIENT THAN A TURING MACHINE. LISP IS NOT ABOUT FILE,\nSOCKET OR GUI PROGRAMMING - LISP IS ABOUT EXPRESSIVE POWER. (FOR\nEXAMPLE, YOU CAN DESIGN MULTIPLE OBJECT SYSTEMS FOR LISP, IN LISP. OR\nIMPLEMENT THE NOW-FASHIONABLE AOP. OR DO ARBITRARY TRANSFORMATIONS ON\nPARSED SOURCE CODE.) IF YOU DON'T VALUE EXPRESSIVE POWER, LISP AIN'T FOR\nYOU. I, PERSONALLY, WOULD PREFER LISP TO NOT BECOME MAINSTREAM: THIS\nWOULD NECESSARILY INVOLVE A DUMBING DOWN.\n-- VLADIMIRSLEPNEV",
      "length": 618
    },
    {
      "text": "JE NE VOUS IMPOSE AUCUNE CONTRAINTE, AUCUNE LIMITE. SURPRENEZ-MOI,\nÉTONNEZ-MOI, DÉFIEZ-MOI, DÉFIEZ-VOUS VOUS-MÊME. VOUS AVEZ LE CHOIX: VOUS\nPOUVEZ RESTER DANS L'OMBRE OU EN SORTIR EN ÉTANT PARMIS LES TROP RARES\nEXCEPTIONS À AVOIR RÉUSSI. L'HEURE EST VENUE D'ALLER BIEN AU DELÀ DE\nVOTRE POTENTIEL. L'HEURE EST VENUE MAINTENANT DE DESCENDRE VRAIMENT EN\nVOUS. L'HEURE EST VENUE DE DÉMONTRER POURQUOI VOUS ÊTES L'ÉLITE, LES\nQUELQUES ÉLUS, LES RARES LUEURS QUI OFFRENT À CETTE COMPAGNIE SON\nCARACTÈRE EXCEPTIONNEL, SA LUMINESCENCE.\n-- LE PDG DE NURV, DANS \"ANTI-TRUST\".",
      "length": 564
    },
    {
      "text": "IF SOMETHING ISN’T WORKING, YOU NEED TO LOOK BACK AND FIGURE OUT WHAT\nGOT YOU EXCITED IN THE FIRST PLACE.\n-- DAVID GORMAN (IMTHERE.COM)",
      "length": 135
    },
    {
      "text": "OPPORTUNITIES THAT PRESENT THEMSELVES TO YOU ARE THE CONSEQUENCE -- AT\nLEAST PARTIALLY -- OF BEING IN THE RIGHT PLACE AT THE RIGHT TIME. THEY\nTEND TO PRESENT THEMSELVES WHEN YOU'RE NOT EXPECTING IT -- AND OFTEN\nWHEN YOU ARE ENGAGED IN OTHER ACTIVITIES THAT WOULD SEEM TO PRECLUDE YOU\nFROM PURSUING THEM. AND THEY COME AND GO QUICKLY -- IF YOU DON'T JUMP\nALL OVER AN OPPORTUNITY, SOMEONE ELSE GENERALLY WILL AND IT WILL VANISH.\n-- MARC ANDREESSEN (HTTP://BLOG.PMARCA.COM/)",
      "length": 471
    },
    {
      "text": "PAY ATTENTION TO OPPORTUNITY COST AT ALL TIMES. DOING ONE THING MEANS\nNOT DOING OTHER THINGS. THIS IS A FORM OF RISK THAT IS VERY EASY TO\nIGNORE, TO YOUR DETRIMENT.\n-- MARC ANDREESSEN (HTTP://BLOG.PMARCA.COM/)",
      "length": 209
    },
    {
      "text": "SEIZE ANY OPPORTUNITY, OR ANYTHING THAT LOOKS LIKE OPPORTUNITY. THEY ARE\nRARE, MUCH RARER THAN YOU THINK...\n-- NASSIM NICHOLAS TALEB, \"THE BLACK SWAN\".",
      "length": 151
    },
    {
      "text": "I THINK THAT A LOT OF PROGRAMMERS ARE IGNORING AN IMPORTANT POINT WHEN\nPEOPLE TALK ABOUT REDUCING CODE REPETITION ON LARGE PROJECTS.\nPART OF THE IDEA IS THAT LARGE PROJECTS ARE INTRINSICALLY *WRONG*. THAT\nYOU SHOULD BE LOOKING AT MAKING A NUMBER OF SMALLER PROJECTS THAT ARE\nCOMPOSABLE, EVEN IF YOU NEVER END UP REUSING ONE OF THOSE SMALLER\nPROJECTS ELSEWHERE.\n-- DAN NUGENT",
      "length": 374
    },
    {
      "text": "WE TEND TO SEEK EASY, SINGLE-FACTOR EXPLANATIONS OF SUCCESS. FOR MOST\nIMPORTANT THINGS, THOUGH, SUCCESS ACTUALLY REQUIRES AVOIDING MANY\nSEPARATE CAUSES OF FAILURE.\n-- JARED DIAMOND",
      "length": 180
    },
    {
      "text": "THINGS WHICH MATTER MOST MUST NEVER BE AT THE MERCY OF THINGS WHICH\nMATTER LEAST.\n-- JOHANN WOLFGANG VON GOETHE (1749-1832)",
      "length": 123
    },
    {
      "text": "I THINK THE ROOT OF YOUR MISTAKE IS SAYING THAT MACROS DON'T SCALE TO\nLARGER GROUPS. THE REAL TRUTH IS THAT MACROS DON'T SCALE TO STUPIDER\nGROUPS.\n-- PAUL GRAHAM, ON THE LIGHTWEIGHT LANGUAGES MAILING LIST.",
      "length": 205
    },
    {
      "text": "ARGUE WITH IDIOTS, AND YOU BECOME AN IDIOT.\nIF YOU COMPETE WITH SLAVES YOU BECOME A SLAVE.\n-- PAUL GRAHAM AND NORBERT WEINER, RESPECTIVELY",
      "length": 138
    },
    {
      "text": "ALWAYS DIVE DOWN INTO A PROBLEM AND GET YOUR HANDS ON THE DEEPEST ISSUE\nBEHIND THE PROBLEM. ALL OTHER CONSIDERATIONS ARE TO DISMISSED AS\n\"ENGINEERING DETAILS\"; THEY CAN BE SORTED OUT AFTER THE BASIC PROBLEM\nHAS BEEN SOLVED.\n-- CHRIS CRAWFORD",
      "length": 241
    },
    {
      "text": "DON'T HAVE GOOD IDEAS IF YOU AREN'T WILLING TO BE RESPONSIBLE FOR THEM.\n-- ALAN PERLIS",
      "length": 86
    },
    {
      "text": "IT IS IMPOSSIBLE TO SHARPEN A PENCIL WITH A BLUNT AXE. IT IS EQUALLY\nVAIN TO TRY TO DO IT WITH TEN BLUNT AXES INSTEAD. \n-- EDSGER DIJKSTRA",
      "length": 138
    },
    {
      "text": "IF WE WISH TO COUNT LINES OF CODE, WE SHOULD NOT REGARD THEM AS LINES\nPRODUCED BUT AS LINES SPENT.\n-- EDSGER DIJKSTRA",
      "length": 117
    },
    {
      "text": "THE MOST DAMAGING PHRASE IN THE LANGUAGE IS, IT'S ALWAYS BEEN DONE THAT\nWAY.\n-- REAR ADMIRAL GRACE HOPPER",
      "length": 105
    },
    {
      "text": "GETTING BACK TO FAILING EARLY, I'VE LEARNED IT'S IMPORTANT TO COMPLETELY\nFAIL. GET FIRED. SHOOT THE PROJECT, THEN BURN ITS CORPSE. MELT THE CVS\nREPOSITORY AND MICROWAVE THE BACKUP CDS. WHEN THINGS GO WRONG, I'VE\nOFTEN TRIED TO PLAY THE HERO FROM START TO FINISH. GUESS WHAT? SOME\nPROJECTS ARE DOOMED NO MATTER WHAT. SOME NEED SKILLS I DON'T POSSESS.\nAND SOME NEED A FRESH FACE.\n-- REGINALD BRAITHWAITE",
      "length": 401
    },
    {
      "text": "THE ONLY THING A MAN SHOULD EVER BE 100% CONVINCED OF IS HIS OWN\nIGNORANCE.\n-- DJ MACLEAN",
      "length": 89
    },
    {
      "text": "THE BEST PEOPLE AND ORGANIZATIONS HAVE THE ATTITUDE OF WISDOM: THE\nCOURAGE TO ACT ON WHAT THEY KNOW RIGHT NOW AND THE HUMILITY TO CHANGE\nCOURSE WHEN THEY FIND BETTER EVIDENCE.\nTHE QUEST FOR MANAGEMENT MAGIC AND BREAKTHROUGH IDEAS IS OVERRATED;\nBEING A MASTER OF THE OBVIOUS IS UNDERRATED.\nJIM MALONEY IS RIGHT: WORK IS AN OVERRATED ACTIVITY\n-- BOB SUTTON",
      "length": 354
    },
    {
      "text": "IN THEORY, THERE’S NO DIFFERENCE BETWEEN THEORY AND PRACTICE. BUT IN\nPRACTICE, THERE IS.\n-- ALBERT EINSTEIN",
      "length": 107
    },
    {
      "text": "ACT FROM REASON, AND FAILURE MAKES YOU RETHINK AND STUDY HARDER.\nACT FROM FAITH, AND FAILURE MAKES YOU BLAME SOMEONE AND PUSH HARDER.\n--  ERIK NAGGUM",
      "length": 149
    },
    {
      "text": "MEASURE EVERYTHING YOU CAN ABOUT THE PRODUCT, AND YOU'LL START SEEING\nPATTERNS.\n-- MAX LEVCHIN, PAYPAL FOUNDER, TALK AT STARTUPSCHOOL2007",
      "length": 137
    },
    {
      "text": "SOMETHING CONFUSING ABOUT \"HARD\":\nIT'S TEMPTING TO THINK THAT IF IT'S HARD, THEN IT'S VALUABLE.\nMOST VALUABLE THINGS ARE HARD.\nMOST HARD THINGS ARE COMPLETELY USELESS -- (PICTURE OF SOMEONE SMASHING\nTHEIR HEAD THROUGH CONCRETE BLOCKS KUNG-FU STYLE).\nHARD DOES NOT EQUATE TO BEING VALUABLE.\nREMEMBER FRIENDSTER BACK IN THE DAY?\nYOU'D SIGN IN, INVITE FRIENDS, HAVE 25 FRIENDS, GO TO THEIR PROFILE, AND\nTHEN IT'D SHOW HOW YOU WERE CONNECTED TO EACH ONE.\nTHAT'S AN IMPRESSIVE [SOME GEEKY CS JARGON] CONE TRAVERSAL OF A TREE -\n100 MILLION STRING COMPARISONS PER PAGE -- IT WON'T SCALE.\nUSED TO TAKE A MINUTE PER PAGE TO LOAD, AND FRIENDSTER DIED A PAINFUL\nDEATH.\nMYSPACE -- NOT INTERESTED IN SOLVING PROBLEMS\nTHEY USE THE SHORTCUT OF \"MISS FITZPATRICK IS IN YOUR EXTENDED NETWORK\"\n(I.E. EVEN WHEN YOU'RE NOT EVEN SIGNED UP FOR MYSPACE)\nTHEY DIDN'T SOLVE THE HARD PROBLEM. BUT THEY MAKE THE MORE RELEVANT\nASSUMPTION THAT YOU WANT TO BE CONNECTED TO HOT WOMEN. [LOL]\nSHOWS ALEXA GRAPH SHOWING THAT IN EARLY 2005 MYSPACE TOOK OFF, AND\nQUICKLY BYPASSED FRIENDSTER AND NEVER LOOKED BACK.\n-- MAX LEVCHIN, PAYPAL FOUNDER, TALK AT STARTUPSCHOOL2007",
      "length": 1135
    },
    {
      "text": "QUALITY OF THE PEOPLE IS BETTER THAN THE QUALITY OF THE BUSINESS IDEA.\nCRAPPY PEOPLE CAN SCREW UP THE BEST IDEA IN THE WORLD.\n-- HADI PARTOVI & ALI PARTOVI (ILIKE.COM), TALK AT STARTUPSCHOOL2007",
      "length": 194
    },
    {
      "text": "THE ONLY CONSTANT IN THE WORLD OF HI-TECH IS CHANGE.\n-- MARK WARD",
      "length": 65
    },
    {
      "text": "WRITE IT PROPERLY FIRST. IT'S EASIER TO MAKE A CORRECT PROGRAM FAST,\nTHAN TO MAKE A FAST PROGRAM CORRECT.\n-- HTTP://WWW.CPAX.ORG.UK/PRG/",
      "length": 136
    },
    {
      "text": "J'AI TOUJOURS PRÉFÉRÉ LA FOLIE DES PASSIONS À LA SAGESSE DE\nL'INDIFFÉRENCE.\n-- ANATOLE FRANCE",
      "length": 93
    },
    {
      "text": "YOU CAN’T GET TO VERSION 500 IF YOU DON’T START WITH A VERSION 1.\n-- BETTEREXPLAINED.COM",
      "length": 88
    },
    {
      "text": "THE WONDERFUL AND FRUSTRATING THING ABOUT UNDERSTANDING YOURSELF IS THAT\nNOBODY CAN DO IT FOR YOU.\n-- BETTEREXPLAINED.COM",
      "length": 121
    },
    {
      "text": "WHEN YOU HAVE ELIMINATED THE IMPOSSIBLE, WHATEVER REMAINS, HOWEVER\nIMPROBABLE, MUST BE THE TRUTH.\n-- SHERLOCK HOLMES",
      "length": 116
    },
    {
      "text": "IN ORDER TO UNDERSTAND WHAT ANOTHER PERSON IS SAYING, YOU MUST ASSUME\nTHAT IT IS TRUE AND TRY TO FIND OUT WHAT IT COULD BE TRUE OF.\n-- GEORGE MILLER",
      "length": 148
    },
    {
      "text": "A JOURNEY OF A THOUSAND MILES MUST BEGIN WITH A SINGLE STEP.\n-- LAO­TZU",
      "length": 71
    },
    {
      "text": "C’S GREAT FOR WHAT IT’S GREAT FOR.\n-- BEN HOYTS (MICROPLEDGE)",
      "length": 61
    },
    {
      "text": "THERE IS ONE MEANING [FOR STATIC IN C]: A GLOBAL VARIABLE THAT IS\nINVISIBLE OUTSIDE THE CURRENT SCOPE, BE IT A FUNCTION OR A FILE.\n-- PAOLO BONZINI",
      "length": 147
    },
    {
      "text": "PROCESSORS DON'T GET BETTER SO THAT THEY CAN HAVE MORE FREE TIME.\nPROCESSORS GET BETTER SO _YOU_ CAN HAVE MORE FREE TIME.\n-- LECAMARADE (FREESHELLS.CH)",
      "length": 151
    },
    {
      "text": "THE VENERABLE MASTER QC NA WAS WALKING WITH HIS STUDENT, ANTON.  HOPING TO\nPROMPT THE MASTER INTO A DISCUSSION, ANTON SAID \"MASTER, I HAVE HEARD THAT\nOBJECTS ARE A VERY GOOD THING - IS THIS TRUE?\"  QC NA LOOKED PITYINGLY AT\nHIS STUDENT AND REPLIED, \"FOOLISH PUPIL - OBJECTS ARE MERELY A POOR MAN'S\nCLOSURES.\"\n    CHASTISED, ANTON TOOK HIS LEAVE FROM HIS MASTER AND RETURNED TO HIS CELL,\nINTENT ON STUDYING CLOSURES.  HE CAREFULLY READ THE ENTIRE \"LAMBDA: THE\nULTIMATE...\" SERIES OF PAPERS AND ITS COUSINS, AND IMPLEMENTED A SMALL\nSCHEME INTERPRETER WITH A CLOSURE-BASED OBJECT SYSTEM.  HE LEARNED MUCH, AND\nLOOKED FORWARD TO INFORMING HIS MASTER OF HIS PROGRESS.\n    ON HIS NEXT WALK WITH QC NA, ANTON ATTEMPTED TO IMPRESS HIS MASTER BY\nSAYING \"MASTER, I HAVE DILIGENTLY STUDIED THE MATTER, AND NOW UNDERSTAND\nTHAT OBJECTS ARE TRULY A POOR MAN'S CLOSURES.\"  QC NA RESPONDED BY HITTING\nANTON WITH HIS STICK, SAYING \"WHEN WILL YOU LEARN? CLOSURES ARE A POOR MAN'S\nOBJECT.\"  AT THAT MOMENT, ANTON BECAME ENLIGHTENED.\n-- ANTON VAN STRAATEN (NA = NORMAN ADAMS, QA = CHRISTIAN QUEINNEC)",
      "length": 1080
    },
    {
      "text": "UNDERSTANDING WHY C++ IS THE WAY IT IS HELPS A PROGRAMMER USE IT WELL. A DEEP\nUNDERSTANDING OF A TOOL IS ESSENTIAL FOR AN EXPERT CRAFTSMAN.\n-- BJARNE STROUSTRAP",
      "length": 160
    },
    {
      "text": "NO ART, HOWEVER MINOR, DEMANDS LESS THAN TOTAL DEDICATION IF YOU WANT TO\nEXCEL IN IT.\n-- ALBERTI",
      "length": 96
    },
    {
      "text": "THE MINUTE YOU PUT THE BLAME ON SOMEONE ELSE YOU’VE SWITCH THINGS FROM\nBEING A PROBLEM YOU CAN CONTROL TO A PROBLEM OUTSIDE OF YOUR CONTROL.\n-- ENGTECH (INTERNETDUCTTAPE.COM)",
      "length": 174
    },
    {
      "text": "STATE IS THE ROOT OF ALL EVIL. IN PARTICULAR FUNCTIONS WITH SIDE EFFECTS\nSHOULD BE AVOIDED.\n-- OO SUCKS (BLUETAIL.COM)",
      "length": 118
    },
    {
      "text": "ILS NE SONT PAS FORTS PARCE QU'ILS SONT FORTS. ILS SONT FORTS PARCE QUE\nNOUS SOMMES FAIBLES.\n-- RAGALA KHALID",
      "length": 109
    },
    {
      "text": "IT IS BETTER TO BE QUIET AND THOUGHT A FOOL THAN TO OPEN YOUR MOUTH AND\nREMOVE ALL DOUBT.\n-- WIKIHOW",
      "length": 100
    },
    {
      "text": "A TAIL CALL ALLOWS A FUNCTION TO RETURN THE RESULT OF ANOTHER FUNCTION\nWITHOUT LEAVING AN ENTRY ON THE STACK. TAIL RECURSION IS A SPECIFIC CASE\nOF TAIL CALLING.\n-- ASPN : PYTHON COOKBOOK : EXPLICIT TAIL CALL",
      "length": 207
    },
    {
      "text": "SIMPLICITY MEANS THE ACHIEVEMENT OF MAXIMUM EFFECT WITH MINIMUM MEANS.\n-- DR. KOICHI KAWANA",
      "length": 91
    },
    {
      "text": "NORMALITY IS THE ROUTE TO NOWHERE.\n-- RIDDERSTRALE & NORDSTORM, FUNKY BUSINESS",
      "length": 78
    },
    {
      "text": "THE PROBLEM IS THAT MICROSOFT JUST HAS NO TASTE. AND I DON'T MEAN THAT\nIN A SMALL WAY, I MEAN THAT IN A BIG WAY.\n-- STEVE JOBS",
      "length": 126
    },
    {
      "text": "DO YOU WANT TO SELL SUGARED WATER ALL YOUR LIFE OR DO YOU WANT TO CHANGE\nTHE WORLD?\n-- STEVE JOBS, TO JOHN SCULLEY (FORMER PEPSI EXECUTIVE)",
      "length": 139
    },
    {
      "text": "1 - CREATIVITY AND INNOVATION ALWAYS BUILD ON THE PAST.\n2 - THE PAST ALWAYS TRIES TO CONTROL THE CREATIVITY THAT BUILDS ON IT.\n3 - FREE SOCIETIES ENABLE THE FUTURE BY LIMITING THE PAST.\n4 - OURS IS LESS AND LESS A FREE SOCIETY.\n-- LAWRENCE LESSIG, FREE CULTURE.",
      "length": 261
    },
    {
      "text": "GOOD WORK IS NO DONE BY ‘HUMBLE’ MEN.\n-- H. HARDY, A MATHEMATICIAN'S APOLOGY.",
      "length": 77
    },
    {
      "text": "SIMPLICITY AND PRAGMATISM BEAT COMPLEXITY AND THEORY ANY DAY.\n-- DENNIS (BLOG COMMENT)",
      "length": 86
    },
    {
      "text": "THE PROOF IS BY REDUCTIO AD ABSURDUM, AND REDUCTIO AD ABSURDUM, WHICH\nEUCLID LOVED SO MUCH, IS ONE OF A MATHEMATICIAN’S FINEST WEAPONS. IT IS\nA FAR FINER GAMBIT THAN ANY CHESS GAMBIT: A CHESS PLAYER MAY OFFER THE\nSACRIFICE OF A PAWN OR EVEN A PIECE, BUT A MATHEMATICIAN OFFERS THE\nGAME.\n-- G. H. HARDY",
      "length": 301
    },
    {
      "text": "REMEMBER, ALWAYS BE YOURSELF ... UNLESS YOU SUCK!\n-- JOSS WHEDON",
      "length": 64
    },
    {
      "text": "ALL GREAT THINGS REQUIRE GREAT DEDICATION.\n-- CHUCK NORRIS(?)",
      "length": 61
    },
    {
      "text": "I'M ALWAYS HAPPY TO TRADE PERFORMANCE FOR READABILITY AS LONG AS THE\nFORMER ISN'T ALREADY SCARCE.\n-- CRAYZ (COMMENTOR ON BLOG.RAGANWALD.COM)",
      "length": 140
    },
    {
      "text": "YOU HAVE TO WRITE FOR YOUR AUDIENCE. I WOULD NEVER WRITE (1..5).MAP\n&'*2' IN JAVA WHEN I COULD WRITE\nLISTFACTORYFACTORY.GETLISTFACTORYFROMRESOURCE(\n    NEW RESOURCENAME('COM.JAVAX.MAGNITUDES.INTEGERS').\nSETLOWERBOUND(1).SETUPPERBOUND(5).SETSTEP(1).APPLYFUNCTOR(\n    NEW FUNCTOR () { PUBLIC VOID EVAL (X) { RETURN X * 2; } }))\nI'M SIMPLIFYING, OF COURSE, I'VE LEFT OUT THE SECURITY AND LOGGING\nWRAPPERS.\n-- REGINALD BRAITHWAIT",
      "length": 425
    },
    {
      "text": "THE DEFINITION OF INSANITY IS DOING THE SAME THING OVER AND OVER AGAIN\nAND EXPECTING DIFFERENT RESULTS.\n-- BENJAMIN FRANKLIN",
      "length": 124
    },
    {
      "text": "A NO UTTERED FROM THE DEEPEST CONVICTION IS BETTER THAN A YES MERELY\nUTTERED TO PLEASE OR WHAT IS WORSE, TO AVOID TROUBLE.\n-- MAHATMA GANDHI",
      "length": 140
    },
    {
      "text": "I THINK IT IS WISE, AND ONLY HONEST, TO WARN YOU THAT MY GOAL IS\nIMMODEST. IT IS NOT MY PURPOSE TO \"TRANSFER KNOWLEDGE\" TO YOU THAT,\nSUBSEQUENTLY, YOU CAN FORGET AGAIN. MY PURPOSE IS NO LESS THAN TO\nEFFECTUATE IN EACH OF YOU A NOTICEABLE, IRREVERSABLE CHANGE. I WANT YOU\nTO GAIN, FOR THE REST OF YOUR LIVES, THE INSIGHT THAT BEAUTIFUL PROOFS\nARE NOT \"FOUND\" BY TRIAL ANF ERROR BUT ARE THE RESULT OF A CONSCIOUSLY\nAPPLIED DESIGN DISCIPLINE. I WANT YOU TO RAISE YOUR QUALITY STANDARDS. I\nMEAN, IF 10 YEARS FROM NOW, WHEN YOU ARE DOING SOMETHING QUICK AND\nDIRTY, YOU SUDDENLY VISUALIZE THAT I AM LOOKING OVER YOUR SHOULDERS AND\nSAY TO YOURSELF \"DIJKSTRA WOULD NOT HAVE LIKED THIS\", WELL, THAT WOULD\nBE ENOUGH IMMORTALITY FOR ME.\n-- E. W. DIJKSTRA",
      "length": 743
    },
    {
      "text": "THE GENERAL PRINCIPLE FOR COMPLEXITY DESIGN IS THIS: THINK LOCALLY, ACT\nLOCALLY.\n-- RICHARD P. GABRIEL & RON GOLDMAN, MOB SOFTWARE: THE EROTIC LIFE OF CODE",
      "length": 155
    },
    {
      "text": "PROGRAMMING IS THE ART OF FIGURING OUT WHAT YOU WANT SO PRECISELY THAT\nEVEN A MACHINE CAN DO IT.\n-- SOME GUY WHO ISN'T FAMOUS",
      "length": 125
    },
    {
      "text": "HENCE MY URGENT ADVICE TO ALL OF YOU TO REJECT THE MORALS OF THE\nBESTSELLER SOCIETY AND TO FIND, TO START WITH, YOUR REWARD IN YOUR OWN\nFUN. THIS IS QUITE FEASIBLE, FOR THE CHALLENGE OF SIMPLIFICATION IS SO\nFASCINATING THAT, IF WE DO OUR JOB PROPERLY, WE SHALL HAVE THE GREATEST\nFUN IN THE WORLD.\n-- E. W. DIJKSTRA, ON THE NATURE OF COMPUTING SCIENCE.",
      "length": 351
    },
    {
      "text": "REMEMBER: YOU ARE ALONE. EVERY TIME YOU CAN GET HELP FROM SOMEONE,\nIT IS AN OPPORTUNITY: YOU SHOULD EAGERLY SIZE IT. BUT THEN, PROMPTLY\nRETURN TO NORMAL MODE: YOU ARE ALONE AND YOU MUST BE PREPARED TO SOLVE\nEVERY PROBLEM YOURSELF.\n-- ERIC KEDJI",
      "length": 244
    },
    {
      "text": "MAKING ALL SOFTWARE INTO TOOLS REDUCES RISK.\n-- SMOOTHSPAN.COM",
      "length": 62
    },
    {
      "text": "SOME MAY SAY RUBY IS A BAD RIP-OFF OF LISP OR SMALLTALK, AND I ADMIT\nTHAT. BUT IT IS NICER TO ORDINARY PEOPLE.\n-- MATZ, LL2",
      "length": 123
    },
    {
      "text": "C AND LISP STAND AT OPPOSITE ENDS OF THE SPECTRUM; THEY'RE EACH GREAT AT\nWHAT THE OTHER ONE SUCKS AT.\n-- STEVE YEGGE, TOUR DE BABEL.",
      "length": 132
    },
    {
      "text": "TWO PEOPLE SHOULD STAY TOGETHER IF TOGETHER THEY ARE BETTER PEOPLE THAN\nTHEY WOULD BE INDIVIDUALLY.\n-- ?",
      "length": 104
    },
    {
      "text": "TO THE OPTIMIST, THE GLASS IS HALF FULL. TO THE PESSIMIST, THE GLASS IS\nHALF EMPTY. TO THE ENGINEER, THE GLASS IS TWICE AS BIG AS IT NEEDS TO\nBE.\n-- AUTHOR UNKNOWN (QUOTED IN `ROBUST SYSTEMS', GERALD JAY SUSEMAN)",
      "length": 212
    },
    {
      "text": "IT IS PRACTICALLY IMPOSSIBLE TO TEACH GOOD PROGRAMMING TO STUDENTS THAT\nHAVE HAD A PRIOR EXPOSURE TO BASIC: AS POTENTIAL PROGRAMMERS THEY ARE\nMENTALLY MUTILATED BEYOND HOPE OF REGENERATION.\n-- EDSGER DIJKSTRA",
      "length": 208
    },
    {
      "text": "WHATEVER IS WORTH DOING AT ALL, IS WORTH DOING WELL.\n-- EARL OF CHESTERFIELD",
      "length": 76
    },
    {
      "text": "RULES OF OPTIMIZATION:\nRULE 1: DON’T DO IT.\nRULE 2 (FOR EXPERTS ONLY): DON’T DO IT YET.\n-- M.A. JACKSON",
      "length": 103
    },
    {
      "text": "MORE COMPUTING SINS ARE COMMITTED IN THE NAME OF EFFICIENCY (WITHOUT\nNECESSARILY ACHIEVING IT) THAN FOR ANY OTHER SINGLE REASON - INCLUDING\nBLIND STUPIDITY.\n-- W.A. WULF",
      "length": 169
    },
    {
      "text": "WE SHOULD FORGET ABOUT SMALL EFFICIENCIES, SAY ABOUT 97% OF THE TIME:\nPREMATURE OPTIMIZATION IS THE ROOT OF ALL EVIL.\n-- DONALD KNUTH",
      "length": 133
    },
    {
      "text": "THE BEST IS THE ENEMY OF THE GOOD.\n-- VOLTAIRE",
      "length": 46
    },
    {
      "text": "THE JOB OF A LEADER TODAY IS NOT TO CREATE FOLLOWERS. IT’S TO CREATE\nMORE LEADERS.\n-- RALPH NADER",
      "length": 97
    },
    {
      "text": "THE PRESIDENT WAS VISITING NASA HEADQUARTERS AND STOPPED TO TALK TO A\nMAN WHO WAS HOLDING A MOP. “AND WHAT DO YOU DO?” HE ASKED. THE MAN, A\nJANITOR, REPLIED, “I’M HELPING TO PUT A MAN ON THE MOON, SIR.”\n-- THE LITTLE BOOK OF LEADERSHIP",
      "length": 235
    },
    {
      "text": "ONLY MAKE NEW MISTAKES.\n-- PHIL DOURADO",
      "length": 39
    },
    {
      "text": "YOU CAN RECOGNIZE TRUTH BY ITS BEAUTY AND SIMPLICITY. WHEN YOU GET IT\nRIGHT, IT IS OBVIOUS THAT IT IS RIGHT.\n-- RICHARD FEYNMAN",
      "length": 127
    },
    {
      "text": "TALKERS ARE NO GOOD DOERS.\n-- WILLIAM SHAKESPEARE, \"HENRY VI\"",
      "length": 61
    },
    {
      "text": "PHOTOGRAPHY IS PAINTING WITH LIGHT.\n-- ERIC HAMILTON",
      "length": 52
    },
    {
      "text": "GOOD ARTISTS COPY. GREAT ARTISTS STEAL.\n-- PABLO PICASSO",
      "length": 56
    },
    {
      "text": "A GUIDELINE IN THE PROCESS OF STEPWISE REFINEMENT SHOULD BE THE\nPRINCIPLE TO DECOMPOSE DECISIONS AS MUCH AS POSSIBLE, TO UNTANGLE\nASPECTS WHICH ARE ONLY SEEMINGLY INTERDEPENDENT, AND TO DEFER THOSE\nDECISIONS WHICH CONCERN DETAILS OF REPRESENTATION AS LONG AS POSSIBLE.\n-- NIKLAUS WIRTH",
      "length": 285
    },
    {
      "text": "VIGOROUS WRITING IS CONCISE. A SENTENCE SHOULD CONTAIN NO UNNECESSARY\nWORDS, A PARAGRAPH NO UNNECESSARY SENTENCES, FOR THE SAME REASON THAT A\nDRAWING SHOULD HAVE NO UNNECESSARY LINES AND A MACHINE NO UNNECESSARY\nPARTS. THIS REQUIRES NOT THAT THE WRITER MAKE ALL SENTENCES SHORT OR\nAVOID ALL DETAIL AND TREAT SUBJECTS ONLY IN OUTLINE, BUT THAT EVERY WORD\nTELL.\n-- WILLIAM STRUNK, JR. (THE ELEMENTS OF STYLE)",
      "length": 406
    },
    {
      "text": "THE PROBLEM IS THAT SMALL EXAMPLES FAIL TO CONVINCE, AND LARGE EXAMPLES\nARE TOO BIG TO FOLLOW.\n-- STEVE YEGGE.",
      "length": 110
    },
    {
      "text": "WE ARE THE SUM OF OUR BEHAVIOURS; EXCELLENCE THEREFORE IS NOT AN ACT BUT\nA HABIT.\n-- ARISTOTLE.",
      "length": 95
    },
    {
      "text": "THE PURPOSE OF ABSTRACTION IS NOT TO BE VAGUE, BUT TO CREATE A NEW\nSEMANTIC LEVEL IN WHICH ONE CAN BE ABSOLUTELY PRECISE.\n-- EDSGER DIJKSTRA",
      "length": 140
    },
    {
      "text": "EVERY MAN PREFERS BELIEF TO THE EXERCISE OF JUDGMENT.\n-- SENECA",
      "length": 63
    },
    {
      "text": "IT’S HARD TO GRASP ABSTRACTIONS IF YOU DON’T UNDERSTAND WHAT THEY’RE\nABSTRACTING AWAY FROM.\n-- NATHAN WEIZENBAUM",
      "length": 112
    },
    {
      "text": "THAT IS ONE OF THE MOST DISTINCTIVE DIFFERENCES BETWEEN SCHOOL AND THE\nREAL WORLD: THERE IS NO REWARD FOR PUTTING IN A GOOD EFFORT. IN FACT,\nTHE WHOLE CONCEPT OF A \"GOOD EFFORT\" IS A FAKE IDEA ADULTS INVENTED TO\nENCOURAGE KIDS. IT IS NOT FOUND IN NATURE.\n-- PAUL GRAHAM",
      "length": 269
    },
    {
      "text": "I FIND THAT THE HARDER I WORK, THE MORE LUCK I SEEM TO HAVE.\n-- THOMAS JEFFERSON",
      "length": 80
    },
    {
      "text": "DON'T STAY IN BED, UNLESS YOU CAN MAKE MONEY IN BED.\n-- GEORGE BURNS",
      "length": 68
    },
    {
      "text": "IF EVERYTHING SEEMS UNDER CONTROL, YOU'RE NOT GOING FAST ENOUGH.\n-- MARIO ANDRETTI",
      "length": 82
    },
    {
      "text": "CHANCE FAVORS THE PREPARED MIND.\n-- LOUIS PASTEUR",
      "length": 49
    },
    {
      "text": "CONTROLLING COMPLEXITY IS THE ESSENCE OF COMPUTER PROGRAMMING.\n-- BRIAN KERNIGAN",
      "length": 80
    },
    {
      "text": "THE FUNCTION OF GOOD SOFTWARE IS TO MAKE THE COMPLEX APPEAR TO BE\nSIMPLE.\n-- GRADY BOOCH",
      "length": 88
    },
    {
      "text": "PROGRAMMERS ARE IN A RACE WITH THE UNIVERSE TO CREATE BIGGER AND BETTER\nIDIOT-PROOF PROGRAMS, WHILE THE UNIVERSE IS TRYING TO CREATE BIGGER AND\nBETTER IDIOTS.  SO FAR THE UNIVERSE IS WINNING.\n-- RICH COOK",
      "length": 204
    },
    {
      "text": "A HACKER ON A ROLL MAY BE ABLE TO PRODUCE–IN A PERIOD OF A FEW\nMONTHS–SOMETHING THAT A SMALL DEVELOPMENT GROUP (SAY, 7-8 PEOPLE) WOULD\nHAVE A HARD TIME GETTING TOGETHER OVER A YEAR.  IBM USED TO REPORT THAT\nCERTAIN PROGRAMMERS MIGHT BE AS MUCH AS 100 TIMES AS PRODUCTIVE AS OTHER\nWORKERS, OR MORE.\n-- PETER SEEBACH",
      "length": 314
    },
    {
      "text": "THE BEST PROGRAMMERS ARE NOT MARGINALLY BETTER THAN MERELY GOOD ONES.\nTHEY ARE AN ORDER-OF-MAGNITUDE BETTER, MEASURED BY WHATEVER STANDARD:\nCONCEPTUAL CREATIVITY, SPEED, INGENUITY OF DESIGN, OR PROBLEM-SOLVING\nABILITY.\n-- RANDALL E. STROSS",
      "length": 239
    },
    {
      "text": "A GREAT LATHE OPERATOR COMMANDS SEVERAL TIMES THE WAGE OF AN AVERAGE\nLATHE OPERATOR, BUT A GREAT WRITER OF SOFTWARE CODE IS WORTH 10,000\nTIMES THE PRICE OF AN AVERAGE SOFTWARE WRITER.\n-- BILL GATES",
      "length": 197
    },
    {
      "text": "MEASURING PROGRAMMING PROGRESS BY LINES OF CODE IS LIKE MEASURING\nAIRCRAFT BUILDING PROGRESS BY WEIGHT.\n-- BILL GATES",
      "length": 117
    },
    {
      "text": "FIRST LEARN COMPUTER SCIENCE AND ALL THE THEORY.  NEXT DEVELOP A\nPROGRAMMING STYLE.  THEN FORGET ALL THAT AND JUST HACK.\n-- GEORGE CARRETTE",
      "length": 139
    },
    {
      "text": "TO ITERATE IS HUMAN, TO RECURSE DIVINE.\n-- L. PETER DEUTSCH",
      "length": 59
    },
    {
      "text": "THE BEST THING ABOUT A BOOLEAN IS EVEN IF YOU ARE WRONG, YOU ARE ONLY\nOFF BY A BIT.\n-- ANONYMOUS",
      "length": 96
    },
    {
      "text": "SHOULD ARRAY INDICES START AT 0 OR 1?  MY COMPROMISE OF 0.5 WAS REJECTED\nWITHOUT, I THOUGHT, PROPER CONSIDERATION.\n-- STAN KELLY-BOOTLE",
      "length": 135
    },
    {
      "text": "THE USE OF COBOL CRIPPLES THE MIND; ITS TEACHING SHOULD THEREFORE BE\nREGARDED AS A CRIMINAL OFFENSE.\n-- E.W. DIJKSTRA",
      "length": 117
    },
    {
      "text": "IT IS PRACTICALLY IMPOSSIBLE TO TEACH GOOD PROGRAMMING STYLE TO STUDENTS\nTHAT HAVE HAD PRIOR EXPOSURE TO BASIC.  AS POTENTIAL PROGRAMMERS, THEY\nARE MENTALLY MUTILATED BEYOND HOPE OF REGENERATION.\n-- E. W. DIJKSTRA",
      "length": 213
    },
    {
      "text": "ONE OF THE MAIN CAUSES OF THE FALL OF THE ROMAN EMPIRE WAS THAT–LACKING\nZERO–THEY HAD NO WAY TO INDICATE SUCCESSFUL TERMINATION OF THEIR C\nPROGRAMS.\n-- ROBERT FIRTH",
      "length": 164
    },
    {
      "text": "SAYING THAT JAVA IS NICE BECAUSE IT WORKS ON ALL OSES IS LIKE SAYING\nTHAT ANAL SEX IS NICE BECAUSE IT WORKS ON ALL GENDERS.\n-- ALANNA",
      "length": 133
    },
    {
      "text": "IF JAVA HAD TRUE GARBAGE COLLECTION, MOST PROGRAMS WOULD DELETE\nTHEMSELVES UPON EXECUTION.\n-- ROBERT SEWELL",
      "length": 107
    },
    {
      "text": "SOFTWARE IS LIKE SEX: IT’S BETTER WHEN IT’S FREE.\n-- LINUS TORVALDS",
      "length": 67
    },
    {
      "text": "ANY CODE OF YOUR OWN THAT YOU HAVEN’T LOOKED AT FOR SIX OR MORE MONTHS\nMIGHT AS WELL HAVE BEEN WRITTEN BY SOMEONE ELSE.\n-- EAGLESON’S LAW",
      "length": 137
    },
    {
      "text": "GOOD PROGRAMMERS USE THEIR BRAINS, BUT GOOD GUIDELINES SAVE US HAVING TO\nTHINK OUT EVERY CASE.\n-- FRANCIS GLASSBOROW",
      "length": 116
    },
    {
      "text": "CONSIDERING THE CURRENT SAD STATE OF OUR COMPUTER PROGRAMS, SOFTWARE\nDEVELOPMENT IS CLEARLY STILL A BLACK ART, AND CANNOT YET BE CALLED AN\nENGINEERING DISCIPLINE.\n-- BILL CLINTON",
      "length": 178
    },
    {
      "text": "IF DEBUGGING IS THE PROCESS OF REMOVING BUGS, THEN PROGRAMMING MUST BE\nTHE PROCESS OF PUTTING THEM IN.\n-- EDSGER W. DIJKSTRA",
      "length": 124
    },
    {
      "text": "ALWAYS CODE AS IF THE GUY WHO ENDS UP MAINTAINING YOUR CODE WILL BE A\nVIOLENT PSYCHOPATH WHO KNOWS WHERE YOU LIVE.\n-- MARTIN GOLDING",
      "length": 132
    },
    {
      "text": "EVERYTHING THAT CAN BE INVENTED HAS BEEN INVENTED.\n-- CHARLES H. DUELL, COMMISSIONER, U.S. OFFICE OF PATENTS, 1899",
      "length": 114
    },
    {
      "text": "I THINK THERE’S A WORLD MARKET FOR ABOUT 5 COMPUTERS.\n-- THOMAS J. WATSON, CHAIRMAN OF THE BOARD, IBM, CIRCA 1948",
      "length": 113
    },
    {
      "text": "IT WOULD APPEAR THAT WE HAVE REACHED THE LIMITS OF WHAT IT IS POSSIBLE\nTO ACHIEVE WITH COMPUTER TECHNOLOGY, ALTHOUGH ONE SHOULD BE CAREFUL WITH\nSUCH STATEMENTS, AS THEY TEND TO SOUND PRETTY SILLY IN 5 YEARS. \n-- JOHN VON NEUMANN, CIRCA 1949",
      "length": 240
    },
    {
      "text": "BUT WHAT IS IT GOOD FOR?\n-- ENGINEER AT THE ADVANCED COMPUTING SYSTEMS DIVISION OF IBM,\nCOMMENTING ON THE MICROCHIP, 1968",
      "length": 121
    },
    {
      "text": "THERE IS NO REASON FOR ANY INDIVIDUAL TO HAVE A COMPUTER IN HIS HOME.\n-- KEN OLSON, PRESIDENT, DIGITAL EQUIPMENT CORPORATION, 1977",
      "length": 130
    },
    {
      "text": "640K OUGHT TO BE ENOUGH FOR ANYBODY.\n-- BILL GATES, 1981",
      "length": 56
    },
    {
      "text": "WINDOWS NT ADDRESSES 2 GIGABYTES OF RAM, WHICH IS MORE THAN ANY\nAPPLICATION WILL EVER NEED.\n-- MICROSOFT, ON THE DEVELOPMENT OF WINDOWS NT, 1992",
      "length": 144
    },
    {
      "text": "WE WILL NEVER BECOME A TRULY PAPER-LESS SOCIETY UNTIL THE PALM PILOT\nFOLKS COME OUT WITH WIPEME 1.0.\n-- ANDY PIERSON",
      "length": 116
    },
    {
      "text": "IF IT KEEPS UP, MAN WILL ATROPHY ALL HIS LIMBS BUT THE PUSH-BUTTON\nFINGER.\n-- FRANK LLOYD WRIGHT",
      "length": 96
    },
    {
      "text": "FUNCTIONAL PROGRAMMING IS LIKE DESCRIBING YOUR PROBLEM TO A\nMATHEMATICIAN.  IMPERATIVE PROGRAMMING IS LIKE GIVING INSTRUCTIONS TO\nAN IDIOT.\n-- ARCUS, #SCHEME ON FREENODE",
      "length": 169
    },
    {
      "text": "ITS A SHAME THAT THE STUDENTS OF OUR GENERATION GREW UP WITH WINDOWS AND\nMICE BECAUSE THAT TAINTED OUR MINDSET NOT TO THINK IN TERMS OF POWERFUL\nTOOLS. SOME OF US ARE JUST SO TAINTED THAT WE WILL NEVER RECOVER.\n-- JEFFREY MARK SISKIND <QOBI@RESEARCH.NJ.NEC.COM> IN COMP.LANG.LISP",
      "length": 279
    },
    {
      "text": "LISP IS A PROGRAMMABLE PROGRAMMING LANGUAGE.\n-- JOHN FODERARO",
      "length": 61
    },
    {
      "text": "I GUESS, WHEN YOU'RE DRUNK, EVERY WOMAN LOOKS BEAUTIFUL AND EVERY\nLANGUAGE LOOKS (LIKE) A LISP :)\n-- LAMENT, #SCHEME@FREENODE.NET",
      "length": 129
    },
    {
      "text": "MANY OF LIFE'S FAILURES ARE PEOPLE WHO DID NOT REALIZE HOW CLOSE THEY\nWERE TO SUCCESS WHEN THEY GAVE UP.\n-- THOMAS EDISON",
      "length": 121
    },
    {
      "text": "YOU MUST ALWAYS WORK NOT JUST WITHIN BUT BELOW YOUR MEANS. IF YOU CAN\nHANDLE THREE ELEMENTS, HANDLE ONLY TWO. IF YOU CAN HANDLE TEN, THEN\nHANDLE FIVE. IN THAT WAY THE ONES YOU DO HANDLE, YOU HANDLE WITH MORE\nEASE, MORE MASTERY AND YOU CREATE A FEELING OF STRENGTH IN RESERVE.\n-- PABLO PICASSO",
      "length": 292
    },
    {
      "text": "WHEN YOU’VE GOT THE CODE ALL RIPPED APART, IT’S LIKE A CAR THAT’S ALL\nDISASSEMBLED. YOU’VE GOT ALL THE PARTS TYING ALL OVER YOUR GARAGE AND\nYOU HAVE TO REPLACE THE BROKEN PART OR THE CAR WILL NEVER RUN. IT’S NOT\nFUN UNTIL THE CODE GETS BACK TO THE BASELINE AGAIN.\n-- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 334
    },
    {
      "text": "WELL, IF YOU TALK ABOUT PROGRAMMING TO A GROUP OF PROGRAMMERS WHO USE\nTHE SAME LANGUAGE, THEY CAN BECOME ALMOST EVANGELISTIC ABOUT THE\nLANGUAGE. THEY FORM A TIGHT-KNIT COMMUNITY, HOLD TO CERTAIN BELIEFS, AND\nFOLLOW CERTAIN RULES IN THEIR PROGRAMMING. IT’S LIKE A CHURCH WITH A\nPROGRAMMING LANGUAGE FOR A BIBLE.\n-- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 381
    },
    {
      "text": "IT’S A PROBLEM IF THE DESIGN DOESN’T LET YOU ADD FEATURES AT A LATER\nDATE. IF YOU HAVE TO REDO A PROGRAM, THE HOURS YOU SPEND CAN CAUSE YOU\nTO LOSE YOUR COMPETITIVE EDGE. A FLEXIBLE PROGRAM DEMONSTRATES THE\nDIFFERENCE BETWEEN A GOOD DESIGNER AND SOMEONE WHO IS JUST GETTING A\nPIECE OF CODE OUT.\n-- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 365
    },
    {
      "text": "[HOW FRIENDLY WILL THIS MACHINE BE?] WELL, I DON’T THINK IT’S A MATTER\nOF FRIENDLINESS, BECAUSE ULTIMATELY IF THE PROGRAM IS GOING TO\nACCOMPLISH ANYTHING OF VALUE, IT WILL PROBABLY BE RELATIVELY COMPLEX.\n-- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 274
    },
    {
      "text": "SOME PEOPLE SUGGEST THAT MACHINES WOULD BE FRIENDLIER IF INPUT COULD BE\nIN A NATURAL LANGUAGE. BUT NATURAL LANGUAGE IS PROBABLY THE WORST KIND\nOF INPUT BECAUSE IT CAN BE QUITE AMBIGUOUS. THE PROCESS OF RETRIEVING\nINFORMATION FROM THE COMPUTER WOULD BE SO TIME-CONSUMING THAT YOU WOULD\nBE BETTER OFF SPENDING THAT TIME GETTING THE INFORMATION DIRECTLY FROM\nAN EXPERT.\n-- GARY KILDALL (INVENTOR OF CP/M, ONE OF THE FIRST OS FOR THE MICRO).",
      "length": 437
    },
    {
      "text": "THE ONLY WAY OF DISCOVERING THE LIMITS OF THE POSSIBLE IS TO VENTURE A\nLITTLE WAY PAST THEM INTO THE IMPOSSIBLE.\n-- ARTHUR C. CLARKE",
      "length": 132
    },
    {
      "text": "ANY SUFFICIENTLY ADVANCED TECHNOLOGY IS UNDISTINGUISHABLE FROM MAGIC.\n-- ARTHUR C. CLARKE",
      "length": 89
    },
    {
      "text": "THAT IS THE INEVITABLE HUMAN RESPONSE. WE’RE RELUCTANT TO BELIEVE THAT\nGREAT DISCOVERIES ARE IN THE AIR. WE WANT TO BELIEVE THAT GREAT\nDISCOVERIES ARE IN OUR HEADS—AND TO EACH PARTY IN THE MULTIPLE THE\nPRESENCE OF THE OTHER PARTY IS INVARIABLY CAUSE FOR SUSPICION.\n-- MALCOLM GLADWELL, WHO SAYS BIG IDEAS ARE RARE? ",
      "length": 315
    },
    {
      "text": "GOOD IDEAS ARE OUT THERE FOR ANYONE WITH THE WIT AND THE WILL TO FIND\nTHEM.\n-- MALCOLM GLADWELL, WHO SAYS BIG IDEAS ARE RARE?",
      "length": 125
    },
    {
      "text": "A PERSON WON'T BECOME PROFICIENT AT SOMETHING UNTIL HE OR SHE HAS DONE\nIT MANY TIMES. IN OTHER WORDS., IF YOU WANT SOMEONE TO BE REALLY GOOD AT\nBUILDING A SOFTWARE SYSTEM, HE OR SHE WILL HAVE TO HAVE BUILT 10 OR MORE\nSYSTEMS OF THAT TYPE.\n-- PHILIP GREENSPUN",
      "length": 258
    },
    {
      "text": "A PERSON WON'T RETAIN PROFICIENCY AT A TASK UNLESS HE OR SHE HAS AT ONE\nTIME LEARNED TO PERFORM THAT TASK VERY RAPIDLY. LEARNING RESEARCH\nDEMONSTRATES THAT THE SKILLS OF PEOPLE WHO BECOME ACCURATE BUT NOT FAST\nDETERIORATE MUCH SOONER THAN THE SKILLS OF PEOPLE WHO BECOME BOTH\nACCURATE AND FAST.\n-- PHILIP GREENSPUN",
      "length": 314
    },
    {
      "text": "TRAINING RESEARCH SHOWS THAT IF YOU GET SPEED NOW YOU CAN GET QUALITY\nLATER. BUT IF YOU DON'T GET SPEED YOU WILL NEVER GET QUALITY IN THE LONG\nRUN.\n-- PHILIP GREENSPUN",
      "length": 167
    },
    {
      "text": "BEWARE OF BUGS IN THE ABOVE CODE; I HAVE ONLY PROVED IT CORRECT, NOT\nTRIED IT.\n-- DONALD KNUTH",
      "length": 94
    },
    {
      "text": "WEAR YOUR BEST FOR YOUR EXECUTION AND STAND DIGNIFIED. YOUR LAST\nRECOURSE AGAINST RANDOMNESS IS HOW YOU ACT — IF YOU CAN’T CONTROL\nOUTCOMES, YOU CAN CONTROL THE ELEGANCE OF YOUR BEHAVIOUR. YOU WILL\nALWAYS HAVE THE LAST WORD.\n-- NASSIM TALEB",
      "length": 240
    },
    {
      "text": "THE HUMAN BRAIN STARTS WORKING THE MOMENT YOU ARE BORN AND NEVER STOPS\nUNTIL YOU STAND UP TO SPEAK IN PUBLIC.\n-- ANONYMOUS",
      "length": 122
    },
    {
      "text": "THE TROUBLE WITH THE WORLD IS THAT THE STUPID ARE ALWAYS COCKSURE AND\nTHE INTELLIGENT ARE ALWAYS FILLED WITH DOUBT.\n-- BERTRAND RUSSELL",
      "length": 135
    },
    {
      "text": "SIMPLE, CLEAR PURPOSE AND PRINCIPLES GIVE RISE TO COMPLEX, INTELLIGENT\nBEHAVIOR. COMPLEX RULES AND REGULATIONS GIVE RISE TO SIMPLE, STUPID\nBEHAVIOR.\n-- DEE HOCK, BIRTH OF THE CHAORDIC AGE",
      "length": 187
    },
    {
      "text": "C++ IS LIKE TEENAGE SEX: EVERYBODY IS TALKING ABOUT IT ALL THE TIME,\nONLY FEW ARE REALLY DOING IT.\n-- UNKNOWN",
      "length": 109
    },
    {
      "text": "FUNCTIONAL PROGRAMMING IS TO ALGORITHMS AS THE UBIQUITOUS LITTLE BLACK\nDRESS IS TO WOMEN'S FASHION.\n-- MARK TARVER (OF \"THE BIPOLAR LISP PROGRAMMER\" FAME)",
      "length": 154
    },
    {
      "text": "JAVA AND C++ MAKE YOU THINK THAT THE NEW IDEAS ARE LIKE THE OLD ONES.\nJAVA IS THE MOST DISTRESSING THING TO HIT COMPUTING SINCE MS-DOS.\n-- ALAN KAY",
      "length": 147
    },
    {
      "text": "FOR COMPLEX SYSTEMS, THE COMPILER AND DEVELOPMENT ENVIRONMENT NEED TO BE\nIN THE SAME LANGUAGE THAT ITS SUPPORTING. IT'S THE ONLY WAY TO GROW\nCODE.\n-- ALAN KAY",
      "length": 158
    },
    {
      "text": "SIMPLE THINGS SHOULD BE SIMPLE. COMPLEX THINGS SHOULD BE POSSIBLE.\n-- ALAN KAY",
      "length": 78
    },
    {
      "text": "I INVENTED THE TERM OBJECT-ORIENTED, AND I CAN TELL YOU I DID NOT HAVE\nC++ IN MIND.\n-- ALAN KAY",
      "length": 95
    },
    {
      "text": "ALL CREATIVITY IS AN EXTENDED FORM OF A JOKE.\n-- ALAN KAY",
      "length": 57
    },
    {
      "text": "IF YOU DON'T FAIL AT LEAST 90 PERCENT OF THE TIME, YOU'RE NOT AIMING\nHIGH ENOUGH.\n-- ALAN KAY",
      "length": 93
    },
    {
      "text": "REVOLUTIONS COME FROM STANDING ON THE SHOULDERS OF GIANTS AND FACING IN\nA BETTER DIRECTION.\n-- ALAN KAY",
      "length": 103
    },
    {
      "text": "CE N’EST QUE PAR LES BEAUX SENTIMENTS QU’ON PARVIENT À LA FORTUNE !\n-- CHARLES BAUDELAIRE, CONSEILS AUX JEUNES LITTÉRATEURS.",
      "length": 124
    },
    {
      "text": "LA HAINE EST UNE LIQUEUR PRÉCIEUSE, UN POISON PLUS CHER QUE CELUI DES\nBORGIA, - CAR IL EST FAIT AVEC NOTRE SANG, NOTRE SANTÉ, NOTRE SOMMEIL,\nET LES DEUX TIERS DE NOTRE AMOUR! IL FAUT EN ÊTRE AVARE!\n-- CHARLES BAUDELAIRE, CONSEILS AUX JEUNES LITTÉRATEURS.",
      "length": 254
    },
    {
      "text": "L’ART QUI SATISFAIT LE BESOIN LE PLUS IMPÉRIEUX SERA TOUJOURS LE PLUS\nHONORÉ.\n-- CHARLES BAUDELAIRE, CONSEILS AUX JEUNES LITTÉRATEURS.",
      "length": 134
    },
    {
      "text": "IF IT LOOKS LIKE A DUCK, WALKS LIKE A DUCK, AND QUACKS LIKE A DUCK, IT'S\nA DUCK.\n-- OFFICIAL DEFINITION OF \"DUCK TYPING\"",
      "length": 120
    },
    {
      "text": "IN OO, IT'S THE DATA THAT IS THE \"IMPORTANT\" THING: YOU DEFINE THE CLASS\nWHICH CONTAINS MEMBER DATA, AND ONLY INCIDENTALLY CONTAINS CODE FOR\nMANIPULATING THE OBJECT. IN FP, IT'S THE CODE THAT'S IMPORTANT: YOU\nDEFINE A FUNCTION WHICH CONTAINS CODE FOR WORKING WITH THE DATA, AND\nONLY INCIDENTALLY DEFINE WHAT THE DATA IS.\n-- ALMKGOR, ON REDDIT",
      "length": 342
    },
    {
      "text": "DES MOTS SIMPLES, QUAND ILS SONT BIEN UTILISÉS, FONT FAIRE À DES GENS\nORDINAIRES DES CHOSES EXTRAORDINAIRES.\n-- KHALED TANGAO",
      "length": 125
    },
    {
      "text": "IT WAS EDISON WHO SAID ‘1% INSPIRATION, 99% PERSPIRATION’. THAT MAY HAVE\nBEEN TRUE A HUNDRED YEARS AGO. THESE DAYS IT'S ‘0.01% INSPIRATION,\n99.99% PERSPIRATION’, AND THE INSPIRATION IS THE EASY PART.\n-- LINUX TORVALDS",
      "length": 217
    },
    {
      "text": "THE GREATEST CHALLENGE TO ANY THINKER IS STATING THE PROBLEM IN A WAY\nTHAT WILL ALLOW A SOLUTION.\n-- BERTRAND RUSSELL",
      "length": 117
    },
    {
      "text": "NO MATTER HOW MUCH YOU PLAN YOU’RE LIKELY TO GET HALF WRONG ANYWAY. SO\nDON’T DO THE ‘PARALYSIS THROUGH ANALYSIS’ THING. THAT ONLY SLOWS\nPROGRESS AND SAPS MORALE.\n-- 37 SIGNAL, GETTING REAL",
      "length": 188
    },
    {
      "text": "[INNOVATION] COMES FROM SAYING NO TO 1,000 THINGS TO MAKE SURE WE DON’T\nGET ON THE WRONG TRACK OR TRY TO DO TOO MUCH. WE’RE ALWAYS THINKING\nABOUT NEW MARKETS WE COULD ENTER, BUT IT’S ONLY BY SAYING NO THAT YOU\nCAN CONCENTRATE ON THE THINGS THAT ARE REALLY IMPORTANT.\n-- STEVE JOBS",
      "length": 280
    },
    {
      "text": "THE ABILITY TO SIMPLIFY MEANS TO ELIMINATE THE UNNECESSARY SO THAT THE\nNECESSARY MAY SPEAK.\n-- HANS HOFMANN",
      "length": 107
    },
    {
      "text": "HOWEVER BEAUTIFUL THE STRATEGY, YOU SHOULD OCCASIONALLY LOOK AT THE\nRESULTS.\n-- WINSTON CHURCHILL",
      "length": 97
    },
    {
      "text": "GENIUS IS 1% INSPIRATION AND 99% PERSPIRATION.\n-- THOMAS EDISON",
      "length": 63
    },
    {
      "text": "I’D RATHER WRITE PROGRAMS TO WRITE PROGRAMS THAN WRITE PROGRAMS.\n-- RICHARD SITES",
      "length": 81
    },
    {
      "text": "HEUREUX L'ÉTUDIANT QUI COMME LA RIVIÈRE PEUT SUIVRE SON COURS SANS\nQUITTER SON LIT...\n-- SEBASTIEN, SUR COMMENTCAMARCHE.NET",
      "length": 123
    },
    {
      "text": "SIDE PROJECTS ARE LESS MASTURBATORY THAN READING RSS, OFTEN MORE\nUSEFUL THAN MOBILEME, MORE EDUCATIONAL THAN THE COMMENTS ON REDDIT,\nAND USUALLY MORE FUN THAN LISTENING TO KEYNOTES.\n-- CHRIS WANSTRATH",
      "length": 200
    },
    {
      "text": ":NUNMAP CAN ALSO BE USED OUTSIDE OF A MONASTERY.\n-- VIM USER MANUAL",
      "length": 67
    },
    {
      "text": "I HAD TO LEARN HOW TO TEACH LESS, SO THAT MORE COULD BE LEARNED.\n-- TIM GALLWEY, THE INNER GAME OF WORK",
      "length": 103
    },
    {
      "text": "WORKERS OF THE WORLD, THE CHAINS THAT BIND YOU ARE NOT HELD IN PLACE BY\nA RULING CLASS, A \"SUPERIOR\" RACE, BY SOCIETY, THE STATE, OR A LEADER.\nTHEY ARE HELD IN PLACE BY NONE OTHER THAN YOURSELF. THOSE WHO SEEK TO\nEXPLOIT ARE NOT THEMSELVES FREE, FOR THEY PLACE NO VALUE IN FREEDOM. WHO\nIS IT THAT REALLY EMPLOYS YOU AND COMMANDS YOU TO PICK UP YOUR DAILY\nLOAD? AND WHO IS IT THAT YOU ALLOW TO PASS JUDGMENT ON THE ADEQUACY OF\nYOUR TOIL? WHO HAVE YOU EMPOWERED TO DANGLE THE CARROT BEFORE YOU AND\nTHREATEN WITH DISAPPROVAL? WHO, WHEN YOU WAKE EACH MORNING, SENDS YOU\nOFF TO WHAT YOU CALL YOUR WORK?\nIS THERE AN \"I WANT TO\" BEHIND ALL YOUR \"I HAVE TO,\" OR HAVE YOU BEEN SO\nLONG FORGOTTEN TO YOURSELF THAT \"I WANT\" EXISTS ONLY AS AN IDEA IN YOUR\nHEAD? IF YOU HAVE DISCONNECTED FROM YOUR SOUL'S DESIRE AND ARE DROWNING\nIN AN OCEAN OF \"HAVE TO,\" THEN RISE UP AND OVERTHROW YOUR MASTER. BEGIN\nTHE JOURNEY TOWARD EMANCIPATION.  WORK ONLY IN SUCH A WAY THAT YOU ARE\nTRULY SELF-EMPLOYED.\n-- TIM GALLWEY, THE INNER GAME OF WORK",
      "length": 1017
    },
    {
      "text": "THE WORK BEGINS ANEW, THE HOPE RISES AGAIN, AND THE DREAM LIVES ON.\n-- TED KENNEDY",
      "length": 82
    },
    {
      "text": "THE HARDEST PART OF DESIGN ... IS KEEPING FEATURES OUT.\n-- DONALD NORMAN ",
      "length": 73
    },
    {
      "text": "BEFORE SOFTWARE CAN BE REUSABLE IT FIRST HAS TO BE USABLE.\n-- RALPH JOHNSON ",
      "length": 76
    },
    {
      "text": "THE OPPOSITE OF LOVE IS NOT HATE, IT IS INDIFFERENCE.\n-- ELIE WIESEL",
      "length": 68
    },
    {
      "text": "- GBI DE FER\n- HOWA!\n- ON VA EN FRANCE\n- NON, JE VAIS PAS!\n- POURQUOI?\n- PARCE KI Y A PAS AGOUTI LÀ-BAS!\n-- GBI DE FER",
      "length": 118
    },
    {
      "text": "ECOUTE, CROIS EN TON PROJET... IMPLIQUE TOI À FOND... TROUVE DES ASPECTS\nINNOVANTS POUR TE DISTINGUER DES AUTRES. TU VERRAS QUE TU TE FERAS\nREMARQUER TRÈS FACILEMENT...\n-- KHALED TANGAO",
      "length": 185
    },
    {
      "text": "PERPETUAL OPTIMISM IS A FORCE MULTIPLIER.\n-- COLIN POWELL",
      "length": 57
    },
    {
      "text": "BE THE CHANGE YOU WANT TO SEE IN THE WORLD.\n-- MAHATMA GANDHI",
      "length": 61
    },
    {
      "text": "THE ART OF GETTING SOMEONE ELSE TO DO SOMETHING YOU WANT DONE BECAUSE HE\nWANTS TO DO IT [LEADERSHIP].\n-- DWIGHT D. ENSEINHOVER.",
      "length": 127
    },
    {
      "text": "NO ONE IS ALL EVIL. EVERYBODY HAS A GOOD SIDE. IF YOU KEEP WAITING, IT\nWILL COMME UP.\n-- RANDY PAUSCH",
      "length": 101
    },
    {
      "text": "EXPERIENCE IS WHAT YOU GET WHEN YOU DON'T GET WHAT YOU WANT.\n-- CITED BY RANDY PAUSCH",
      "length": 85
    },
    {
      "text": "LUCK IS WHERE PREPARATION MEETS OPPORTUNITY.\n-- RANDY PAUSCH",
      "length": 60
    },
    {
      "text": "BONNE BOSSE ET RESTE LE BOSS.\n-- DARRYL AMEDON",
      "length": 46
    },
    {
      "text": "THE GREATEST OF ALL WEAKNESSES IS THE FEAR OF APPEARING WEAK.\n-- J. B. BOSSUET, POLITICS FROM HOLY WRIT, 1709",
      "length": 109
    },
    {
      "text": "IT'S EASIER TO ASK FORGIVENESS THAN IT IS TO GET PERMISSION.\n-- REAR ADMIRAL DR. GRACE HOPPER",
      "length": 93
    },
    {
      "text": "AN INVESTMENT IN KNOWLEDGE ALWAYS PAYS THE BEST INTEREST.\n-- BENJAMIN FRANKLIN",
      "length": 78
    },
    {
      "text": "NATIVES WHO BEAT DRUMS TO DRIVE OFF EVIL SPIRITS ARE OBJECTS OF SCORN TO\nSMART AMERICANS WHO BLOW HORNS TO BREAK UP TRAFFIC JAMS.\n-- MARY ELLEN KELLY",
      "length": 149
    },
    {
      "text": "A CS PROFESSOR ONCE EXPLAINED RECURSION AS FOLLOWS:\nA CHILD COULDN'T SLEEP, SO HER MOTHER TOLD HER A STORY ABOUT A LITTLE FROG,\n    WHO COULDN'T SLEEP, SO THE FROG'S MOTHER TOLD HER A STORY ABOUT A LITTLE BEAR,\n         WHO COULDN'T SLEEP, SO THE BEAR'S MOTHER TOLD HER A STORY ABOUT A LITTLE WEASEL...\n            WHO FELL ASLEEP.\n        ...AND THE LITTLE BEAR FELL ASLEEP;\n    ...AND THE LITTLE FROG FELL ASLEEP;\n...AND THE CHILD FELL ASLEEP.\n-- EVERYTHING2.COM",
      "length": 464
    },
    {
      "text": "NEVER DO THE IMPOSSIBLE. PEOPLE WILL EXPECT YOU TO DO IT FOREVER AFTER.\n-- PIGSANDFISHES.COM",
      "length": 92
    },
    {
      "text": "HIRE PEOPLE SMARTER THAN YOU.  WORK WITH PEOPLE SMARTER THAN YOU.\nLISTEN TO THEM. LET THEM LEAD YOU. TAKE THE BLAME FOR ALL FAILURES,\nGIVE AWAY THE CREDIT FOR ALL SUCCESSES.\n-- HOW TO FAIL: 25 SECRETS LEARNED THROUGH FAILURE",
      "length": 224
    },
    {
      "text": "GIVE UP CONTROL. YOU NEVER REALLY HAD IT ANYWAY.\n-- HOW TO FAIL: 25 SECRETS LEARNED THROUGH FAILURE",
      "length": 99
    },
    {
      "text": "NE TE METS PAS DE LIMITE, LA VIE SE CHARGERA DE LA METTRE A TA PLACE.\n-- DARRYL AMEDON",
      "length": 86
    },
    {
      "text": "ONLY TWO THINGS ARE INFINITE, THE UNIVERSE AND HUMAN STUPIDITY. AND I'M NOT SO\nSURE ABOUT THE FORMER.\n-- ALBERT EINSTEIN",
      "length": 120
    },
    {
      "text": "THE IMPORTANT THING IS NOT TO STOP QUESTIONING.\n-- ALBERT EINSTEIN",
      "length": 66
    },
    {
      "text": "DO NOT ACCEPT ANYTHING BECAUSE IT COMES FROM THE MOUTH OF A RESPECTED PERSON.\n-- BUDDHA",
      "length": 87
    },
    {
      "text": "WORK AS INTENSELY AS YOU PLAY AND PLAY AS INTENSELY AS YOU WORK.\n-- ERIC S. RAYMOND, HOW TO BE A HACKER",
      "length": 103
    },
    {
      "text": "A WITTY SAYING PROVES NOTHING\n-- VOLTAIRE",
      "length": 41
    },
    {
      "text": "SOUND METHODOLOGY CAN EMPOWER AND LIBERATE THE CREATIVE MIND; IT CANNOT INFLAME\nOR INSPIRE THE DRUDGE.\n-- FREDERICK P. BROOKS, NO SLIVER BULLET.",
      "length": 144
    },
    {
      "text": "LA CONNAISSANCE D'UN DÉFAUT NE L'ENLÈVE PAS, ELLE NOUS TORTURE JUSQU'À SA\nCORRECTION.\n-- DANIEL LOVEWIN (GUILLAUME KPOTUFE)",
      "length": 123
    },
    {
      "text": "JE CROIS AU FLOODING.\n-- KARIM BAINA (EN PARLANT DU DAILOGUE AVEC LES ADMINISTRATIONS)",
      "length": 86
    },
    {
      "text": "IL Y A TRÈS LOIN DE LA VELLÉITÉ À LA VOLNT, DE LA VOLONTÉ À LA RÉSOLUTION, DE LA\nRÉSOLUTION AU CHOIX DES MOYENS, DU CHOIX DS MOYENS À LAPPLICATION.\n-- JEAN-FRANÇOIS PAUL DE GONDI DE RETZ",
      "length": 186
    },
    {
      "text": "DO NOT SPOIL WHAT YOU HAVE BY DESIRING WHAT YOU HAVE NOT; BUT REMEMBER THAT WHAT\nYOU NOW HAVE WAS ONCE AMONG THE THINGS ONLY HOPED FOR.\n-- GREEK PHILOSOPHER EPICURUS",
      "length": 165
    },
    {
      "text": "NOBODY CAN MAKE YOU FEEL INFERIOR WITHOUT YOUR CONSENT.\n-- ELEANOR ROOSEVELT",
      "length": 76
    },
    {
      "text": "IF YOU TELL THE TRUTH, YOU DON'T HAVE TO REMEMBER ANYTHING.\n-- MARK TWAIN",
      "length": 73
    },
    {
      "text": "YOU KNOW YOU'RE IN LOVE WHEN YOU CAN'T FALL ASLEEP BECAUSE REALITY IS FINALLY\nBETTER THAN YOUR DREAMS.\n-- DR. SEUSS",
      "length": 115
    },
    {
      "text": "THE OPPOSITE OF LOVE IS NOT HATE, IT'S INDIFFERENCE.\n-- ELIE WIESEL",
      "length": 67
    },
    {
      "text": "LIFE IS WHAT HAPPENS TO YOU WHILE YOU'RE BUSY MAKING OTHER PLANS.\n-- JOHN LENNON",
      "length": 80
    },
    {
      "text": "WHENEVER YOU FIND YOURSELF ON THE SIDE OF THE MAJORITY, IT IS TIME TO PAUSE AND\nREFLECT.\n-- MARK TWAIN",
      "length": 102
    },
    {
      "text": "TO BE YOURSELF IN A WORLD THAT IS CONSTANTLY TRYING TO MAKE YOU SOMETHING ELSE\nIS THE GREATEST ACCOMPLISHMENT.\n-- RALPH WALDO EMERSON",
      "length": 133
    },
    {
      "text": "IT IS NOT A LACK OF LOVE, BUT A LACK OF FRIENDSHIP THAT MAKES UNHAPPY MARRIAGES.\n-- FRIEDRICH NIETZSCHE",
      "length": 103
    },
    {
      "text": "IN TERMS OF ENERGY, IT'S BETTER TO MAKE A WRONG CHOICE THAN NONE AT ALL.\n-- GEORGE LEONARD, MASTERY.",
      "length": 100
    },
    {
      "text": "COURAGE IS GRACE UNDER PRESSURE.\n-- ERNEST HEMINGWAY",
      "length": 52
    },
    {
      "text": "ACTUALLY, THE ESSENCE OF BOREDOM IS TO BE FOUND IN THE OBSESSIVE SEARCH FOR\nNOVELTY. SATISFACTION LIES IN MINDFUL REPETITION, THE DISCOVERY OF ENDLESS\nRICHNESS IN SUBTLE VARIATIONS ON FAMILIAR THEMES.\n-- GEORGE LEONARD, MASTERY.",
      "length": 228
    },
    {
      "text": "BEFORE ENLIGHTENMENT, CHOP WOOD AND CARRY WATER.\nAFTER ENLIGHTENMENT, CHOP WOOD AND CARRY WATER.\n-- ANCIENT EASTERN ADAGE",
      "length": 121
    },
    {
      "text": "ACKNOWLEDGING THE NEGATIVE DOESN'T MEAN SNIVELING [WHINING, COMPLAINING]; IT\nMEANS FACING THE TRUTH AND THEN MOVING ON.\n-- GEORGE LEONARD, MASTERY.",
      "length": 147
    },
    {
      "text": "WHATEVER YOU CAN DO, OR DREAM YOU CAN, BEGIN IT. BOLDNESS HAS GENIUS, POWER, AND\nMAGIC IN IT.\n-- GOETHE",
      "length": 103
    },
    {
      "text": "WHAT WE CHOOSE TO FIGHT IS SO TINY!\nWHAT FIGHTS US IS SO GREAT!\n...\nWHEN WE WIN IT'S WITH SMALL THINGS,\nAND THE TRIUMPH ITSELF MAKES US SMALL.\n...\nWINNING DOES NOT TEMPT THAT MAN.\nTHIS IS HOW HE GROWS: BY BEING DEFEATED, DECISIVELY,\nBY CONSTANTLY GREATER BEINGS. \n-- RAINER MARIA RILKE, THE MAN WATCHING.",
      "length": 304
    },
    {
      "text": "WE FAIL TO REALIZE THAT MASTERY IS NOT ABOUT PERFECTION. IT'S ABOUT A PROCESS,\nA JOURNEY. THE MASTER IS THE ONE WHO STAYS ON THE PATH DAY AFTER DAY, YEAR AFTER\nYEAR. THE MASTER IS THE ONE WHO IS WILLING TO TRY, AND FAIL, AND TRY AGAIN, FOR\nAS LONG AS HE OR SHE LIVES.\n-- GEORGE LEONARD, MASTERY.",
      "length": 295
    },
    {
      "text": "ARE YOU WILLING TO WEAR YOUR WHITE BELT?\n-- GEORGE LEONARD, MASTERY.",
      "length": 68
    }
  ]
}