{
  "spanishQuotes": [
    {
      "text": "¡VAMOS, PONTE ESTO CUANTO ANTES! ES UN UNIFORME DE APRENDIZ DE SOLDADO.",
      "length": 71
    },
    {
      "text": "A PARTIR DE AHORA COMIENZA EL TURNO DE NOCHE DE LA GUARDIA, EL MÁS ESTRICTO.",
      "length": 76
    },
    {
      "text": "¡PERO CON ESTE UNIFORME ENGAÑARÁS A LOS SOLDADOS Y PODRÁS IR A DONDE QUIERAS!",
      "length": 77
    },
    {
      "text": "AL MENOS ME HA ALIVIADO UN POCO PODER CONTARTE TODAS MIS AFLICCIONES...",
      "length": 71
    },
    {
      "text": "PERO PODRÉ HACERLO SOLA. NO IMPORTAN LOS PELIGROS QUE ACECHEN EN EL CAMINO...",
      "length": 77
    },
    {
      "text": "SIENTO MUCHO HABÉRTELO PEDIDO. DESPUÉS DE TODO, ACABAMOS DE CONOCERNOS...",
      "length": 73
    },
    {
      "text": "¿CÓMO? ¿DICES QUE VAS A AYUDARME A LLEGAR A LA TORRE DE LAS ALMAS?",
      "length": 66
    },
    {
      "text": "¡TE QUEDA GENIAL! ¡AHORA DEBEMOS IRNOS, ANTES DE QUE NOS VEAN LOS SOLDADOS!",
      "length": 75
    },
    {
      "text": "ES POSIBLE QUE SEAS EL ÚNICO QUE PUEDA BATIR EL RÉCORD.",
      "length": 55
    },
    {
      "text": "¿QUIERES SABER CUÁL ES EL RÉCORD? ¡900 GOLPES! ¡NI MÁS NI MENOS!",
      "length": 64
    },
    {
      "text": "AHORA QUE YA TIENES UNA ESPADA, ¡PODREMOS SALIR POR LA PARTE TRASERA DEL CASTILLO!",
      "length": 82
    },
    {
      "text": "LAS VÍAS HAN DESAPARECIDO Y LA LOCOMOTORA ESTÁ TOTALMENTE DESTROZADA...",
      "length": 71
    },
    {
      "text": "DICEN QUE HAY UN CAMINO QUE CONECTA ESTE CASTILLO CON LA TORRE DE LAS ALMAS.",
      "length": 76
    },
    {
      "text": "OÍ MUCHO ALBOROTO AFUERA, Y CUANDO FUI A VER QUÉ HABÍA PASADO...",
      "length": 64
    },
    {
      "text": "POR LO VISTO, ÉL SE HA LLEVADO LA PEOR PARTE Y TARDARÁ EN RECUPERARSE.",
      "length": 70
    },
    {
      "text": "LOS ENCONTRARON A LOS DOS TIRADOS NO MUY LEJOS DEL CASTILLO.",
      "length": 60
    },
    {
      "text": "ENTONCES FUE CUANDO  TE TRAJERON AQUÍ, JUNTO CON EL OTRO MAQUINISTA.",
      "length": 68
    },
    {
      "text": "¿DICES QUE EL MINISTRO NO ES HUMANO, Y QUE HA SECUESTRADO A LA PRINCESA?",
      "length": 72
    },
    {
      "text": "NO DEBERÍAS GASTARLE BROMAS A UN POBRE ANCIANO.",
      "length": 47
    },
    {
      "text": "MUY BIEN, ESPERO QUE ESTÉS PREPARADO PARA TU ENTRENAMIENTO. ",
      "length": 60
    }
  ]
}
